{
    "AF AMER 1": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Lecture, three hours; discussion, one hour. Introduction of methods, theories, conceptual frameworks, and key debates in black studies. Interrogation of how race structures notions of identity and meaning of blackness in relation to class, gender, and sexuality; essential role of African people in development of capitalism, liberalism, and democracy; what various disciplinary lenses and epistemologies (history, literature, sociology, geography, cultural studies, political theory, philosophy, etc.) reveal about experiences of black people in modern world. Key thinkers and ideas from across humanities and social sciences are highlighted. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Black Studies", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER 105A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Lecture, three hours; discussion, one hour. How do we know what we know? Why do we think what we think? Where does our knowledge of self come from? Introductory set of theoretical tools to begin to answer such questions of consciousness, especially as they concern status of black people in contemporary racial-economic context of U.S. and elsewhere in African diaspora. Drawing on interdisciplinary black studies scholarship of range of writers that may include Ida B. Wells, Carter G. Woodson, Claudia Jones, W.E.B. Du Bois, Ngugi wa Thiong'o, Steve Biko, Frantz Fanon, Walter Rodney, George Jackson, Angela Davis, Jacob H. Carruthers, Stuart Hall, and Sylvia Wynter, to understand function of representation, language, and ideology in creation of social meaning and role of literature, media, education, and popular culture in organization of black consciousness and exercise of power. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Ideology and Black Consciousness", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER 105B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Seminar, four hours. Introduction of history of political philosophy of Pan-Africanism from its origins in 19th century. Critical reading of biographical and autobiographic texts to deepen understanding of major themes and critiques of Pan-African thought, including those of race and racial formation, gender and sexuality, capitalism and labor exploitation, and nationalism and state repression. Application of history and critical readings to students' own lives and family history through researching and writing short autobiographical text. Students gain experience in conducting interviews and oral histories and genealogical and archival research. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Issues in Pan-African Biography and Autobiography", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER 106A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Lecture, four hours; discussion, one hour. Introduction to historical and contemporary Africa, with focus on modern history, politics, and culture. Survey of key issues impacting Africa today and in future--from political discussions on independence, geopolitics of aid and development, cultural transmission and relationship with African diaspora, modern movement and migration, and debates on racial and geographic divide between Arab north and south of Sahara. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Africa and World", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER 108": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Lecture, three hours; discussion, one hour. How has jazz come to symbolize so many different political tendencies--freedom and democratic values, threat to order and civil society, possibility of integration and racial harmony, black liberation and nationalism, conservatism, surrealism, socialism, etc., throughout 20th century? What about jazz enables people to read their political aspirations and hopes in what is primarily instrumental, improvised music? Exploration of history of ideas about jazz, specifically how writers, activists, movements, and musicians understood politics of jazz. Exploration of political imaginations--here and abroad--in particular in jazz and question of freedom--social freedom, political freedom, cultural, and artistic freedom. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Jazz and Political Imagination", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER 140": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Lecture, four hours. Exploration of some more powerful visions for freedom, liberation, and racial justice in African diasporic world, with focus on political struggles, intellectual movements, and creative expressions that formed part of radical black imagination during last century. Following of black diasporic citizens from Accra to Harlem to Havana as they struggled for freedom within and beyond movements against colonialism and racial oppression, for Pan-Africanism, feminism, and Negritude, and through utopian art forms like Afro-Futurism. Consideration of how black activists, artists, and intellectuals in various parts of globe have worked to envision and enact real possibilities for sovereignty and liberation both at home and abroad. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Radical Black Imaginaries: Politics, Identity, and Struggle", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER 174": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Lecture, four hours. Discussion of evolution of black divergence within African American community by focusing on evolution of differences -- specifically class differences -- that have minimized black progress when compared with other races and cultures like Asians and Jews. Examination of origins and plight of lower-class blacks in stark juxtaposition with black leadership and African Americans occupying higher socioeconomic levels. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Intraracial Differences in 20th-Century Black America", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER 175": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Lecture, four hours. Designed for students who are seeking to become healthcare professionals so they understand importance of how race and ethnicity impact delivery of healthcare. Focus on need to increase diversity of health professions workforce as means to address health disparities. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Racial and Ethnic Disparities in Healthcare", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER 176": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Lecture, four hours; discussion, one hour. Throughout American history, race relations have been inextricably linked to law. Both perpetuation of racism and struggle against it have involved various legal institutions, especially U.S. Supreme Court. Lawyers on all sides have often played pivotal roles in establishing legal standards defining political, economic, social, and psychological status of African Americans (and other racial and ethnic minorities). Historical overview and in-depth examination of selected major highlights of these legal developments, including Constitutional sources of racism, legal foundations establishing and eliminating slavery, major Supreme Court decisions before and during civil rights era, and contemporary legal retreat from civil rights protections. Examination of legal processes and legal profession in broader historical and political context. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Race, Racism, and Law", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER 177": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Lecture, four hours. Discussion and exploration of challenges facing black students at predominantly white institutions (PWIs), ways in which Proposition 209 has affected black student community, spaces on and off campus that empower students, and issues of access and equity in higher education. Critical discussions about student experiences/concerns/challenges at UCLA, addressing specific strategies for success, and notions of empowerment that provide context for students from underrepresented backgrounds at predominantly white universities. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "African Americans in Higher Education", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER 188A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Lecture, three hours; discussion, one hour. Program-sponsored experimental or temporary courses, such as those taught by visiting faculty members. May be repeated for credit with topic change. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Courses in African American Studies", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER 188B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Seminar, three hours. Exploration of range of public policies concerned with promoting civil rights of racial minorities, with focus on education, voting, and housing. Why did such policies initially arise? How have they since developed? How effective have they been in closing racial gap? Provides students with basic foundation of knowledge for thinking through contemporary debates surrounding policies that seek to redress racial discrimination in U.S. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Race and Public Policy", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER 189": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER 189HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Contracts", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER 19": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Fiat Lux Freshman Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER 195": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Tutorial, four hours. Preparation: 3.0 grade-point average in major. Limited to junior/senior majors. Internship in supervised setting in community agency or business. Students meet on regular basis with instructor and provide periodic reports of their experience. Eight units may be applied toward major requirements. May be repeated for credit. Individual contract with supervising faculty member required. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Community or Corporate Internships in Afro-American Studies", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER 196": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Tutorial, three hours. Limited to juniors/seniors. Entry-level research apprenticeship under guidance of faculty mentor affiliated with Afro-American Studies major or minor. Short-term research project culminating in term paper in African American studies or related field required. Research may be in part or totally in relation to faculty member's research. May be repeated for credit. Individual contract required. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Research Apprenticeship in Afro-American Studies", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER 197": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Tutorial, four hours. Preparation: 3.0 grade-point average in major. Limited to juniors/seniors. Individual intensive study, with scheduled meetings to be arranged between faculty member and student. Assigned reading and tangible evidence of mastery of subject matter required. Eight units may be applied toward major requirements. May be repeated for credit. Individual contract required. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Individual Studies in Afro-American Studies", 
        "unit": "2 to 8", 
        "unitType": "RANGE"
    }, 
    "AF AMER 198": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Tutorial, four hours. Limited to juniors/seniors. Development and completion of honors thesis or comprehensive research project under direct supervision of faculty member. May be repeated for credit. Individual contract required. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Research in Afro-American Studies", 
        "unit": "2 to 4", 
        "unitType": "RANGE"
    }, 
    "AF AMER 199": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Tutorial, to be arranged with faculty member who directs study. Preparation: 3.0 grade-point average in major. Limited to juniors/seniors. Supervised individual research or investigation of large project under guidance of faculty mentor. Culminating paper or project required. Eight units may be applied toward major requirements. May be repeated for maximum of 16 units. Individual contract required. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Directed Research or Senior Project in Afro-American Studies", 
        "unit": "2 to 4", 
        "unitType": "RANGE"
    }, 
    "AF AMER 200D": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Seminar, four hours. Historical examination of black women's experiences in U.S. from antebellum era to present. Exploration of key themes, including gender formation, sexuality, labor and class, collective action, gender and sexual violence, reproduction, and role of law. How have intersecting forms of oppression impacted black women's historical lives? How is difference constructed through interrelated and overlapping ideologies of race and gender? How do historians uncover black women's historical lives and what are challenges to such discoveries? Examination of black women's individual and collective struggles for freedom from racism, sexism, and heteropatriarchy as well as black women's participation in and challenge to social movements, including suffrage, women's liberation, civil rights, and black power. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "African American Women's History", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER 200H": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Seminar, four hours. Predominant trend in research in African American music highlights intersection of music with social and political movements, contextual socioeconomic realities, and cultural politics of identity. Civil rights, black power, feminism, sexual revolution, and anti-war were movements that shaped and were shaped by music of their respective historical contexts. Recent scholarship has also engaged questions pertaining to intra-African American politics of community: grappling with issues such as appropriation, economic exploitation, male privilege, and marginalization of creative artists. Examination of critical nexus between music and myriad of issues unearthed by this trend in scholarly study of black music. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Social Politics of Recent African American Music and Popular Culture", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER 241": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Lecture, four hours; discussion, one hour. Intensive research and study of major themes and issues in various areas of Afro-American studies. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Topics in Afro-American Studies", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER 270A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Seminar, three hours. Overview of research methodologies in humanities and social sciences, with firsthand reports from faculty in various fields. Introduction to research in and related to Afro-American studies and application of such research. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Survey of Afro-American Research", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER 375": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Seminar, to be arranged. Preparation: apprentice personnel employment as teaching assistant, associate, or fellow. Teaching apprenticeship under active guidance and supervision of regular faculty member responsible for curriculum and instruction at UCLA. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Teaching Apprentice Practicum", 
        "unit": "1 to 4", 
        "unitType": "RANGE"
    }, 
    "AF AMER 596": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Tutorial, to be arranged. Provides students with umbrella under which they can pursue specialized interests from which there is insufficient demand to warrant offering formal courses. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Directed Readings and Tutorials", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER 597": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Tutorial, to be arranged. Limited to graduate students. May not be applied toward M.A. course requirements. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Preparation for M.A", 
        "unit": "4 or 8", 
        "unitType": "RANGE"
    }, 
    "AF AMER 598": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Tutorial, to be arranged. Limited to graduate students. May not be applied toward M.A. course requirements. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Research for and Preparation of M.A", 
        "unit": "4 or 8", 
        "unitType": "RANGE"
    }, 
    "AF AMER 6": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Lecture, three hours; discussion, one hour. Overview of major intellectual trends that have shaped ways in which Afro-American thinkers have interpreted experiences of blacks in U.S., drawing from such fields as history, philosophy, and literature. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Trends in Black Intellectual Thought", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER 89": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER 89HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Contracts", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER 99": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Student Research Program", 
        "unit": "1 to 2", 
        "unitType": "RANGE"
    }, 
    "AF AMER C191": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Seminar, four hours. Research seminar on selected topics in Afro-American studies. Reading, discussion, and development of culminating project. May be repeated for credit. Concurrently scheduled with course C291. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Variable Topics Research Seminars: Afro-American Studies", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER C291": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "Seminar, four hours. Research seminar on selected topics in Afro-American studies. Reading, discussion, and development of culminating project. May be repeated for credit. Concurrently scheduled with course C191. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Topics in Afro-American Studies", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER CM112A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Ethnomusicology CM112.) Lecture, four hours. Historical and analytical examination of African American music in California, including history, migration patterns, and urbanism to determine their impact on development of African American music in California. Concurrently scheduled with course CM212A. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "African American Music in California", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER CM135A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Formerly numbered CM112D.) (Same as Art History CM135A.) Lecture, three hours. Detailed inquiry into work to circa 1900 of African American artists whose works provide insightful and critical commentary about major features of American life and society. Concurrently scheduled with course CM235A. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "African American Art before 1900", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER CM135B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Formerly numbered CM112E.) (Same as Art History CM135B.) Lecture, three hours. Detailed inquiry into work of African American artists from Columbian Exposition to 1963 March on Washington within context of social, political, and cultural engagement, as well as in codification of modern black life in U.S. Concurrently scheduled with course CM235B. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "African American Art, 1900 to 1963", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER CM212A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Ethnomusicology CM212.) Lecture, four hours. Historical and analytical examination of African American music in California, including history, migration patterns, and urbanism to determine their impact on development of African American music in California. Concurrently scheduled with course CM112A. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "African American Music in California", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER CM235A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Formerly numbered CM212D.) (Same as Art History CM235A.) Lecture, three hours. Detailed inquiry into work to circa 1900 of African American artists whose works provide insightful and critical commentary about major features of American life and society. Concurrently scheduled with course CM135A. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "African American Art before 1900", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER CM235B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Formerly numbered CM212E.) (Same as Art History CM235B.) Lecture, three hours. Detailed inquiry into work of African American artists from Columbian Exposition to 1963 March on Washington within context of social, political, and cultural engagement, as well as in codification of modern black life in U.S. Concurrently scheduled with course CM135B. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "African American Art, 1900 to 1963", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M102": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Asian American Studies M160 and Honors Collegium M102.) Lecture, four hours; screenings, two hours. Designed for juniors/seniors. Role of media in society and its influence on contemporary cultural environment, specifically in Los Angeles; issues of representation as they pertain to race, ethnicity, gender, and sexuality. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Culture, Media, and Los Angeles", 
        "unit": 6, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M103A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Theater M103A.) Lecture, three hours. Designed for juniors/seniors. Exploration of extant materials on history and literature of theater as developed and performed by African American artists in America from slavery to mid-1800s. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "African American Theater History: Slavery to Mid-1800s", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M103B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Theater M103B.) Lecture, three hours. Designed for juniors/seniors. Exploration of extant materials on history and literature of theater as developed and performed by African American artists in America from minstrel stage to rise of American musical. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "African American Theater History: Minstrel Stage to Rise of American Musical", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M103E": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Theater M103E.) Lecture, three hours. Survey and examination of African American plays from 1920s until birth of modern civil rights era. Examination of sociohistorical context out of which plays were created and critical essays that illustrate development of African American playwrights and their significant involvement in creation of diversified American theatrical tradition. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Modern African American Drama: Harlem Renaissance to Black Arts Movement", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M103J": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Theater M103J.) Lecture, three hours. Examination of black theater from Black Arts Movement of 1960s until today. Exploration of social and historical implications of work, and aesthetic experimentation of contemporary African American playwrights and movements. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Contemporary Black Theater: Modern Civil Rights Era to Black Lives Matter and Beyond", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M104A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as English M104A.) Lecture, four hours; discussion, one hour (when scheduled). Enforced requisite: English Composition 3 or 3H. Introductory survey of African American literature from 18th century through World War I, including oral and written forms (folktales, spirituals, sermons; fiction, poetry, essays), by authors such as Phillis Wheatley, Frances Harper, Frederick Douglass, Harriet Jacobs, Charles Chesnutt, Booker T. Washington, and Pauline Hopkins. P/NP or letter grading.", 
        "prerequisiteDescription": "English Composition 3 or 3H", 
        "prerequisites": [], 
        "title": "Early African American Literature", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M104B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as English M104B.) Lecture, four hours; discussion, one hour (when scheduled). Enforced requisite: English Composition 3 or 3H. Introductory survey of 20th-century African American literature from New Negro Movement of post-World War I period to 1960s, including oral materials (ballads, blues, speeches) and fiction, poetry, and essays by authors such as Jean Toomer, Claude McKay, Langston Hughes, Nella Larsen, Zora Neale Hurston, Richard Wright, Ann Petry, James Baldwin, Gwendolyn Brooks, and Ralph Ellison. P/NP or letter grading.", 
        "prerequisiteDescription": "English Composition 3 or 3H", 
        "prerequisites": [], 
        "title": "African American Literature from Harlem Renaissance to 1960s", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M104C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as English M104C.) Lecture, four hours; discussion, one hour (when scheduled). Enforced requisite: English Composition 3 or 3H. Introductory survey of African American literary expression from late 1950s through 1970s. Topics include rise of Black Arts Movement of 1960s and emergence of black women's writing in early 1970s, with focus on authors such as Lorraine Hansberry, Amiri Baraka, Nikki Giovanni, Alice Walker, Toni Morrison, Ishmael Reed, Audre Lorde, Paule Marshall, and Ernest Gaines. P/NP or letter grading.", 
        "prerequisiteDescription": "English Composition 3 or 3H", 
        "prerequisites": [], 
        "title": "African American Literature of 1960s and 1970s", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M104D": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as English M104D.) Lecture, four hours; discussion, one hour (when scheduled). Enforced requisite: English Composition 3 or 3H. Introductory survey of African American literature from 1980s to present covering range of genres, with emphasis on diversity of perspectives and styles that have emerged over past 30 years or so. Authors may include Toni Morrison, August Wilson, Octavia Butler, Anna Deavere Smith, June Jordan, Charles Johnson, and Rita Dove. P/NP or letter grading.", 
        "prerequisiteDescription": "English Composition 3 or 3H", 
        "prerequisites": [], 
        "title": "Contemporary African American Literature", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M104E": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as English M104E.) Lecture, four hours; discussion, one hour (when scheduled). Enforced requisite: English Composition 3 or 3H. Variable topics lecture course that provides opportunity to cover African American literature from wide range of theoretical, historical, format, and thematic perspectives. Topics may include African American autobiography, 20th-century African American literature and film, black diaspora literature, postmodern African American fiction, Afro-Futurism, and African American satire. May be repeated for credit with topic or instructor change. P/NP or letter grading.", 
        "prerequisiteDescription": "English Composition 3 or 3H", 
        "prerequisites": [], 
        "title": "Topics in African American Literature and Culture", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M107": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Ethnomusicology M119.) Lecture, four hours; discussion, one hour. Introduction to development of rap music and hip-hop culture, with emphasis on musical and verbal qualities, philosophical and political ideologies, gender representation, and influences on cinema and popular culture. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Cultural History of Rap", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M109": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Ethnomusicology M109 and Gender Studies M109.) Lecture, four hours; discussion, one hour. Sociocultural history of women in jazz and allied musical traditions from 1880s to present. Survey of women vocalists, instrumentalists, composers/arrangers, and producers and their impact on development of jazz. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Women in Jazz", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M10A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as History M10A.) Lecture, three hours; discussion, one hour. Exploration of development of African societies from earliest times to late 18th century. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "History of Africa to 1800", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M110A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Ethnomusicology M110A.) Lecture, four hours; discussion, one hour. Sociocultural history and survey of African American music covering Africa and its impact on Americas; music of 17th through 19th centuries; minstrelsy and its impact on representation of blacks in film, television, and theater; religious music, including hymns, spirituals, and gospel; black music of Caribbean and Central and South America; and music of black Los Angeles. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "African American Musical Heritage", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M110B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Ethnomusicology M110B.) Lecture, four hours; discussion, one hour. Sociocultural history and survey of African American music covering blues, pre-1947 jazz styles, rhythm 'n' blues, soul, funk, disco, hip-hop, and symbiotic relationship between recording industry and effects of cultural politics on black popular music productions. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "African American Musical Heritage", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M111": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Formerly numbered M145.) (Same as Ethnomusicology M111.) Lecture, three hours. Music of Duke Ellington, his life, and far-reaching influence of his efforts. Ellington's music, known as Ellingtonia, is one of largest and perhaps most important bodies of music ever produced in U.S. Covers many contributions of other artists who worked with Ellington, such as composer Billy Strayhorn and musicians Johnny Hodges, Cooties Williams, and Mercer Ellington. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Ellingtonia", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M114C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Labor and Workplace Studies M114C and Political Science M180A.) Lecture, three or four hours; discussion, one hour (when scheduled). Intensive introduction to African American political thought, with focus on major ideological trends and political philosophies as they have been applied and interpreted by African Americans. Debates and conflicts in black political thought, historical contest of African American social movements, and relationship between black political thought and major trends in Western thought. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "African American Political Thought", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M118": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as American Indian Studies M118, Asian American Studies M168, and Chicana and Chicano Studies M118.) Lecture, four hours. Exploration of issues in outreach and retention of students in higher education, especially through student-initiated programs, efforts, activities, and services, with focus on UCLA as case. May be repeated twice for credit. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Student-Initiated Retention and Outreach Issues in Higher Education", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M120": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Public Policy M120.) Lecture, three hours; discussion, one hour. Background in economics, sociology, or urban studies preferred but not required. Survey course to examine major debates and current controversies concerning public policy responses to social problems in urban America. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Race, Inequality, and Public Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M124": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Asian American Studies M124.) Lecture, three hours. Examination of processes and histories of racialization and colonization in U.S. Discussions, film screenings, guest speakers, and reading assignments, with focus on issues of cultural survival, empire, indigeneity, migration, resistance, sovereignty, and war. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Comparative Racialization and Indigeneity", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M141": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Lesbian, Gay, Bisexual, Transgender, and Queer Studies M141.) Lecture, four hours. Historical examination of black women's experiences in U.S. from antebellum era to present. By situating black women's experiences within major historical transitions in American history, exploration of key themes, including gender formation, sexuality, labor and class, collective action, gender and sexual violence, reproduction, and role of law. How have intersecting forms of oppression impacted black women's historical lives? How is difference constructed through interrelated and overlapping ideologies of race and gender? How do historians uncover black women's historical lives and what are challenges to such discoveries? Examination of black women's individual and collective struggles for freedom from racism, sexism, and heteropatriarchy, as well as black women's participation in and challenge to social movements, including suffrage, women's liberation, civil rights, and black power. Investigation of black women's intellectual history, including their cultural productions. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "African American Women's History", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M142": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Lesbian, Gay, Bisexual, Transgender, and Queer Studies M142.) Seminar, four hours. Interdisciplinary examination of historical and contemporary development of modern prison industrial complex in U.S., with attention to impact of prison industrial complex on immigrants, including undocumented residents, homeless populations, women, African Americans, and transgender nonconforming and lesbian, gay, bisexual, and transgender communities. Why does U.S. have largest prison population in world? What historical conditions and ideologies gave rise to this massive explosion in U.S. prisoner population? What policies have fueled mass imprisonment? Who is imprisoned? How have politicians used imprisonment as response to economic transformations and perceived social disorders? How is current crisis analogous to or distinct from regimes of racialized punishment in prior historical moments? Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Race, Gender, and Punishment", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M144": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Political Science M182.) Lecture, three or four hours; discussion, one hour (when scheduled). Preparation: one 140-level political science course or one upper division course on race or ethnicity from history, psychology, or sociology. Requisite: Political Science 40. Designed for juniors/seniors. Emphasis on dynamics of minority group politics in U.S., touching on conditions facing racial and ethnic groups, with black Americans being primary case for analysis. Three primary objectives: (1) to provide descriptive information about social, political, and economic conditions of black community, (2) to analyze important political issues facing black Americans, (3) to sharpen students' analytical skills. P/NP or letter grading.", 
        "prerequisiteDescription": "Political Science 40", 
        "prerequisites": [], 
        "title": "Ethnic Politics: African American Politics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M148": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Chicana and Chicano Studies M148.) Lecture, four hours. Examination of Chicana/Chicano intergroup relations and political coalitions with other Latinos, African Americans, Asian and Pacific Islanders, and Euro-Americans, especially in communities undergoing rapid changes in demographic composition. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Politics of Struggle: Race, Solidarity, and Resistance", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M150D": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as History M150D.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Exploration of musical genre known as funk that emerged in its popular form during late 1960s and reached popular high point, in black culture, during 1970s. Funk, fusion of gospel, blues, jazz, rhythm and blues, soul, rock, and many other musical styles, offers students unique window into recent African American history. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Recent African American Urban History: Funk Music and Politics of Black Popular Culture", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M154C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Political Science M184A.) Lecture, three or four hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Culture, history, politics, and identity of African Americans in Spanish and Lusophone Caribbean, South America, and Central America. Exploration of issues of identity in context of Afro/Latino migration to U.S. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Black Experience in Latin America and Caribbean I", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M154D": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Political Science M184B.) Lecture, three or four hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Examination of issues regarding race and ethnicity in Latin America, with emphasis on comparisons to U.S. and within Latin America. Covers populations of African and indigenous origins, with emphasis on former. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Black Experience in Latin America and Caribbean II", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M158A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as History M150A.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Examination of slavery experiences in various New World slave societies, with emphasis on outlining similarities and differences among legal status, treatment, and slave cultures of North American, Caribbean, and Latin American slave societies. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Comparative Slavery Systems", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M158B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as History M150B.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Survey of Afro-American experience, with emphasis on three great transitions of Afro-American life: transition from Africa to New World slavery, transition from slavery to freedom, and transition from rural to urban milieus. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Afro-American History", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M158C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as History M150C.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Survey of Afro-American experience, with emphasis on three great transitions of Afro-American life: transition from Africa to New World slavery, transition from slavery to freedom, and transition from rural to urban milieus. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Afro-American History", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M158E": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as History M150E.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Critical examination of African American search in first half of 20th century for national/group cohesion through collectively built institutions, associations, organized protest movements, and ideological self-definition. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "African American Nationalism in First Half of 20th Century", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M159P": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Anthropology M144P and Asian American Studies M169.) Lecture, three hours. Examination of race, socially constructed category, from anthropological perspective. Consideration of development of racial categories over time and in different regions, racial passing, multiracial identity in U.S., whiteness, race in popular culture, and race and identity. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Constructing Race", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M164": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Anthropology M144Q.) Lecture, three hours. Promotes understanding of contemporary sociocultural forms among Afro-Americans in U.S. by presenting comparative and diachronic perspective on Afro-American experience in New World. Emphasis on utilization of anthropological concepts and methods in understanding origins and maintenance of particular patterns of adaptation among black Americans. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Afro-American Experience in U.S.", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M165": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Labor and Workplace Studies M165 and Sociology M165.) Lecture, three hours; discussion, one hour. Limited to juniors/seniors. Exploration of relationship between race/ethnicity, employment, and U.S. labor movement. Analysis of underlying racial divisions in workforce and how they evolved historically. Consideration of circumstances under which workers and unions have excluded people of color from jobs and unions, as well as circumstances under which workers and unions have organized people of color into unions in efforts to improve their wages and working conditions. Impact of globalization on these dynamics. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sociology of Race and Labor", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M167": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Asian American Studies M163, Chicana and Chicano Studies M130, and Labor and Workplace Studies M167.) Seminar, three hours. Development of theoretical and practical understanding of worker center movement, with focus on historical factors that have led to emergence and growth of worker centers. Role of worker centers in promoting multiethnic and multiracial campaigns for workplace and economic justice. Transnational cross-border solidarity issues and rights of undocumented workers. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Worker Center Movement: Next Wave Organizing for Justice for Immigrant Workers", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M170A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Chicana and Chicano Studies M140A.) Seminar, three hours. Video production course, with emphasis on autobiographical, critical, and performance-based modes of nonfiction media making, drawing on practices of diasporic filmmakers who have grappled with suppressed collective memories of displacement, trauma, exile, and migration. What does it mean to make videos about memory in places where direct cues to remembering cannot be seen? Introduction to concepts from films and readings. Production assignments and screenings, with focus on questions of how to represent history, memory, family dynamics, and lived experience according to perspectives and interests of diasporic subjects. In Progress grading (credit to be given only on completion of course M170B).", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Diasporic Nonfiction: Media Engagements with Memory and Displacement I", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M170B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Chicana and Chicano Studies M140B.) Seminar, three hours. Enforced requisite: course M170A. Students complete 20- to 30-minute video projects about issues or experiences central to everyday lives of collectives of diasporic peoples. They learn to propose, record, edit, and distribute one socially engaged nonfiction video and draw on their experiences from course M170A in writing voiceover, choreographing dances, designing public performances, interviewing, and recording everyday life. P/NP or letter grading.", 
        "prerequisiteDescription": "course M170A", 
        "prerequisites": [
            [
                "AF AMER M170A"
            ]
        ], 
        "title": "Diasporic Nonfiction: Media Engagements with Memory and Displacement II", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M172": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Gender Studies M172 and Psychology M172.) Lecture, two and one half hours. Designed for juniors/seniors. Impact of social, psychological, political, and economic forces which impact on interpersonal relationships of Afro-American women as members of large society and as members of their biological and ethnic group. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Afro-American Woman in U.S.", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M173": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Chicana and Chicano Studies M173 and Labor and Workplace Studies M173.) Lecture, three hours; discussion, one hour. Overview of nonviolence and its impact on social movements both historically and in its present context in contemporary society, featuring lectures, conversations, films, readings, and guest speakers. Exploration of some historic contributions of civil rights struggles and role of nonviolent action throughout recent U.S. history. Examination of particular lessons of nonviolent movements as they impact social change organizing in Los Angeles. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Nonviolence and Social Movements", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M178": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Sociology M178.) Lecture, three hours; discussion, one hour. Limited to juniors/seniors. Historical sociology of Caribbean, with emphasis on colonialism and decolonization, development and underdevelopment, race-making institutions and evolution of race relations, nationalism and migration. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sociology of Caribbean", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M179A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as English M191A.) Seminar, three or four hours. Enforced requisite: English Composition 3 or 3H. Variable specialized studies course in African American literature. Topics may include Harlem Renaissance, African American literature in Nadir, black women's writing, contemporary African American fiction, African American poetry. May be repeated for credit with topic or instructor change. P/NP or letter grading.", 
        "prerequisiteDescription": "English Composition 3 or 3H", 
        "prerequisites": [], 
        "title": "Topics in African American Literature", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M18": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as American Indian Studies M18, Asian American Studies M18, and Chicana and Chicano Studies M18.) Seminar, two hours. Limited to freshmen/sophomores/first-year transfer students. Not open for credit to students with credit for course M118. Exploration of issues in retention at UCLA through lens of student-initiated and student-run programs, efforts, activities, and services. Focus on populations with historically low graduation rates targeted by Campus Retention Committee. May not be applied toward departmental major or minor elective requirements. May be repeated once for credit. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Leadership and Student-Initiated Retention", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M182A": {
        "corequisiteDescription": "course M194A", 
        "corequisites": [
            [
                "AF AMER M194A"
            ]
        ], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Education M182A.) Fieldwork, three hours. Enforced corequisite: course M194A. Students visit after-school site on weekly basis and use ethnographic methods to document learning. Opportunity for students to connect theories of development and language and literacy learning with practice. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Language, Literacy, and Human Development Ethnography", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M182B": {
        "corequisiteDescription": "course M194B", 
        "corequisites": [
            [
                "AF AMER M194B"
            ]
        ], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Education M182B.) Fieldwork, three hours. Enforced corequisite: course M194B. Students visit after-school site on weekly basis and use ethnographic methods to document learning. Opportunity for students to connect theories of development and language and literacy learning with practice. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Culture, Gender, and Human Development Ethnography", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M182C": {
        "corequisiteDescription": "course M194C", 
        "corequisites": [
            [
                "AF AMER M194C"
            ]
        ], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Education M182C.) Fieldwork, three hours. Enforced corequisite: course M194C. Students visit after-school site on weekly basis and use ethnographic methods to document learning. Opportunity for students to connect theories of development and language and literacy learning with practice. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Culture, Communications, and Human Development Ethnography", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M183A": {
        "corequisiteDescription": "course M194A", 
        "corequisites": [
            [
                "AF AMER M194A"
            ]
        ], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Education M183A.) Fieldwork, six hours. Enforced corequisite: course M194A. Students visit after-school site on weekly basis and use ethnographic methods to document learning. Opportunity for students to connect theories of development and language and literacy learning with practice. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Language, Literacy, and Human Development Ethnography", 
        "unit": 3, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M183B": {
        "corequisiteDescription": "course M194B", 
        "corequisites": [
            [
                "AF AMER M194B"
            ]
        ], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Education M183B.) Fieldwork, six hours. Enforced corequisite: course M194B. Students visit after-school site on weekly basis and use ethnographic methods to document learning. Opportunity for students to connect theories of development and language and literacy learning with practice. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Culture, Gender, and Human Development Ethnography", 
        "unit": 3, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M183C": {
        "corequisiteDescription": "course M194C", 
        "corequisites": [
            [
                "AF AMER M194C"
            ]
        ], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Education M183C.) Fieldwork, six hours. Enforced corequisite: course M194C. Students visit after-school site on weekly basis and use ethnographic methods to document learning. Opportunity for students to connect theories of development and language and literacy learning with practice. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Culture, Communications, and Human Development Ethnography", 
        "unit": 3, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M194A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Education M194A.) Seminar, three hours; laboratory, two hours (when scheduled). Research seminar designed to provide opportunity to combine theory and practice in study of human development in educational contexts. Focus on relationship between theories of development, culture, and language. May be taken independently for credit. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Language, Literacy, and Human Development Research Group Seminars", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M194B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Education M194B.) Seminar, three hours; laboratory, two hours (when scheduled). Research seminar designed to provide opportunity to combine theory and practice in study of human development in educational contexts. Focus on relationship between theories of development, culture, and gender. May be taken independently for credit. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Culture, Gender, and Human Development Research Group Seminars", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M194C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Education M194C.) Seminar, three hours; laboratory, two hours (when scheduled). Research seminar designed to provide opportunity to combine theory and practice in study of human development in educational contexts. Focus on relationship between theories of development, culture, and technologies. May be taken independently for credit. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Culture, Communications, and Human Development Research Group Seminars", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M195CE": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as American Indian Studies M195CE, Asian American Studies M195CE, Chicana and Chicano Studies M195CE, and Gender Studies M195CE.) Tutorial, one hour; fieldwork, eight to 10 hours. Limited to juniors/seniors. Internship in corporate, governmental, or nonprofit setting coordinated through Center for Community Learning. Comparative study of race, gender, and indigeneity in relation to contemporary workplace dynamics. Students complete weekly written assignments, attend biweekly meetings with graduate student coordinator, and write final research paper. Faculty sponsor and graduate student coordinator construct series of reading assignments that examine issues related to internship site. Individual contract with supervising faculty member required. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Comparative Approaches to Community and Corporate Internships", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M200A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as History M200V.) Seminar, three hours. May be repeated for credit. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Historiography: African American", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M200C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Sociology M262.) Seminar, three hours. Evaluation of social, cultural, and historical forces that affect socialization, stability, and interaction in black intimate relationships, beginning with theoretical framework from black feminism to analysis of economic and other expectations for partners in cohabiting and other types of unions. Examination of family life for both middle-class and low-income populations. Exploration of notions of black sexuality, including images of hyper-masculinity and femininity within black body and critical interrogation of notions of blackness and authenticity in racial identification. Contribution to greater understanding of black intimate relationships in different contexts, including lesbian and gay identities, Caribbean and other ethnic identities, and interracial intimacies. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Black Families and Relationships", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M200E": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as English M262.) Lecture, four hours. Intensive research and study of major themes, issues, and writers in Afro-American literature. Discussions and research on aesthetic, cultural, and social backgrounds of Afro-American writing. May be repeated for credit. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Studies in Afro-American Literature", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M200G": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Sociology M231.) Seminar, four hours. Race, class, gender, and sexual identity are axes of stratification, identity, and experience. They are not merely identities but structural locations that are often taken for granted and rarely confronted, challenged, or contested. Many times one or more of these go unrecognized. Exploration of multiple and intersecting ways these concepts shape society, individual life chances, and daily social interactions for African Americans. Examination of race, class, and gender inequalities as individual aspects of social life. How race, class, gender, and sexual identity shape societies and individual experiences in interaction with each other. How these inequalities shape and are shaped by social institutions, including cultural institutions, economy, and family, within context of experiences of black women and black men in contemporary U.S. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Race, Class, and Gender: Constructing Black Womanhood and Black Manhood in America", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M202": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Anthropology M245.) Seminar, four hours. Introduction to variety of ideas that underlie articulation of construct of African diaspora. Structured through understanding of African diaspora as historical formation, with focus on African diaspora as distinct intellectual project. Exploration of ways scholars have conceptualized and theorized diasporic condition of black peoples. Consideration of who belongs to African diaspora community, and how this community is imaged. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Critical Theory of African Diaspora", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M211": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Ethnomusicology M211.) Seminar, three hours. Requisites: Ethnomusicology M110A, M110B. Designed for graduate students. In-depth examination of intellectual history of African American music scholarship. Intensive investigation of problems, theories, interdisciplinary methods/schools of research, and bibliography related to study of African American music. Letter grading.", 
        "prerequisiteDescription": "Ethnomusicology M110A, M110B", 
        "prerequisites": [], 
        "title": "Seminar: African American Music", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M240": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Psychiatry M240.) Seminar, two hours. Designed for graduate students. Course aids mental health professionals and trainees in evaluation and treatment of African American families in terms of their cultural milieu, historical background, and economic status. Didactic presentations by instructors and invited guests form basis for supervised evaluation and case management with African American children and families. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Assessment and Treatment of African American Families", 
        "unit": 3, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M256": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Art History M236.) Seminar, three hours. Requisite: course CM235A or CM235B. Topics in African American art from 18th century to present. May be repeated for credit with consent of graduate adviser. S/U or letter grading.", 
        "prerequisiteDescription": "course CM235A or CM235B", 
        "prerequisites": [], 
        "title": "Topics in African American Art", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "AF AMER M5": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "AF AMER", 
        "departmentFullName": "African American Studies", 
        "description": "(Same as Sociology M5.) Lecture, four hours; discussion, one hour; field trips. Analysis and interpretation of social organization of black communities, with focus on origins and development of black communities, competing theories and research findings, defining characteristics and contemporary issues. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Social Organization of Black Communities", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }
}