{
    "APPLING 101W": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "APPLING", 
        "departmentFullName": "Applied Linguistics", 
        "description": "Lecture, four hours; discussion, one hour. Enforced requisite: English Composition 3 or 3H or English as a Second Language 36. Not open for credit to students with credit for course 101. Exploration of skills and conditions involved in successful second and foreign language learning; application of this knowledge in development of framework for teaching second and foreign languages. Satisfies Writing II requirement. Letter grading.", 
        "prerequisiteDescription": "English Composition 3 or 3H or English as a Second Language 36", 
        "prerequisites": [], 
        "title": "Introduction to Language Learning and Language Teaching", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "APPLING 102W": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "APPLING", 
        "departmentFullName": "Applied Linguistics", 
        "description": "Lecture, four hours; discussion, one hour. Enforced requisite: English Composition 3 or 3H or English as a Second Language 36. Exploration of learning via examination of second language acquisition. All normal children acquire language of their family and community (i.e., first language acquisition is ubiquitous). Success in second language acquisition is radically variable, and many learners, in spite of substantial opportunity and ability, achieve proficiencies that fall far below that of native speakers. Examination of interaction of emotion and cognition and nature of aptitude and motivation in learning. Primary vehicle for investigation to be autobiographies of second language learners. Satisfies Writing II requirement. Letter grading.", 
        "prerequisiteDescription": "English Composition 3 or 3H or English as a Second Language 36", 
        "prerequisites": [], 
        "title": "Nature of Learning", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "APPLING 153": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "APPLING", 
        "departmentFullName": "Applied Linguistics", 
        "description": "(Formerly numbered C153.) Seminar, four hours. Requisite: Linguistics 20. Introduction to analysis and description of form, meaning, and function of structures (morphological and syntactic), lexical items, and linguistic features of discourse. Exploration of variety of approaches integrating form, meaning, and function. Letter grading.", 
        "prerequisiteDescription": "Linguistics 20", 
        "prerequisites": [], 
        "title": "Functional Foundations of Language", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "APPLING 278": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "APPLING", 
        "departmentFullName": "Applied Linguistics", 
        "description": "Laboratory, four hours. Requisite: course M206. Designed for Applied Linguistics Ph.D. students. Advanced procedures in data analysis in field of discourse analysis, including development of large-scale research project and critical review of current research. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": "course M206", 
        "prerequisites": [
            [
                "APPLING M206"
            ]
        ], 
        "title": "Discourse Laboratory", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "APPLING 30W": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "APPLING", 
        "departmentFullName": "Applied Linguistics", 
        "description": "Lecture, three hours; discussion, two hours. Enforced requisite: English Composition 3 or 3H or English as a Second Language 36. Not open for credit to students with credit for course 30. Exploration of range of topics related to study of language and social interaction in both mundane and professional settings, particularly how language affects social lives and how social organization affects use of language. Topics include different approaches to study of language in social interaction (theories and research methodologies), issues regarding language and social identity (such as socioeconomic status, race, gender, and situational identity), and issues concerning language and culture (such as cross-cultural misunderstanding and language socialization). Satisfies Writing II requirement. Letter grading.", 
        "prerequisiteDescription": "English Composition 3 or 3H or English as a Second Language 36", 
        "prerequisites": [], 
        "title": "Language and Social Interaction", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "APPLING 375": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "APPLING", 
        "departmentFullName": "Applied Linguistics", 
        "description": "Seminar, to be arranged. Preparation: apprentice personnel employment as teaching assistant, associate, or fellow. Teaching apprenticeship under active guidance and supervision of regular faculty member responsible for curriculum and instruction at UCLA. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Teaching Apprentice Practicum", 
        "unit": "1 to 4", 
        "unitType": "RANGE"
    }, 
    "APPLING 40W": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "APPLING", 
        "departmentFullName": "Applied Linguistics", 
        "description": "Lecture, four hours; discussion, two hours. Enforced requisite: English Composition 3 or 3H or English as a Second Language 36. Not open for credit to students with credit for course 40. Prior knowledge of foreign languages not required. Introduction to language from sociological perspective of gender. Use of research and examples in English and other languages to explore nature of male and female \"genderlects\" and gendered language, as reflected in lexicon, language behavior, phonetics and intonation, and language acquisition and linguistic change. Satisfies Writing II requirement. Letter grading.", 
        "prerequisiteDescription": "English Composition 3 or 3H or English as a Second Language 36", 
        "prerequisites": [], 
        "title": "Language and Gender: Introduction to Gender and Stereotypes", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "APPLING 596": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "APPLING", 
        "departmentFullName": "Applied Linguistics", 
        "description": "Tutorial, to be arranged. Limited to M.A. and Ph.D. students. Independent study in one area of applied linguistics. May not be applied toward M.A. course requirements. Up to 8 units may be applied toward Ph.D. course requirements. May be repeated for credit. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Directed Individual Study", 
        "unit": "2 to 12", 
        "unitType": "RANGE"
    }, 
    "APPLING 597": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "APPLING", 
        "departmentFullName": "Applied Linguistics", 
        "description": "Tutorial, to be arranged. Preparation: completion of at least six courses of 32-unit requirement for Ph.D. May not be applied toward 32-unit requirement. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Preparation for Ph.D", 
        "unit": "4 to 8", 
        "unitType": "RANGE"
    }, 
    "APPLING 599": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "APPLING", 
        "departmentFullName": "Applied Linguistics", 
        "description": "Tutorial, to be arranged. Preparation: advancement to Ph.D. candidacy. Required of all Ph.D. candidates each term they are registered and engaged in dissertation preparation. May be repeated for credit but may not be applied toward Ph.D. course requirements. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Research for and Preparation of Ph.D", 
        "unit": "4 to 16", 
        "unitType": "RANGE"
    }
}