{
    "ARTS ED 101": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ARTS ED", 
        "departmentFullName": "Arts Education", 
        "description": "(Formerly numbered Arts and Architecture 101.) Lecture, three hours; outside study, nine hours. Selected topics in arts education explored through variety of approaches that may include community projects, guided teaching experiences, studio and/or fieldwork, readings, discussion, research papers, and oral presentations. Topics announced in advance. May be repeated for maximum of 8 units. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Selected Topics in Arts Education", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ARTS ED 103": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ARTS ED", 
        "departmentFullName": "Arts Education", 
        "description": "Lecture, three hours; outside study, nine hours. Students are in contact and conversation with active community-based artists and youth workers regularly utilizing socially engaged goals, principles, and practices. Based on readings and investigations, students research and write one case study on one particular arts site that is currently utilizing socially engaged pedagogies and art-making strategies. Theoretical and experiential components provided for students from all arts disciplines to explore tactics and strategy of socially engaged pedagogy and arts practice through variety of approaches that may include readings, visual and audio documentation, discussion, research papers, oral presentations, and relevant guest speakers. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Socially Engaged Pedagogy in Arts", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ARTS ED 105": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ARTS ED", 
        "departmentFullName": "Arts Education", 
        "description": "Lecture, three hours; outside study, nine hours. Examination of attitudes of prison arts programming with correctional staff, artists working in prisons, political figures, and community while critically engaging with consequences of correctional environment without outside influence of arts as role model for inspiration and discipline. Selected topics and themes in arts education in correctional institutions explored through variety of approaches that may include readings, visual and audio documentation, discussion, research papers, oral presentations, and relevant guest speakers. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Arts Programs in Correctional Institutions: History, Theory, and Practice", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ARTS ED 189": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ARTS ED", 
        "departmentFullName": "Arts Education", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "ARTS ED 19": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ARTS ED", 
        "departmentFullName": "Arts Education", 
        "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Fiat Lux Freshman Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "ARTS ED 195": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ARTS ED", 
        "departmentFullName": "Arts Education", 
        "description": "(Formerly numbered Arts and Architecture 195.) Tutorial, one hour; fieldwork, eight to 10 hours. Limited to juniors/seniors. Internship in supervised setting in K-12 schools or community arts organizations. Students meet on regular basis with instructor and provide periodic reports of their experience. May be repeated for maximum of 8 units. Individual contract with supervising faculty member required. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Community Internships in Arts Education", 
        "unit": "2 to 4", 
        "unitType": "RANGE"
    }, 
    "ARTS ED 197": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ARTS ED", 
        "departmentFullName": "Arts Education", 
        "description": "(Formerly numbered Arts and Architecture 197.) Tutorial, to be arranged. Preparation: 3.0 grade-point average in major. Limited to juniors/seniors in Visual and Performing Arts Education minor and/or arts education teaching sequence. Individual intensive study, with scheduled meetings to be arranged between faculty member and student. Tangible evidence of mastery of subject matter required. May be repeated for credit. Individual contract required. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Individual Studies in Arts Education", 
        "unit": "2 to 4", 
        "unitType": "RANGE"
    }, 
    "ARTS ED 20": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ARTS ED", 
        "departmentFullName": "Arts Education", 
        "description": "Lecture, three hours; discussion, one hour; outside study, 11 hours. Introduction to fields of community engagement and arts education informed by philosophies of progressive education and social justice movements. By looking at community engagement as issue of equity and social justice, examination of basic theories of creativity, artistic development, and community partnership, and history, philosophies, politics, and sociocultural trends of community engagement in American society. Attendance at UCLA arts presentations and introduction to creative process. Readings and discussions to understand community engagement and arts education as crucial elements of comprehensive education, with emphasis on writing process, including regular writing assignments that require students to read, analyze, critique, and evaluate community arts practices and arts education scholarship. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Community Engagement through Arts", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "ARTS ED 89": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ARTS ED", 
        "departmentFullName": "Arts Education", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "ARTS ED 99": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ARTS ED", 
        "departmentFullName": "Arts Education", 
        "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Student Research Program", 
        "unit": "1 to 2", 
        "unitType": "RANGE"
    }, 
    "ARTS ED M102": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ARTS ED", 
        "departmentFullName": "Arts Education", 
        "description": "(Formerly numbered Arts and Architecture M102.) (Same as Education M104.) Seminar, three hours; outside study, nine hours. Introductory course with focus on arts education for multiple publics in inner-city settings. Study of core issues in arts education, creativity, and social justice as students develop, implement, and assess original syllabi, lesson plans, and community learning projects for multiple publics in inner-city schools and arts organizations. Collaboration with partner schools in planning, teaching, and evaluation of arts education programs in dance, music, theater, and visual arts. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Arts Education for Multiple Publics: Theory and Practice", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ARTS ED M192": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ARTS ED", 
        "departmentFullName": "Arts Education", 
        "description": "(Formerly numbered Arts and Architecture M192.) (Same as Education M190.) Seminar, three hours. Enforced requisite: course M102. Limited to juniors/seniors. Training and supervised practicum for advanced undergraduate students participating in Visual and Performing Arts Education minor. Students implement and evaluate original arts education programs under guidance of faculty members in small course settings. P/NP or letter grading.", 
        "prerequisiteDescription": "course M102", 
        "prerequisites": [
            [
                "ARTS ED M102"
            ]
        ], 
        "title": "Arts Education Undergraduate Practicum: Preparation, Observation, and Practice", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ARTS ED M192SL": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ARTS ED", 
        "departmentFullName": "Arts Education", 
        "description": "(Formerly numbered Arts and Architecture M192SL.) (Same as Education M190SL.) Seminar, three hours; practicum, three hours; outside study, six hours. Enforced requisites: courses M102, M192. Limited to juniors/seniors. Continuation of arts education training and supervised practicum for advanced undergraduate students participating in Visual and Performing Arts Education minor. Students continue to implement and evaluate original arts education programs under guidance of faculty members and designated guiding teachers in K-12 public school settings. May be repeated for credit with consent of instructor. P/NP or letter grading.", 
        "prerequisiteDescription": "courses M102, M192", 
        "prerequisites": [], 
        "title": "Arts Education Undergraduate Practicum and Capstone Project", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }
}