{
    "BMD RES 100HA": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "BMD RES", 
        "departmentFullName": "Biomedical Research", 
        "description": "(Formerly numbered Life Sciences 100HA.) Lecture, two hours; laboratory, 10 hours. Requisite: course 10H. Course 100HA is requisite to 100HB, which is requisite to 100HC. Designed for undergraduates who are committed to pursuing research. Advanced research training in genetics, cell and developmental biology, bioinformatics, functional genomics. Techniques include electron microscopy, other light microscopies, immunohistochemistry. Part of Undergraduate Research Consortium in Functional Genomics sponsored by Howard Hughes Medical Institute Professors Program. Letter grading.", 
        "prerequisiteDescription": "course 10H", 
        "prerequisites": [
            [
                "BMD RES 10H"
            ]
        ], 
        "title": "Advanced Research in Genes, Genetics, and Genomics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "BMD RES 100HB": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "BMD RES", 
        "departmentFullName": "Biomedical Research", 
        "description": "(Formerly numbered Life Sciences 100HB.) Lecture, two hours; laboratory, 10 hours. Requisite: course 100HA. Designed for undergraduates who are committed to pursuing research. Advanced research training in genetics, cell and developmental biology, bioinformatics, functional genomics. Techniques include electron microscopy, other light microscopies, immunohistochemistry. Part of Undergraduate Research Consortium in Functional Genomics sponsored by Howard Hughes Medical Institute Professors Program. Letter grading.", 
        "prerequisiteDescription": "course 100HA", 
        "prerequisites": [
            [
                "BMD RES 100HA"
            ]
        ], 
        "title": "Advanced Research in Genes, Genetics, and Genomics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "BMD RES 100HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "BMD RES", 
        "departmentFullName": "Biomedical Research", 
        "description": "(Formerly numbered Life Sciences 100HC.) Lecture, two hours; laboratory, 10 hours. Requisite: course 100HB. Designed for undergraduates who are committed to pursuing research. Advanced research training in genetics, cell and developmental biology, bioinformatics, functional genomics. Techniques include electron microscopy, other light microscopies, immunohistochemistry. Part of Undergraduate Research Consortium in Functional Genomics sponsored by Howard Hughes Medical Institute Professors Program. Letter grading.", 
        "prerequisiteDescription": "course 100HB", 
        "prerequisites": [
            [
                "BMD RES 100HB"
            ]
        ], 
        "title": "Advanced Research in Genes, Genetics, and Genomics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "BMD RES 10H": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "BMD RES", 
        "departmentFullName": "Biomedical Research", 
        "description": "(Formerly numbered Life Sciences 10H.) Lecture, 90 minutes; laboratory, six hours; computer laboratory, 90 minutes. Limited to 30 students. Basic training in biological research, including techniques in genetics, model organism, bioinformatics, functional genomics, electron microscopy. Part of Undergraduate Research Consortium in Functional Genomics sponsored by Howard Hughes Medical Institute Professors Program. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Research Training in Genes, Genetics, and Genomics", 
        "unit": 6, 
        "unitType": "ABSOLUTE"
    }, 
    "BMD RES 188SA": {
        "corequisiteDescription": "HNRS 101E", 
        "corequisites": [], 
        "departmentAbbreviation": "BMD RES", 
        "departmentFullName": "Biomedical Research", 
        "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Individual Studies for USIE Facilitators", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "BMD RES 188SB": {
        "corequisiteDescription": "HNRS 101E", 
        "corequisites": [], 
        "departmentAbbreviation": "BMD RES", 
        "departmentFullName": "Biomedical Research", 
        "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.", 
        "prerequisiteDescription": "course 188SA", 
        "prerequisites": [
            [
                "BMD RES 188SA"
            ]
        ], 
        "title": "Individual Studies for USIE Facilitators", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "BMD RES 188SC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "BMD RES", 
        "departmentFullName": "Biomedical Research", 
        "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.", 
        "prerequisiteDescription": "course 188SB", 
        "prerequisites": [
            [
                "BMD RES 188SB"
            ]
        ], 
        "title": "Individual Studies for USIE Facilitators", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "BMD RES 189": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "BMD RES", 
        "departmentFullName": "Biomedical Research", 
        "description": "Lecture, three hours; discussion, one hour. Developments in architecture and urban design from prehistory to 1600, constructing critical positions within which implications of terms history, architecture, city, and culture can be explored. Focus on examples from Europe and Mediterranean Basin and periodic exploration of world context. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "BMD RES 189HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "BMD RES", 
        "departmentFullName": "Biomedical Research", 
        "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Contracts", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "BMD RES 19": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "BMD RES", 
        "departmentFullName": "Biomedical Research", 
        "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Fiat Lux Freshman Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "BMD RES 193H": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "BMD RES", 
        "departmentFullName": "Biomedical Research", 
        "description": "Seminar, three hours. Limited to Biomedical Research minor students. Presentation and discussion of recent papers from primary literature in biosciences. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Journal Club Seminars: Current Topics in Biomedical Research", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "BMD RES 194H": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "BMD RES", 
        "departmentFullName": "Biomedical Research", 
        "description": "Seminar, three hours. Requisite: course 193H. Limited to Biomedical Research minor students. Preparation of oral presentations based on student laboratory research at UCLA. May be repeated for credit. Letter grading.", 
        "prerequisiteDescription": "course 193H", 
        "prerequisites": [
            [
                "BMD RES 193H"
            ]
        ], 
        "title": "Research Group Seminars: Data Presentation in Biomedical Research", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "BMD RES 199": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "BMD RES", 
        "departmentFullName": "Biomedical Research", 
        "description": "Tutorial, 12 hours. Limited to Biomedical Research minor students. Supervised individual research under guidance of faculty mentor. Culminating report describing progress and signed by student and faculty mentor required. May be repeated for credit. Individual contract required. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Directed Biomedical Research", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "BMD RES 5HA": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "BMD RES", 
        "departmentFullName": "Biomedical Research", 
        "description": "Lecture, three hours. Designed for freshmen/sophomores. Exploration of scientific concepts and experimental approaches through seminars by UCLA faculty members on their cutting-edge research. Topics may include areas of study such as cancer, stem cells, and infectious disease, as well as more basic research in cell and molecular biology. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Biomedical Research: Concepts and Strategies", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "BMD RES 5HB": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "BMD RES", 
        "departmentFullName": "Biomedical Research", 
        "description": "Lecture, three hours; discussion, one hour. Requisite: course 5HA. Designed for freshmen/sophomores. Exploration of scientific concepts and experimental approaches through seminars by UCLA faculty members on their cutting-edge research. Topics may include areas of study such as cancer, stem cells, and infectious disease, as well as more basic research in cell and molecular biology. Student investigation of one or more laboratories on campus and presentation of brief synopsis of single research project from one laboratory. Letter grading.", 
        "prerequisiteDescription": "course 5HA", 
        "prerequisites": [
            [
                "BMD RES 5HA"
            ]
        ], 
        "title": "Biomedical Research: Essential Skills and Concepts", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "BMD RES 89": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "BMD RES", 
        "departmentFullName": "Biomedical Research", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "BMD RES 89HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "BMD RES", 
        "departmentFullName": "Biomedical Research", 
        "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Contracts", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "BMD RES 99": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "BMD RES", 
        "departmentFullName": "Biomedical Research", 
        "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Student Research Program", 
        "unit": "1 to 2", 
        "unitType": "RANGE"
    }
}