{
    "CHIN 1": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, two hours; discussion, three hours. Not open to students who have learned, from whatever source, enough Chinese to qualify for more advanced courses. Introduction to fundamentals of standard Chinese, including pronunciation, grammar, and Chinese characters, with emphasis on all four basic language skills -- speaking, listening comprehension, reading, and writing. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Elementary Modern Chinese", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 10": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, 10 hours; discussion, 10 hours. Recommended preparation: course 3, 3A, or 8, or Chinese placement test or courses equivalent to elementary-level Chinese. Second-year Chinese. Not open to students who have learned, from whatever source, enough Chinese to qualify for more advanced courses. Intensive course equivalent to courses 4, 5, and 6. Designed to strengthen communicative skills of listening, speaking, reading, and writing. Grammar reviews, knowledge of idiomatic expressions, and both traditional and simplified characters. Completion of course 10 is equivalent to completion of course 6. Offered in summer only. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Intermediate Modern Chinese: Intensive", 
        "unit": 15, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 100A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, two hours. Enforced requisite: course 6 or 10 with grade of C or better or Chinese placement test. Course 100A with grade of C or better or Chinese placement test is enforced requisite to 100B; course 100B with grade of C or better or Chinese placement test is enforced requisite to 100C. Third-year Chinese. Not open to students who have learned, from whatever source, enough Chinese to qualify for more advanced courses. Materials selected from contemporary Chinese publications, with emphasis on social sciences. Texts analyzed for their linguistic features and social and cultural background. Readings, compositions, informal debates on topical issues, and oral presentations. P/NP or letter grading.", 
        "prerequisiteDescription": "course 6 or 10 with grade of C or better or Chinese placement test", 
        "prerequisites": [], 
        "title": "Advanced Modern Chinese", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 100B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, two hours. Enforced requisite: course 100A with grade of C or better or Chinese placement test. Third-year Chinese. Not open to students who have learned, from whatever source, enough Chinese to qualify for more advanced courses. Materials selected from contemporary Chinese publications, with emphasis on social sciences. Texts analyzed for their linguistic features and social and cultural background. Readings, compositions, informal debates on topical issues, and oral presentations. P/NP or letter grading.", 
        "prerequisiteDescription": "course 100A with grade of C or better or Chinese placement test", 
        "prerequisites": [], 
        "title": "Advanced Modern Chinese", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 100C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, two hours. Enforced requisite: course 100B with grade of C or better or Chinese placement test. Third-year Chinese. Not open to students who have learned, from whatever source, enough Chinese to qualify for more advanced courses. Materials selected from contemporary Chinese publications, with emphasis on social sciences. Texts analyzed for their linguistic features and social and cultural background. Readings, compositions, informal debates on topical issues, and oral presentations. P/NP or letter grading.", 
        "prerequisiteDescription": "course 100B with grade of C or better or Chinese placement test", 
        "prerequisites": [], 
        "title": "Advanced Modern Chinese", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 100D": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, two hours. Enforced requisite: course 6A with grade of C or better or Chinese placement test. Course 100D with grade of C or better or Chinese placement test is enforced requisite to 100E; course 100E with grade of C or better or Chinese placement test is enforced requisite to 100F. Third-year Chinese for heritage speakers. Not open to students who have learned, from whatever source, enough Chinese to qualify for more advanced courses. Materials selected from contemporary Chinese publications, with emphasis on social sciences. Texts analyzed for their linguistic features and social and cultural background. Readings, compositions, informal debates on topical issues, and oral presentations. P/NP or letter grading.", 
        "prerequisiteDescription": "course 6A with grade of C or better or Chinese placement test", 
        "prerequisites": [], 
        "title": "Advanced Modern Chinese for Heritage Speakers", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 100E": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, two hours. Enforced requisite: course 100D with grade of C or better or Chinese placement test. Third-year Chinese for heritage speakers. Not open to students who have learned, from whatever source, enough Chinese to qualify for more advanced courses. Materials selected from contemporary Chinese publications, with emphasis on social sciences. Texts analyzed for their linguistic features and social and cultural background. Readings, compositions, informal debates on topical issues, and oral presentations. P/NP or letter grading.", 
        "prerequisiteDescription": "course 100D with grade of C or better or Chinese placement test", 
        "prerequisites": [], 
        "title": "Advanced Modern Chinese for Heritage Speakers", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 100F": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, two hours. Enforced requisite: course 100E with grade of C or better or Chinese placement test. Third-year Chinese for heritage speakers. Not open to students who have learned, from whatever source, enough Chinese to qualify for more advanced courses. Materials selected from contemporary Chinese publications, with emphasis on social sciences. Texts analyzed for their linguistic features and social and cultural background. Readings, compositions, informal debates on topical issues, and oral presentations. P/NP or letter grading.", 
        "prerequisiteDescription": "course 100E with grade of C or better or Chinese placement test", 
        "prerequisites": [], 
        "title": "Advanced Modern Chinese for Heritage Speakers", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 100I": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, 10 hours; discussion, 10 hours. Enforced requisite: course 6 or 10 with grade of C or better or Chinese placement test. Not open to students who have learned, from whatever source, enough Chinese to qualify for more advanced courses. Intensive course equivalent to courses 100A, 100B, and 100C. Materials selected from contemporary Chinese publications, with emphasis on social sciences. Texts analyzed for their linguistic features and social and cultural background. Readings, compositions, informal debates on topical issues, and oral presentations. Offered in summer only. P/NP or letter grading.", 
        "prerequisiteDescription": "course 6 or 10 with grade of C or better or Chinese placement test", 
        "prerequisites": [], 
        "title": "Advanced Modern Chinese: Intensive", 
        "unit": 12, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 101A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, two hours; discussion, two hours. Requisite: course 100C or 100F or 100I or Chinese placement test. Not open to students who have learned, from whatever source, enough Chinese to qualify for more advanced courses. Advanced readings and discussion for students planning to do advanced coursework or research on China. Topics from magazines, journals, and books related to humanities and social sciences. May be taken independently for credit. Letter grading.", 
        "prerequisiteDescription": "course 100C or 100F or 100I or Chinese placement test", 
        "prerequisites": [], 
        "title": "Advanced Readings in Modern Chinese", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 101B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, two hours; discussion, two hours. Requisite: course 100C or 100F or 100I or Chinese placement test. Not open to students who have learned, from whatever source, enough Chinese to qualify for more advanced courses. Advanced readings and discussion for students planning to do advanced coursework or research on China. Topics from magazines, journals, and books related to humanities and social sciences. May be taken independently for credit. Letter grading.", 
        "prerequisiteDescription": "course 100C or 100F or 100I or Chinese placement test", 
        "prerequisites": [], 
        "title": "Advanced Readings in Modern Chinese", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 102A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, two hours; discussion, two hours. Recommended preparation: one to two years of college-level Chinese. Not open to native speakers. Designed to improve student language skills in service of business practice and ground language learning in authentic social cultural settings. Oral and written business communication, social etiquettes in business conduct, Chinese economic and business climate, business law and regulations, resources and environment, and business case studies. May be taken independently for credit. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Chinese for International Business", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 102B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, two hours; discussion, two hours. Enforced requisite: course 102A. Doing business with China and understanding Chinese economy and business conducts require advanced level of Chinese language proficiency and deep understanding of Chinese society and culture. Designed to improve student language skills in service of business practice and ground language learning in authentic social cultural settings. Oral and written business communication, social etiquettes in business conduct, Chinese economic and business climate, business law and regulations, resources and environment, and business case studies. Letter grading.", 
        "prerequisiteDescription": "course 102A", 
        "prerequisites": [
            [
                "CHIN 102A"
            ]
        ], 
        "title": "Advanced Chinese for International Business", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 102I": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, eight hours; discussion, eight hours. Recommended preparation: two years of college-level Chinese. Not open to native speakers. Doing business with China and understanding Chinese economy and business conducts require intermediate to advanced level of Chinese language proficiency and deep understanding of Chinese society and culture. Designed to improve student language skills in service of business practice and ground language learning in authentic social cultural settings. Oral and written business communication, social etiquettes in business conduct, Chinese economic and business climate, business law and regulations, resources and environment, and business case studies. Offered in summer only. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Business Chinese", 
        "unit": 8, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 103": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, two hours; discussion, two hours. Recommended preparation: one to two years of college-level Chinese. Chinese language and culture for special purposes. Exploration of interdependent relation between Chinese language and culture. Introduction to basic concepts in sociocultural linguistics, discourse analysis, and technology to analyze Chinese language and cultural conventions expressed through verbal and non-verbal linguistic devices. Major coverage on language use as reflected in various types of media: film, television, Internet, advertisement, etc. May be repeated for credit. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Topics in Chinese Language and Culture", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 108FL": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, two hours. Enforced requisite: course 100C or 100I or Chinese placement test. Students must be concurrently enrolled in affiliated main course. Additional work in Chinese to augment work assigned in main course, including reading, writing, and other exercises. May be repeated for credit. P/NP or letter grading.", 
        "prerequisiteDescription": "course 100C or 100I or Chinese placement test", 
        "prerequisites": [], 
        "title": "Special Studies: Readings in Chinese", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 109": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Tutorial, two hours. Requisite: course 100C or Chinese placement test. Tutorial and guided independent study to help students develop advanced to superior proficiency in oral and written Chinese. May be repeated for credit. P/NP or letter grading.", 
        "prerequisiteDescription": "course 100C or Chinese placement test", 
        "prerequisites": [], 
        "title": "Advanced Tutorial Instruction in Chinese", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 110A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 3 or Chinese placement test. Course 110A is enforced requisite to 110B, which is enforced requisite to 110C. Grammar and readings in selected premodern texts. P/NP or letter grading.", 
        "prerequisiteDescription": "course 3 or Chinese placement test", 
        "prerequisites": [], 
        "title": "Introduction to Classical Chinese", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 110B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 110A. Grammar and readings in selected premodern texts. P/NP or letter grading.", 
        "prerequisiteDescription": "course 110A", 
        "prerequisites": [
            [
                "CHIN 110A"
            ]
        ], 
        "title": "Introduction to Classical Chinese", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 110C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 110B. Grammar and readings in selected premodern texts. P/NP or letter grading.", 
        "prerequisiteDescription": "course 110B", 
        "prerequisites": [
            [
                "CHIN 110B"
            ]
        ], 
        "title": "Introduction to Classical Chinese", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 130A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 100B or Chinese placement test. Readings and discussion of works of modern Chinese literature. May be taken independently for credit. Letter grading.", 
        "prerequisiteDescription": "course 100B or Chinese placement test", 
        "prerequisites": [], 
        "title": "Readings in Modern Chinese Literature", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 130B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 100B or Chinese placement test. Readings and discussion of works of modern Chinese literature. May be taken independently for credit. Letter grading.", 
        "prerequisiteDescription": "course 100B or Chinese placement test", 
        "prerequisites": [], 
        "title": "Readings in Modern Chinese Literature", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 131": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, two hours; discussion, one hour. Readings in original language. Exploration of Sinophone as analytic category for literature written in Sinitic languages. Theories of Sinophone and literary texts from Taiwan, Hong Kong, Malaysia, China, and elsewhere. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "World Sinophone Literature: Theories and Texts", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 135": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, two hours; discussion, one hour; film viewing, three hours. Enforced requisite: course 100C or 100I or Chinese placement test. Viewing and discussion of Chinese films, along with relevant readings in Chinese. Letter grading.", 
        "prerequisiteDescription": "course 100C or 100I or Chinese placement test", 
        "prerequisites": [], 
        "title": "Chinese-Language Film and Culture", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 139": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Recommended preparation: course 50. Interdisciplinary survey of historic and literary gardens in China, with focus on English translations of texts by native writers and recent Western scholarship. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Gardens in China", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 140A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours. Enforced requisite: course 110C. Advanced classical Chinese. Readings and discussion of works of premodern Chinese literature. May be taken independently for credit. Letter grading.", 
        "prerequisiteDescription": "course 110C", 
        "prerequisites": [
            [
                "CHIN 110C"
            ]
        ], 
        "title": "Readings in Classical Chinese Literature: Poetry", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 140B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours. Enforced requisite: course 110C. Advanced classical Chinese. Readings and discussion of works of premodern Chinese literature. May be taken independently for credit. Letter grading.", 
        "prerequisiteDescription": "course 110C", 
        "prerequisites": [
            [
                "CHIN 110C"
            ]
        ], 
        "title": "Readings in Classical Chinese Literature: Prose", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 140C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours. Enforced requisite: course 110C. Advanced classical Chinese. Readings and discussion of works of premodern Chinese literature. Each course may be taken independently for credit. Letter grading.", 
        "prerequisiteDescription": "course 110C", 
        "prerequisites": [
            [
                "CHIN 110C"
            ]
        ], 
        "title": "Readings in Classical Chinese Literature: Fiction", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 140D": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours. Enforced requisite: course 110C. Advanced classical Chinese. Readings and discussion of works of premodern Chinese literature. May be taken independently for credit. Letter grading.", 
        "prerequisiteDescription": "course 110C", 
        "prerequisites": [
            [
                "CHIN 110C"
            ]
        ], 
        "title": "Readings in Classical Chinese Literature: Philosophical Texts", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 151": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Requisite: English Composition 3 or 3H or one course from Comparative Literature 1A, 1B, 1C, 1D. Knowledge of Chinese not required. Lectures and reading of representative works from 1900 to present in English translation. Letter grading.", 
        "prerequisiteDescription": "English Composition 3 or 3H or one course from Comparative Literature 1A, 1B, 1C, 1D", 
        "prerequisites": [], 
        "title": "Chinese Literature in Translation: Modern Literature", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 152": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, two hours; discussion, one hour. Knowledge of Chinese not required. Investigation of various topics in contemporary Chinese literature and culture, including politics and poetics of Chinese postmodernism, nativism, feminism, mass culture, and media. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Topics in Contemporary Chinese Literature and Culture", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 154": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, two hours; discussion, one hour; film viewing, three hours. Knowledge of Chinese not required. History of Chinese-language cinemas, with emphasis on mainland China. Examination of film style and aesthetics, as well as contexts of industry, economics, politics, culture, and society. May not be repeated for credit. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Chinese Cinema", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 155": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, two hours; discussion, one hour; film viewing, three hours. Knowledge of Chinese not required. Critical study of films from China, Hong Kong, Taiwan, and Chinese diaspora. Examination of aesthetics, genres, directors and stars, other arts and media, and cultural and political histories. May be repeated for credit with topic change. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Topics in Chinese Cinema", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 157": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Examination of various aspects of modern and contemporary popular culture in China, Taiwan, and Hong Kong from cultural studies perspective. Genres and media include literature, print culture, cinema, martial arts film and fiction, television, radio, pop music, visual arts, fashion, advertising, and cyberculture. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Contemporary Chinese Popular Culture", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 165": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Recommended requisite: course 100A or 110B or Japanese 110A or Korean 100A or Chinese placement test. Readings in premodern Buddhist texts written in literary Chinese and taken from translated Indian sutras, indigenous exegetical materials, Chinese apocryphal scriptures, and Ch'an writings. Problems in translation from Indo-European languages into Chinese; evolution of Chinese Buddhist terminology. Coverage varies. May be repeated for credit with consent of instructor. Letter grading.", 
        "prerequisiteDescription": "course 100A or 110B or Japanese 110A or Korean 100A or Chinese placement test", 
        "prerequisites": [], 
        "title": "Introduction to Chinese Buddhist Texts", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 174": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Knowledge of Chinese not required. Introduction to early Chinese narratives and theories of military, diplomatic, and rhetorical strategy. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Chinese Strategic Thought", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 175SL": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours; fieldwork, two hours. Knowledge of Chinese not required. Community-based survey of Chinese thought as represented in texts of Zhou through early Han periods (circa 1000 to 100 B.C.E.), with focus on invention of Confucian tradition (including Five Classics) and on defenses of that tradition against challenges from Mohists, Taoists, and other groups of thinkers. Service learning component includes meaningful work with community partners, such as local schools, selected in advance by instructor. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Community-Based Introduction to Chinese Thought", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 176": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Knowledge of Chinese not required. Examination of movement to revitalize and reinterpret teachings of Confucius during Tang, Song, Yuan, and Ming dynasties, with consideration of both neo-Confucian philosophy and social action. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Neo-Confucianism", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 180": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Knowledge of Chinese not required. Survey of corpus of traditional Chinese mythology, with focus on examples preserved in variety of early texts, later evolutions in dramatic and fictional works, and evidence from visual arts. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Chinese Mythology and Supernatural", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 182": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Exploration of role of trade and piracy at threshold of globalization (13th to 17th century), with focus on continuity and transformation in Asiatic trade network in response to early global trade. Investigation based on archaeological study of porcelain, tracing movement from kilns around Chinese trading ports to shipwrecks and consumer societies in Southeast Asia and colonial Americas. As one of most important commodities on trans-Pacific voyage, close association of porcelain production and trade with international piracy in traditional historiography presents new angle for understanding dynamics of early global trade and industries. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Archaeology of Early Global Trade and Piracy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 184": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Preventing crime and administering justice are important parts of any society, but these are not straightforward or simple processes. What is crime? Are there crimes so terrible that they merit special kinds of punishment? How is punishment decided and by whom? What happens if justice is not carried out? Consideration of these questions as they apply to premodern China from multiple perspectives: legal codes and casebooks, literary re-imaginings of trials, depictions of postmortem punishment, and tales of supernatural retribution. Discussion of how legal and penal systems of China have been represented in West. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Crime, Law, and Punishment in Traditional China", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 185": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Knowledge of Chinese not required. Based on studies of cultural, historical, anthropological, and archaeological materials, introduction to how Chinese have been engaging themselves in fields of food eating and love making. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Food and Love in Chinese Culture", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 186": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Knowledge of Chinese not required. Early Chinese study of their own past, types of artifacts, beginnings of scientific archaeology, and surveys of major excavations of sites of all periods. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Archaeology in China", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 187": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Recommended requisite: course 3. Coverage of (1) development of Chinese writing system from pottery inscriptions 6,000 years ago to modern simplified forms and studies of six scripts principles that were used to form Chinese characters and (2) aesthetic training of calligraphic art and its appreciation, with focus on ways of recognizing and interpreting cursive style, common form of handwriting. Letter grading.", 
        "prerequisiteDescription": "course 3", 
        "prerequisites": [
            [
                "CHIN 3"
            ]
        ], 
        "title": "Chinese Etymology and Calligraphy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 189": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 189HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Contracts", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 19": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Fiat Lux Freshman Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 191A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Designed for juniors/seniors. Research seminar on selected topics in premodern Chinese literature, thought, and culture. Reading, discussion, and development of culminating project. May be repeated for credit. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Variable Topics Research Seminars: Classical China", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 191B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Designed for juniors/seniors. Research seminar on selected topics in modern and contemporary literature and culture from China and Taiwan. Reading, discussion, and development of culminating project. May be repeated for credit. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Variable Topics Research Seminars: 20th-Century China and Taiwan", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 197": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Tutorial, to be arranged. Limited to juniors/seniors and graduate students who desire more advanced or specialized instruction in Chinese. Individual intensive study, with scheduled meetings to be arranged between faculty member and student. Assigned reading and tangible evidence of mastery of subject matter required. May be repeated for credit. Individual contract required; see undergraduate adviser. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Individual Studies in Chinese", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 1A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, two hours; discussion, three hours. Recommended preparation: ability to speak and understand Mandarin or other Chinese dialects at elementary levels. Not open to students who have learned, from whatever source, enough Chinese to qualify for more advanced courses. Designed for students who already have certain listening and speaking skills in Mandarin or other Chinese dialects at elementary levels. Training in all four basic language skills (speaking, listening, reading, and writing). P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Elementary Modern Chinese for Advanced Beginners", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 2": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, two hours; discussion, three hours. Enforced requisite: course 1 with grade of C or better or Chinese placement test. First-year Chinese. Not open to students who have learned, from whatever source, enough Chinese to qualify for more advanced courses. Continuation of course 1. P/NP or letter grading.", 
        "prerequisiteDescription": "course 1 with grade of C or better or Chinese placement test", 
        "prerequisites": [], 
        "title": "Elementary Modern Chinese", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 200A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Requisite: course 110C. Lectures and discussion designed to develop basic skills in using traditional Chinese research materials. Topics include classical dictionaries; sinological indices; bibliographical, biographical, and geographical sources; encyclopedias; anthologies; rare editions; illustrated matter and calligraphy. Letter grading.", 
        "prerequisiteDescription": "course 110C", 
        "prerequisites": [
            [
                "CHIN 110C"
            ]
        ], 
        "title": "Research Methods in Chinese", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 200B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Introduction to major bibliographical and methodological resources in field of premodern Chinese literature, with focus on research tools in field and on scholarship in English on major literary genres, periods, and authors. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Proseminar: Premodern Chinese Literature", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 200C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Introduction to major bibliographical and methodological resources in fields of modern Chinese literary and cinematic studies, with focus on theoretical tools, historical knowledge, and critical trends. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Proseminar: Modern Chinese Literature and Cinema", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 205": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Methodology course intended for graduate students in 20th-century Chinese literature and culture. Discussion of major theoretical and textual issues and methods. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Critical Issues in Chinese and Sinophone Literature", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 209": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Exploration of selected topics and issues in Sinophone literature, literature written in Sinitic languages by ethnic minority writers in China, and literature written by those living outside China across world, especially in Malaysia, Taiwan, Singapore, and the U.S. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Issues in Sinophone Literature", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 210": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours. Designed for graduate students. Discussion of history of modern Chinese literature, focusing on sources, controversies, major literary genres, and critical approaches to studying relationship between literature and history. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Modern Chinese Literary History", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 211A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Preparation: reading knowledge of literary Chinese. Topics rotate among major textual traditions and chronological periods. Emphasis on philological, critical, and historical approaches. May be repeated for credit with consent of instructor. In Progress grading (credit to be given only on completion of course 211B).", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Seminar: Classical Chinese Poetry", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 211B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Preparation: reading knowledge of literary Chinese. Topics rotate among major textual traditions and chronological periods. Emphasis on philological, critical, and historical approaches. May be repeated for credit with consent of instructor. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Seminar: Classical Chinese Poetry", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 212": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Readings/discussion, three hours. Selected readings from classical poetic tradition, with focus on individual poets, themes, or other critical issues. May be repeated for credit with consent of instructor. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Topics in Chinese Poetry", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 213A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours; film-viewing laboratory, two hours. Advanced topics in Chinese-language cinemas. Examination of theory and methodology, historiography, industry and institutions, style and aesthetics, major genres and artists, other arts and media, other cinematic traditions, and social contexts. May be repeated for credit with consent of instructor. In Progress grading (credit to be given only on completion of course 213B).", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Chinese-Language Cinemas", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 213B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours; film-viewing laboratory, two hours. Advanced topics in Chinese-language cinemas. Examination of theory and methodology, historiography, industry and institutions, style and aesthetics, major genres and artists, other arts and media, other cinematic traditions, and social contexts. May be repeated for credit with consent of instructor. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Chinese-Language Cinemas", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 220A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Discussions to be framed by Western literary and cultural theory, investigating both challenges and limitations Western theory may pose for Chinese literary and cultural studies. Specific topics vary from year to year. In Progress grading (credit to be given only on completion of course 220B).", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Theoretical Approaches to Chinese and Sinophone Cultures", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 220B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Discussions to be framed by Western literary and cultural theory, investigating both challenges and limitations Western theory may pose for Chinese literary and cultural studies. Specific topics vary from year to year. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Theoretical Approaches to Chinese and Sinophone Cultures", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 224A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Critical reading and discussion of selected topics in Chinese functional linguistics (discourse and grammar, corpus linguistics, sociolinguistics, language change). May be repeated for credit with consent of instructor. In Progress grading (credit to be given only on completion of course 224B).", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Seminar: Selected Topics in Chinese Linguistics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 224B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Critical reading and discussion of selected topics in Chinese functional linguistics (discourse and grammar, corpus linguistics, sociolinguistics, language change). May be repeated for credit with consent of instructor. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Seminar: Selected Topics in Chinese Linguistics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 226A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Critical reading and discussion of selected topics in Chinese applied linguistics (teaching Chinese as a second language, second language acquisition theories and practices). May be repeated for credit with consent of instructor. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Seminar: Topics in Chinese Applied Linguistics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 230A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Selected readings in 20th-century Chinese literature, emphasizing fiction. Discussion of individual research projects. May be repeated for credit. In Progress grading (credit to be given only on completion of course 230B).", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Seminar: Selected Topics in Modern Chinese Literature", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 230B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Selected readings in 20th-century Chinese literature, emphasizing fiction. Discussion of individual research projects. May be repeated for credit. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Seminar: Selected Topics in Modern Chinese Literature", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 241A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Preparation: working knowledge of classical Chinese. Close reading of chapters from Han dynasty collection of writings on forms of music, social interaction, education, marriage, and mourning in Zhou royal court, with discussion of topics in recent cultural semiology and anthropology. In Progress grading (credit to be given only on completion of course 241B).", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Heaven, Earth, and Monarchy in Ancient China", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 241B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Preparation: working knowledge of classical Chinese. Close reading of chapters from Han dynasty collection of writings on forms of music, social interaction, education, marriage, and mourning in Zhou royal court, with discussion of topics in recent cultural semiology and anthropology. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Heaven, Earth, and Monarchy in Ancient China", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 242A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Recommended preparation: command of literary Chinese. Reading and discussions of selections from one traditional Chinese classic (Confucian Five Classics, others), with introduction to exegetical history, secondary scholarship, and research methodology. Topics vary from year to year. May be repeated for credit. In Progress grading (credit to be given only on completion of course 242B).", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Chinese Classics and Exegetical Traditions", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 242B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Recommended preparation: command of literary Chinese. Reading and discussions of selections from one traditional Chinese classic (Confucian Five Classics, others), with introduction to exegetical history, secondary scholarship, and research methodology. Topics vary from year to year. May be repeated for credit. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Chinese Classics and Exegetical Traditions", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 243": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, two hours. Translation, grammatical analysis, and discussion of selections from premodern Chinese texts. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Translation Workshop: Premodern Chinese Texts", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 245A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Preparation: reading knowledge of colloquial and literary Chinese. Seminar topics alternate yearly between traditional narrative and drama, with emphasis on generic, hermeneutical, and historical approaches. Topics in narrative selected from genres from Chou through Ch'ing periods. Topics in drama selected from tsa-chü and ch'uan-ch'i. May be repeated for credit with consent of instructor. In Progress grading (credit to be given only on completion of course 245B).", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Seminar: Traditional Chinese Narrative and Drama", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 245B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Preparation: reading knowledge of colloquial and literary Chinese. Seminar topics alternate yearly between traditional narrative and drama, with emphasis on generic, hermeneutical, and historical approaches. Topics in narrative selected from genres from Chou through Ch'ing periods. Topics in drama selected from tsa-chü and ch'uan-ch'i. May be repeated for credit with consent of instructor. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Seminar: Traditional Chinese Narrative and Drama", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 256A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Issues in production and interpretation of literary works, as formulated by Chinese critics from classical age onward. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Chinese Literary Criticism", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 256B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Issues in production and interpretation of literary works, as formulated by Chinese critics from classical age onward. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Chinese Literary Criticism", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 265A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. May be repeated for credit with consent of instructor. In Progress grading (credit to be given only on completion of course 265B).", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Seminar: Chinese Buddhist Texts", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 265B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. May be repeated for credit with consent of instructor. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Seminar: Chinese Buddhist Texts", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 285A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Preparation: reading knowledge of classical Chinese. Selected readings from religious traditions of China, with introduction to different disciplinary approaches, secondary scholarship, and research methodology. Topics rotate among chronological periods and major religious traditions. May be repeated for credit with consent of instructor. In Progress grading (credit to be given only on completion of course 285B).", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Seminar: Readings in Chinese Religions", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 285B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Preparation: reading knowledge of classical Chinese. Selected readings from religious traditions of China, with introduction to different disciplinary approaches, secondary scholarship, and research methodology. Topics rotate among chronological periods and major religious traditions. May be repeated for credit with consent of instructor. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Seminar: Readings in Chinese Religions", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 290A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Requisite: course 186. Discussion and research on major problems about Chinese archaeology and different interpretations to most important archaeological finds, with emphasis on studies of Xia and Shang cultures and Xia and Shang dynasties. May be repeated for credit. In Progress grading (credit to be given only on completion of course 290B).", 
        "prerequisiteDescription": "course 186", 
        "prerequisites": [
            [
                "CHIN 186"
            ]
        ], 
        "title": "Seminar: Selected Topics in Chinese Archaeology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 290B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Requisite: course 186. Discussion and research on major problems about Chinese archaeology and different interpretations to most important archaeological finds, with emphasis on studies of Xia and Shang cultures and Xia and Shang dynasties. May be repeated for credit. Letter grading.", 
        "prerequisiteDescription": "course 186", 
        "prerequisites": [
            [
                "CHIN 186"
            ]
        ], 
        "title": "Seminar: Selected Topics in Chinese Archaeology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 291": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Introduction to major bibliographical and methodological resources in field of Chinese archaeology to provide deeper understanding of formulation of conceptual categories archaeologists of early China used to make sense of past through interpretation of material culture. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Archaeological Process in China", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 295A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Discussion and research on major problems related to Chinese culture, such as beginnings of Chinese civilization and Chinese dynastic history. Other topics include cultural developments of ancient and medieval China. May be repeated for credit. In Progress grading (credit to be given only on completion of course 295B).", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Seminar: Selected Topics in Chinese Cultural History", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 295B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Discussion and research on major problems related to Chinese culture, such as beginnings of Chinese civilization and Chinese dynastic history. Other topics include cultural developments of ancient and medieval China. May be repeated for credit. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Seminar: Selected Topics in Chinese Cultural History", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 297A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Selected topics in premodern Chinese literature, history, or religion, with emphasis on textual readings and independent research. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Seminar: Research Topics in Premodern China", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 297B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Selected topics in modern Chinese and Sinophone culture, with major emphasis on independent research. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Seminar: Research Topics in Modern Chinese and Sinophone Culture", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 2A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, two hours; discussion, three hours. Enforced requisite: course 1A with grade of C or better or Chinese placement test. First-year Chinese. Not open to students who have learned, from whatever source, enough Chinese to qualify for more advanced courses. Continuation of course 1A. P/NP or letter grading.", 
        "prerequisiteDescription": "course 1A with grade of C or better or Chinese placement test", 
        "prerequisites": [], 
        "title": "Elementary Modern Chinese for Advanced Beginners", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 3": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, two hours; discussion, three hours. Enforced requisite: course 2 with grade of C or better or Chinese placement test. First-year Chinese. Not open to students who have learned, from whatever source, enough Chinese to qualify for more advanced courses. Continuation of course 2. P/NP or letter grading.", 
        "prerequisiteDescription": "course 2 with grade of C or better or Chinese placement test", 
        "prerequisites": [], 
        "title": "Elementary Modern Chinese", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 30": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, two hours; discussion, two hours. Recommended preparation: one to two years of college-level Chinese. Exploration of relationship between Chinese language, society, and culture. Discussion of fundamental role that language plays in Chinese social life and cultural practices while simultaneously exploring how social and cultural factors impact ways in which Chinese language is organized. Main focus on language and thought patterns, language and gender, language and politics, language and commerce, language and law, language and arts, and language and globalization. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Chinese Language, Society, and Culture", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 3A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, two hours; discussion, three hours. Enforced requisite: course 2A with grade of C or better or Chinese placement test. First-year Chinese. Not open to students who have learned, from whatever source, enough Chinese to qualify for more advanced courses. Continuation of course 2A. P/NP or letter grading.", 
        "prerequisiteDescription": "course 2A with grade of C or better or Chinese placement test", 
        "prerequisites": [], 
        "title": "Elementary Modern Chinese for Advanced Beginners", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 4": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, two hours. Requisite: course 3 or 8 with grade of C or better or Chinese placement test. Second-year Chinese. Not open to students who have learned, from whatever source, enough Chinese to qualify for more advanced courses. Designed to strengthen communicative skills of listening, speaking, reading, and writing. Grammar reviews, knowledge of idiomatic expressions, and both traditional and simplified characters. P/NP or letter grading.", 
        "prerequisiteDescription": "course 3 or 8 with grade of C or better or Chinese placement test", 
        "prerequisites": [], 
        "title": "Intermediate Modern Chinese", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 40": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Examination of modern Chinese popular culture in China, Taiwan, Hong Kong, and overseas Chinese communities. From fiction to film, music to MTV, and cartoons to karaoke, probing of popular as it has manifested itself in Chinese societies and tracing of its development over last century. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Popular Culture in Modern Chinese Societies", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 4A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, two hours. Requisite: course 3A with grade of C or better or Chinese placement test. Second-year Chinese. Not open to students who have learned, from whatever source, enough Chinese to qualify for more advanced courses. Designed for students who already have certain listening and speaking skills in Mandarin or other Chinese dialects at intermediate levels. Training in all four basic language skills (speaking, listening, reading, and writing). P/NP or letter grading.", 
        "prerequisiteDescription": "course 3A with grade of C or better or Chinese placement test", 
        "prerequisites": [], 
        "title": "Intermediate Modern Chinese for Advanced Students", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 5": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, two hours. Requisite: course 4 with grade of C or better or Chinese placement test. Second-year Chinese. Not open to students who have learned, from whatever source, enough Chinese to qualify for more advanced courses. Continuation of course 4. P/NP or letter grading.", 
        "prerequisiteDescription": "course 4 with grade of C or better or Chinese placement test", 
        "prerequisites": [], 
        "title": "Intermediate Modern Chinese", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 50": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Not open for credit to students with credit for course 50W. Knowledge of Chinese not required. Introduction to most important aspects of Chinese culture. Topics include early Chinese civilization, historical development of Chinese society, issues of ethnicity, Chinese language and philosophy, and early scientific and technological innovation. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Chinese Civilization", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 50W": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Enforced requisite: English Composition 3 or 3H or English as a Second Language 36. Not open for credit to students with credit for course 50. Knowledge of Chinese not required. Introduction to most important aspects of Chinese culture. Topics include early Chinese civilization, historical development of Chinese society, issues of ethnicity, Chinese language and philosophy, and early scientific and technological innovation. Satisfies Writing II requirement. Letter grading.", 
        "prerequisiteDescription": "English Composition 3 or 3H or English as a Second Language 36", 
        "prerequisites": [], 
        "title": "Chinese Civilization", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 5A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, two hours. Requisite: course 4A with grade of C or better or Chinese placement test. Second-year Chinese. Not open to students who have learned, from whatever source, enough Chinese to qualify for more advanced courses. Continuation of course 4A. P/NP or letter grading.", 
        "prerequisiteDescription": "course 4A with grade of C or better or Chinese placement test", 
        "prerequisites": [], 
        "title": "Intermediate Modern Chinese for Advanced Students", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 5C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, four hours. Enforced preparation: Chinese placement test. Designed for students who are Cantonese speakers and familiar with Chinese characters and who need to improve their pronunciation of standard Mandarin dialect. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Mandarin for Cantonese Speakers", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 6": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, two hours. Requisite: course 5 with grade of C or better or Chinese placement test. Second-year Chinese. Not open to students who have learned, from whatever source, enough Chinese to qualify for more advanced courses. Continuation of course 5. P/NP or letter grading.", 
        "prerequisiteDescription": "course 5 with grade of C or better or Chinese placement test", 
        "prerequisites": [], 
        "title": "Intermediate Modern Chinese (Effective Spring 2018 )", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 6A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, two hours. Requisite: course 5A with grade of C or better or Chinese placement test. Second-year Chinese. Not open to students who have learned, from whatever source, enough Chinese to qualify for more advanced courses. Continuation of course 5A. P/NP or letter grading.", 
        "prerequisiteDescription": "course 5A with grade of C or better or Chinese placement test", 
        "prerequisites": [], 
        "title": "Intermediate Modern Chinese for Advanced Students", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 6C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, four hours. Enforced requisite: course 5C or Chinese placement test. Designed for students who are Cantonese speakers and familiar with Chinese characters and who need to improve their pronunciation of standard Mandarin dialect. Completion of course 6C is equivalent to completion of course 6. P/NP or letter grading.", 
        "prerequisiteDescription": "course 5C or Chinese placement test", 
        "prerequisites": [], 
        "title": "Mandarin for Cantonese Speakers", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 70": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Not open for credit to students with credit for course 70W. Prior knowledge of Chinese culture, literature, or language not required. Introduction to pre-20th-century Chinese literary traditions, including selections from poetry, prose, fiction, and drama. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Classics of Chinese Literature", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 70W": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Enforced requisite: English Composition 3 or 3H or English as a Second Language 36. Not open for credit to students with credit for course 70. Prior knowledge of Chinese culture, literature, or language not required. Introduction to pre-20th-century Chinese literary traditions, including selections from poetry, prose, fiction, and drama. Satisfies Writing II requirement. Letter grading.", 
        "prerequisiteDescription": "English Composition 3 or 3H or English as a Second Language 36", 
        "prerequisites": [], 
        "title": "Classics of Chinese Literature", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 8": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, 10 hours; discussion, 10 hours. Not open to students who have learned, from whatever source, enough Chinese to qualify for more advanced courses. Intensive course equivalent to courses 1, 2, and 3. Introduction to fundamentals of standard Chinese, including pronunciation, grammar, and Chinese characters, with emphasis on all four basic language skills -- speaking, listening comprehension, reading, and writing. Offered in summer only. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Elementary Chinese: Intensive", 
        "unit": 15, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 80": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, two hours; discussion, one hour; film viewing, three hours. Knowledge of Chinese not required. Introduction to history and major themes of Chinese cinema. Representative films studied in contexts of culture, society, politics, and economics, with reflections on changing meanings of both Chinese and cinema. May not be repeated for credit. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Chinese Cinema: Pictures, Prisms, Products, Projections", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 89": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 89HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Contracts", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 8A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, 10 hours; discussion, 10 hours. Intensive course equivalent to courses 1A, 2A, and 3A. Designed for students who already have some listening and speaking skills in Mandarin Chinese but do not have any reading and writing skills and for students who speak Chinese dialect other than Mandarin at home and have some knowledge of Chinese characters (i.e., can read some basic Chinese). Coverage of listening, speaking, reading, and writing skills. Offered in summer only. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Elementary Modern Chinese for Advanced Beginners: Intensive", 
        "unit": 15, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 97": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours. Knowledge of Chinese language or culture not required. Variable topics course covering many different aspects of Chinese culture. Consult \"Schedule of Classes\" for topics to be offered in specific term. May be repeated for credit with topic change. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Variable Topics in Chinese Culture", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN 99": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Student Research Program", 
        "unit": "1 to 2", 
        "unitType": "RANGE"
    }, 
    "CHIN C107A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 101B or Chinese placement test. Intended to improve reading and writing skills in specific academic and professional subject areas for students who have studied general Chinese at advanced level, with coverage in Chinese humanities and social sciences, science and technology, medicine, and applied linguistics. Concurrently scheduled with course C207A. P/NP or letter grading.", 
        "prerequisiteDescription": "course 101B or Chinese placement test", 
        "prerequisites": [], 
        "title": "Academic/Professional Chinese", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN C107B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 101B or Chinese placement test. Intended to improve reading and writing skills in specific academic and professional subject areas for students who have studied general Chinese at advanced level, with coverage in Chinese humanities and social sciences, science and technology, medicine, and applied linguistics. Concurrently scheduled with course C207B. P/NP or letter grading.", 
        "prerequisiteDescription": "course 101B or Chinese placement test", 
        "prerequisites": [], 
        "title": "Academic/Professional Chinese", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN C120": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Recommended preparation: one to two years of college-level Chinese. Introduction to Chinese sound system, writing system and its reform, regional differences, major structural features, language in society and in cultural practices. Concurrently scheduled with course C240. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Chinese Linguistics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN C138": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Recommended preparation: course 50. Exploration of travel writing in China, with focus on English translations of works by native writers and by foreign visitors through centuries. Concurrently scheduled with course C238. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Travel Writing in Premodern China", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN C144": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Preparation: bilingual competency in Chinese and English. Workshop on Chinese-English literary translation, designed to hone and improve translation skills. Focus on close readings and analysis of original texts against published English translations and actual translation work. May include interpretation segment, designed to improve interpretation skills. Concurrently scheduled with course C244. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Translation Workshop: Modern Chinese Texts", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN C150A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Knowledge of Chinese not required. Readings in English translation of poetic and critical writings of traditional China, with emphasis on development of subjectivity and modes of address. Concurrently scheduled with course C250A. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Lyrical Traditions", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN C150B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "(Formerly numbered 150B.) Lecture, three hours; discussion, one hour. Knowledge of Chinese not required. Examination of formation and development of Chinese narrative traditions from Tang to mid-Qing periods (7th-18th centuries). Readings from biographical writings, fiction, drama, legal cases, etc., with emphasis on different narrative conventions and their cultural assumptions and intersections. Exploration of important issues in context of imperial China, including order and chaos, self and other, desire and transcendence, gender norms and transgression, violence and justice. May be taken independently for credit. Concurrently scheduled with course C250B. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Chinese Literature in Translation: Traditional Narrative and Fiction", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN C156": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Designed for seniors. Knowledge of Chinese not required. Examination of relationship between culture (art, literature, film) and society in Taiwan. Reading, audio and visual material, discussion, and development of culminating project. May be repeated for credit with topic change. Concurrently scheduled with course C257. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Variable Topics in Culture and Society in Taiwan", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN C175": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Knowledge of Chinese not required. Survey of Chinese thought as represented in texts of Zhou through early Han periods (circa 1000 to 100 B.C.E.), with focus on invention of Confucian tradition (including Five Classics) and on defenses of that tradition against challenges from Mohists, Taoists, and other groups of thinkers. Concurrently scheduled with course C275. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Chinese Thought", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN C207A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 101B or Chinese placement test. Intended to improve reading and writing skills in specific academic and professional subject areas for students who have studied general Chinese at advanced level, with coverage in Chinese humanities and social sciences, science and technology, medicine, and applied linguistics. Concurrently scheduled with course C107A. S/U or letter grading.", 
        "prerequisiteDescription": "course 101B or Chinese placement test", 
        "prerequisites": [], 
        "title": "Academic/Professional Chinese", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN C207B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 101B or Chinese placement test. Intended to improve reading and writing skills in specific academic and professional subject areas for students who have studied general Chinese at advanced level, with coverage in Chinese humanities and social sciences, science and technology, medicine, and applied linguistics. Concurrently scheduled with course C107B. S/U or letter grading.", 
        "prerequisiteDescription": "course 101B or Chinese placement test", 
        "prerequisites": [], 
        "title": "Academic/Professional Chinese", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN C238": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Recommended preparation: course 50. Exploration of travel writing in China, with focus on English translations of works by native writers and by foreign visitors through centuries. Concurrently scheduled with course C138. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Travel Writing in Premodern China", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN C240": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Recommended preparation: one to two years of college-level Chinese. Introduction to Chinese sound system, writing system and its reform, regional differences, major structural features, language in society and in cultural practices. Concurrently scheduled with course C120. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Chinese Linguistics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN C244": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Preparation: bilingual competency in Chinese and English. Workshop on Chinese-English literary translation, designed to hone and improve translation skills. Focus on close readings and analysis of original texts against published English translations and actual translation work. May include interpretation segment, designed to improve interpretation skills. Concurrently scheduled with course C144. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Translation Workshop: Modern Chinese Texts", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN C250A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Readings of poetic and critical writings of traditional China, with emphasis on development of subjectivity and modes of address. Concurrently scheduled with course C150A. Graduate students required to read primary materials in original Chinese. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Lyrical Traditions", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN C250B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Knowledge of Chinese not required. Examination of formation and development of Chinese narrative traditions from Tang to mid-Qing periods (7th-18th centuries). Readings from biographical writings, fiction, drama, legal cases, etc., with emphasis on different narrative conventions and their cultural assumptions and intersections. Exploration of important issues in context of imperial China, including order and chaos, self and other, desire and transcendence, gender norms and transgression, violence and justice. May be taken independently for credit. Concurrently scheduled with course C150B. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Chinese Literature in Translation: Traditional Narrative and Fiction", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN C257": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Designed for graduate students. Knowledge of Chinese not required. Examination of relationship between culture (art, literature, film) and society in Taiwan. Reading, audio and visual material, discussion, and development of culminating project. May be repeated for credit with topic change. Concurrently scheduled with course C156. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Variable Topics in Culture and Society in Taiwan", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN C260": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Knowledge of Chinese not required. Introduction and development of Buddhism in China, interaction between Buddhism and Chinese culture, rise of Chinese schools of Buddhism. Concurrently scheduled with course CM160. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Chinese Buddhism", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN C275": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "Lecture, three hours; discussion, one hour. Knowledge of Chinese not required. Survey of Chinese thought as represented in texts of Zhou through early Han periods (circa 1000 to 100 B.C.E.), with focus on invention of Confucian tradition (including Five Classics) and on defenses of that tradition against challenges from Mohists, Taoists, and other groups of thinkers. Concurrently scheduled with course C175. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Chinese Thought", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN CM160": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "(Same as Religion M161A.) Lecture, three hours; discussion, one hour. Knowledge of Chinese not required. Introduction and development of Buddhism in China, interaction between Buddhism and Chinese culture, rise of Chinese schools of Buddhism. Concurrently scheduled with course C260. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Chinese Buddhism", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN M153": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "(Same as Asian American Studies M130B and Comparative Literature M171.) Lecture, three hours; discussion, one hour. Knowledge of Chinese not required. In-depth look at Chinese immigrant experience by reading literature and watching films. Theories of diaspora, gender, and race to inform thinking and discussion of relevant issues. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Chinese Immigrant Literature and Film", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN M183": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "(Same as Anthropology M116R.) Lecture, three hours; discussion, one hour (when scheduled). Declassified space images from Cold War era and open remote sensing data of 21st century provide new opportunities for studying landscape transformation in historical China. Combining lectures, library research, and hands-on analysis of archaeological sites on satellite images, investigation of changing historical and archaeological landscape in China during last 5,000 years. Social processes at various scales, from emergence of early cities to rise of metropolitan centers and formation of imperial landscapes. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Archaeological Landscapes of China", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN M201": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "(Same as History M281.) Seminar, three hours. Preparation: two years of classical Chinese or working knowledge of classical Chinese. Readings in historiography and selected genres of historical documents. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "China -- Seminar: Classical Historiography and Readings in Classical Studies", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN M202": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "(Same as History M280.) Seminar, two hours. Introduction to study of China as practiced in humanities and social sciences disciplines. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "China Studies: Discipline, Methods, Debates", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN M60": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "(Same as Religion M60B.) Lecture, three hours; discussion, one hour. Not open for credit to students with credit for course M60W. Knowledge of Chinese not required. General survey of religious life in China, with emphasis on everyday religious practice over doctrine, and themes common to Buddhism, Daoism, and Confucianism. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Chinese Religions", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "CHIN M60W": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CHIN", 
        "departmentFullName": "Chinese", 
        "description": "(Same as Religion M61W.) Lecture, three hours; discussion, one hour. Enforced requisite: English Composition 3 or 3H or English as a Second Language 36. Not open for credit to students with credit for course M60. Knowledge of Chinese not required. General survey of religious life in China, with emphasis on everyday religious practice over doctrine, and themes common to Buddhism, Daoism, and Confucianism. Satisfies Writing II requirement. Letter grading.", 
        "prerequisiteDescription": "English Composition 3 or 3H or English as a Second Language 36", 
        "prerequisites": [], 
        "title": "Introduction to Chinese Religions", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }
}