{
    "CIVIC 10": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Seminar, two hours. Limited to students participating in preapproved UCLA civic engagement programs. Introduction to history, research, and philosophy of general University/community partnerships, as well as specific opportunities for active engagement by undergraduate students at UCLA. Offered in summer only. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Engaged Scholarship", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 100SL": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Seminar, three hours. Introduction to civic engagement research and practice open to students who have been accepted in Civic Engagement minor, as well as those from all majors who are interested in theories and concepts of civic engagement within undergraduate education. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Perspectives on Civic Engagement", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 102": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Seminar, two hours. Limited to students who have participated in USAC Community Service Commission Alternative Spring Break immediately prior to Spring Quarter. Discussion of role of higher education initiatives in civic identity formation, with specific attention to reflection on Alternative Spring Break experiences. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Reflections on Alternative Spring Break", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 105SL": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Seminar, three hours; fieldwork, 10 hours. Limited to juniors/seniors. Service learning course for undergraduate students and community partners through which students learn theory and practice of program evaluation. Evaluation of nonprofit organizations in Los Angeles by research teams. Offered in summer only. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Client-Based Program Evaluation and Research", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 108SL": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Lecture, three hours; fieldwork, eight hours. Limited to students who are participating members of Jumpstart AmeriCorps literacy program. Service learning course on early childhood development and civic engagement. Overview of child development theory as well as examination of policies and systems that impact practice of preschool education. Discussion about history and future of civic engagement movement designed to engage diverse groups of committed stakeholders in reaching common goal. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Early Childhood Education: Civic Engagement Perspectives", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 133SL": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Seminar, three hours; fieldwork, two hours. Service learning course that examines variable topics related to theory and practice of community-based research. Service learning component includes meaningful work with community partners selected in advance by instructor and Center for Community Learning. May be repeated for credit with topic or instructor change. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Topics in Community-Based Research: Theory and Practice", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 145": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Lecture, four hours. Broad historic trend of systems in conflict since beginnings of colonialism, including capitalism, urbanism, liberalism, and neoliberalism. Examination of modalities and theories of conflict and transformation, with emphasis on three primary forms of societal conflict: social movements, war, and terrorism. Study of resource scarcity through two specific dimensions: how it is leveraged to meet political ends, and how it can be harnessed for conflict intervention, resolution, transformation, and prevention. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Conflict, Power, Inequality, and Change", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 150": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Seminar, three hours. Limited to students in UCLA Summer Social Innovation Research Program. Study of social innovation as theory of civic engagement, with particular emphasis on how social innovators have transformed way we address entrenched social issues. Study of elements of existing social innovation models and strategies for employing methods of social change on campus and in communities. Offered in summer only. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Social Innovation Theory and Application", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 152": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Lecture, four hours. Exploration of theories driving social change and how visions and agendas get organized toward common efforts. Analysis of organizing frameworks through specific movements for social, economic, and political change. Introduction to praxis, defined by Paulo Freire in Pedagogy of the Oppressed as \"reflection and action directed at the structures to be transformed.\" P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Exploring Social Change: Critical Analysis through Lens of Community Organizing and Social Movements", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 163SL": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Seminar, three hours; fieldwork, three hours. Limited to juniors/seniors. Service learning course that examines variable topics related to University/community partnerships and role of civic education in higher education. May be repeated for credit with topic or instructor change. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Civic Engagement and Public Use of Knowledge: Special Topics", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 18": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Lecture, two hours; fieldwork, one hour. Introduction to leadership development and civic engagement through community service. Based on nonhierarchical mode of leadership developed by UCLA Graduate School of Education and Information Studies. Topics include diversity issues, organizational skills and team-building development, and personal growth and community service goals. Participation in first-week orientation session required. Consult \"Schedule of Classes\" for topics to be offered in specific term. May not be repeated for credit. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Bruin Leaders: Model for Social Change", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 180": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Seminar, three hours. Limited to UCLA students who are members of JusticeCorps program through AmeriCorps. JusticeCorps was established as innovative approach to solving one pressing issue faced by courts around country today: providing equal access to justice. Examination of promise of justice system in America to provide meaningful access to courts for all who seek it. What premises underlie structure of U.S. legal system? Exploration of sociopolitical context for current legal system, including origins and current status of legal services and self-help movements, including role of JusticeCorps. Were these strategies designed to make promise of equal justice a reality or have they inadvertently, or intentionally, resulted in two-tiered legal system -- one for those with means and another for those without? P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Access to Justice: Hope and Reality", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 188SA": {
        "corequisiteDescription": "HNRS 101E", 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Individual Studies for USIE Facilitators", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 188SB": {
        "corequisiteDescription": "HNRS 101E", 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.", 
        "prerequisiteDescription": "course 188SA", 
        "prerequisites": [
            [
                "CIVIC 188SA"
            ]
        ], 
        "title": "Individual Studies for USIE Facilitators", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 188SC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.", 
        "prerequisiteDescription": "course 188SB", 
        "prerequisites": [
            [
                "CIVIC 188SB"
            ]
        ], 
        "title": "Individual Studies for USIE Facilitators", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 189": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 189HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Contracts", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 19": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Fiat Lux Freshman Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 194": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Seminar, two hours. Requisite: course 195CE. Required of students pursuing Civic Engagement minor. Integration of off-campus work with academic theories and concepts within field of civic engagement. Students report on their internship experiences and analyze relationship between their internship and issues of policy, ethics, systemic responses to community needs, or personal and intellectual transformations. Students identify one faculty mentor and develop proposal for required capstone research project. Letter grading.", 
        "prerequisiteDescription": "course 195CE", 
        "prerequisites": [
            [
                "CIVIC 195CE"
            ]
        ], 
        "title": "Capstone Research Seminar", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 194A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Seminar, three hours. Limited to students in Astin civic engagement spring training program. Integration of off-campus work with academic theories and concepts within field of civic engagement. Students report on their internship experiences and analyze relationship between their internship and issues of policy, ethics, systemic responses to community needs, or personal and intellectual transformations. Students identify one faculty mentor and develop proposal for civic engagement research project. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Astin Civic Engagement Research Seminar", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 195": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Tutorial, one hour; fieldwork, eight hours. Limited to juniors/seniors in Civic Engagement minor. Internship in supervised setting in corporate, governmental, or nonprofit setting, using knowledge base of civic engagement. Students submit weekly writing assignments and final paper that examine civic issues related to meaningful work at internship site. Students expected to learn ways in which individuals and groups can organize to solve problems, analyze issues, or bring about change in democratic society. Must be repeated for three consecutive terms to fulfill minor requirements. Individual contract with supervising faculty member required. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Community or Corporate Internships in Civic Engagement", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 195CE": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Tutorial, to be arranged; fieldwork, eight to 10 hours. Limited to juniors/seniors. Internship in corporate, governmental, or nonprofit setting coordinated through Center for Community Learning. Students complete weekly written assignments, attend biweekly meetings with graduate student coordinator, and write final research paper. Faculty sponsor and graduate student coordinator construct series of reading assignments that examine issues related to internship site. May be repeated for credit with consent of Center for Community Learning. Individual contract with supervising faculty member required. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Community and Corporate Internships in Civic Engagement", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 198": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Tutorial, one hour. Required capstone course to Civic Engagement minor for students pursuing College Honors. Development and completion of honors thesis or comprehensive research project under direct supervision of faculty member. Individual contract required. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Research in Civic Engagement", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 199": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Tutorial, to be arranged. Required capstone course to Civic Engagement minor. Supervised individual research or investigation under guidance of faculty mentor. Culminating paper or project required. May be repeated once for credit. Individual contract required. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Directed Research or Senior Project in Civic Engagement", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 375": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Seminar, to be arranged. Preparation: apprentice personnel employment as teaching assistant, associate, or fellow. Teaching apprenticeship under active guidance and supervision of regular faculty member responsible for curriculum and instruction at UCLA. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Teaching Apprentice Practicum", 
        "unit": "1 to 4", 
        "unitType": "RANGE"
    }, 
    "CIVIC 50SL": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Lecture, two hours; discussion, two hours. Service learning course with focus on diverse communities of Los Angeles. Analysis of general shared history of Los Angeles. Comparing or contrasting of experiences of several different racial/ethnic groups. Engagement in meaningful work off campus to reflect on assets, injustices, and inequities that have shaped experiences of native or immigrant communities. Analysis of Los Angeles in which residents coexist and interact while managing tensions and social justice issues inherent in minority/majority city. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Engaging Los Angeles", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 89": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 89HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Contracts", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 95A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Tutorial, one hour; fieldwork, four hours. Course 95A is not requisite to 95B. Introduction to community-based work for students in specialized UCLA scholarship programs. Platform for preplanned, organized, structured, and supervised off-campus experiences with academic context. Acceptable placements include corporate, nonprofit, and governmental organizations that meet criteria for undergraduate internships as established by Center for Community Learning. Individual contract with supervising faculty member required. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Community-Based Internships", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 95B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Tutorial, one hour; fieldwork, 10 hours. Course 95A is not requisite to 95B. Introduction to community-based work for students in specialized UCLA scholarship programs. Platform for preplanned, organized, structured, and supervised off-campus experiences with academic context. Acceptable placements include corporate, nonprofit, and governmental organizations that meet criteria for undergraduate internships as established by Center for Community Learning. Individual contract with supervising faculty member required. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Community-Based Internships", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 95CE": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Tutorial, one hour; fieldwork, four hours. Introduction to community-based work for third-term freshman/sophomore students who have not completed 90 units. Platform for preplanned, organized, structured, and supervised off-campus experiences with academic context. Acceptable placements include corporate, nonprofit, and governmental organizations that meet criteria for undergraduate internships as established by Center for Community Learning. May be repeated once for credit. Individual contract with supervising faculty member required. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Community-Based Internships", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC 99": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Student Research Program", 
        "unit": "1 to 2", 
        "unitType": "RANGE"
    }, 
    "CIVIC M110SL": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "(Same as English M115SL.) Lecture, four hours; discussion, one hour (when scheduled); fieldwork, two hours. Enforced requisite: English Composition 3. Service learning course that examines history and development of one or more genres of popular literature, with attention to contemporary communities of readers and writers and formation of civil society. Topics vary and may include children's literature and childhood literacy, mass market fiction and book club culture, or science fiction and science policy. Service learning component includes meaningful work with local nonprofit organizations selected in advance by instructor. May be repeated for credit with topic change. P/NP or letter grading.", 
        "prerequisiteDescription": "English Composition 3", 
        "prerequisites": [], 
        "title": "Community-Based Studies of Popular Literature", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC M115": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "(Same as Political Science M115C.) Lecture, three or four hours; discussion, one hour (when scheduled). Recommended requisite: Political Science 10. Designed for juniors/seniors. Study of ways in which political thinkers have conceived of ideas of citizenship and public service, how these ideas have changed over time, and frameworks for thinking about citizenship in era of markets and globalization. P/NP or letter grading.", 
        "prerequisiteDescription": "Political Science 10", 
        "prerequisites": [], 
        "title": "Citizenship and Public Service", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC M122": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "(Formerly numbered 122.) (Same as Honors Collegium M123.) Seminar, three hours. Limited to juniors/seniors; application required. Study of history, philosophy, and practice of philanthropy. Practical experience in setting priorities and making philanthropic investments in Los Angeles-based nonprofit organizations. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Philanthropy as Civic Engagement", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC M134SL": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "(Same as Chicana and Chicano Studies M134SL and Labor and Workplace Studies M134SL.) Lecture, two hours; discussion, two hours; field placement, two hours. Survey and exploration of immigrant landscape in Los Angeles--truly global city acting in part to buffer, settle, and incorporate immigrants in daily life. Focus on civil society to explore multiple forms of interventions and impacts that take place in multiple communities across Los Angeles basin. Service learning partnerships focus on organizations addressing immigration concerns. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Engaging Immigrants and Their Families", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC M170SL": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "(Formerly numbered 170SL.) (Same as Food Studies M170SL.) Seminar, three hours; fieldwork, two hours. Interdisciplinary service learning course that provides general understanding of access and equity issues related to food chain in Los Angeles. Exploration of social justice issues faced by residents of lower-income communities. Reading of research from multiple disciplines, including but not limited to public health, environmental justice, and public policy. Service-learning component includes meaningful work with off-campus community partners selected in advance by instructor and Center for Community Learning. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Food Studies and Food Justice in Los Angeles", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CIVIC M175SL": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CIVIC", 
        "departmentFullName": "Civic Engagement", 
        "description": "(Formerly numbered 175SL.) (Same as Psychology M176SL.) Seminar, two hours; fieldwork, 10 hours. Examination of how addressing social determinants in racial/ethnic minority communities can reduce or eliminate physical and mental health disparities. Currently in racial and ethnic minority communities, health status of individuals can be function of built environment, exposure to pollutants and toxins, scarcity of supermarkets or stores with fresh produce and nutritional food, noise levels, and variety of other stressors and unhealthy conditions. Health interventions are often focused on individual-level change or increases in access to healthcare with little in way of changing risk environments. Designed to identify and provide opportunities to understand how to address social determinants related to negative health outcomes in racial/ethnic minority neighborhoods and communities and to experience how to use social determinants literature in service of collaborative activities with community organizations. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Addressing Social Determinants in Racial/Ethnic Minority Communities to Reduce and Prevent Health Disparities", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }
}