{
    "COM HLT 100": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, four hours. Limited to students in Public Health minor and graduate students. Introductory course to provide non-Community Health Sciences M.P.H. students and qualified undergraduate students with broad and comprehensive overview of concepts, empirical research, and public health practice in community health sciences, with emphasis on social context and determinants of population health and principles of planning interventions to protect and improve public health. Ways to define and measure health and illness, social construction of illness, social and behavioral determinants of health, and health disparities, including socioeconomic status, race/ethnicity, gender, and age. Social and behavioral theories of health-related behavior change, health promotion strategies and methods, and public policy. Case studies of evidence-based health promotion programs provided. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Community Health Sciences", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 130": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, three hours; laboratory, one hour. Preparation: one biology course, one chemistry course. Basic and clinical nutrition theory and practice for students in health sciences curricula. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Nutrition and Health", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 131": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, three hours; laboratory, 90 minutes. History and recent revival of urban agriculture (gardening) in Los Angeles area. Exploration of how urban gardening is response to crises such as U.S. obesity epidemic and resulting health problems. Critiques of industrial agriculture in California and elsewhere in U.S. Exploration of how urban agriculture springs from healthy food/active living and consumer movements that advocate access to locally grown, in-season, affordable food. Biweekly hands-on gardening laboratory in Sunset Canyon Recreation Center Organic Garden. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Healthy Food Access in Los Angeles: History and Practice of Urban Agriculture", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 132": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, four hours. Introduction to health, disease, and health services in Latin America, with emphasis on epidemiology, health administration, medical anthropology, and nutrition. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Health, Disease, and Health Services in Latin America", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 160": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, four hours. Recommended requisite: course 60. Discussion on issues of difference, conflict, and community to facilitate understanding between social/cultural groups. Peer facilitator training course to develop understanding of theoretical and research foundations of intergroup dialogue, peer-facilitated discussions involving relationship building (and coalition building) through thoughtful engagement around different social identity issues. Study of variety of techniques, tools, and strategies to support students in their capacity to implement sustained dialogues with students from other social identity groups. Letter grading.", 
        "prerequisiteDescription": "course 60", 
        "prerequisites": [
            [
                "COM HLT 60"
            ]
        ], 
        "title": "Intergroup Dialogue: Theory and Practice of Peer Facilitation", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 161": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Seminar, four hours. Enforced requisite: course 160. Application and further development of content and skills learned in course 160. Co-facilitation of weekly dialogues with students on specific identity theme and further development of knowledge and techniques in areas of group dynamics, conflict intervention, communication and community, and mental health effects of structural inequality as they relate to discussions of social justice and multicultural issues. Readings in these areas and discussions of ongoing dialogue dynamics. May be repeated once for credit. Letter grading.", 
        "prerequisiteDescription": "course 160", 
        "prerequisites": [
            [
                "COM HLT 160"
            ]
        ], 
        "title": "Intergroup Dialogue: Training Practicum", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 179": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Seminar, four hours. Multidisciplinary exploration of student development in undergraduate experience, with focus on processes of identity formation and emotional and social development. Emphasis on variability associated with gender, race, ethnicity, culture, and sexual orientation. Testing of real-life relevance of theory and research. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Life Skills for College Students", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 180": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, two hours; discussion, one hour; fieldwork, four hours. Requisite: Molecular, Cell, and Developmental Biology 50. Designed for juniors/seniors. Opportunity for students to become involved in cancer control through classroom discussion, lectures, service in field, and guided research. Biology of cancer, its prevention, early detection, treatment, and rehabilitation. Letter grading.", 
        "prerequisiteDescription": "Molecular, Cell, and Developmental Biology 50", 
        "prerequisites": [], 
        "title": "Field Studies in Cancer Control", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 181": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, two hours; discussion, two hours. Limited to juniors/seniors. Theory, training, and experience in health/wellness promotion and health/wellness education in selected campus communities. Participation in supervised small-group program planning project. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Campus/Community Health and Wellness Promotion: From Theory to Practice", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 187A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, three hours; committee meetings/community service, two to six hours. Course 187A is requisite to 187B. Designed for juniors/seniors. Health and social needs/services from primarily public health perspective, drawing on related academic/professional disciplines. Community-based service learning strategy used to enhance knowledge of concepts covered. As part of service portion, students trained as caseworkers and committee members. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Interventions for At-Risk Populations", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 187B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, three hours; committee meetings/community service, two to six hours. Requisite: course 187A. Designed for juniors/seniors. Health and social needs/services from primarily public health perspective, drawing on related academic/professional disciplines. Community-based service learning strategy used to enhance knowledge of concepts covered. As part of service portion, students trained as caseworkers and committee members. Letter grading.", 
        "prerequisiteDescription": "course 187A", 
        "prerequisites": [
            [
                "COM HLT 187A"
            ]
        ], 
        "title": "Introduction to Interventions for At-Risk Populations", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 188A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, three hours. Examination of current topics or particular subfields or experimental or temporary courses in community health sciences. Specific topic areas vary with instructor. May be repeated for credit with topic change. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Courses in Community Health Sciences", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 188B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, two hours. Examination of current topics or particular subfields or experimental or temporary courses in community health sciences. Specific topic areas vary with instructor. May be repeated for credit with topic change. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Courses in Community Health Sciences", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 189": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 189HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Tutorial, three hours. Limited to students in College Honors and departmental honors programs. Designed as adjunct to upper division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Contracts", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 19": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Fiat Lux Freshman Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 195": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Tutorial, six hours. Limited to juniors/seniors. Internship in supervised setting in community agency or business. Further supervision provided by public health organization for which students do internship. Students meet on regular basis with instructor and provide periodic reports of their experience. May be repeated for credit. Individual contract with supervising placement sponsor required. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Community or Corporate Internships in Community Health Sciences", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 197": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Tutorial, four hours. Limited to juniors/seniors. Individual intensive study, with scheduled meetings to be arranged between faculty member and student. Assigned reading and tangible evidence of mastery of subject matter required. May be repeated for credit. Individual contract required. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Individual Studies in Community Health Sciences", 
        "unit": "2 to 4", 
        "unitType": "RANGE"
    }, 
    "COM HLT 200": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, two hours; discussion, two hours. Overview of health profile of world in 20th century. Global health problems and methods by which they have been dealt in context of Alma Ata goal of health for all by year 2000. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Global Health Problems", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 205": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, two hours; discussion, one hour. Limited to graduate students. Overview of key topics in public health for documented and undocumented immigrants and refugees in U.S. Demographics, health status, behavioral risk factors, and social determinants, health and human rights, and access to healthcare and prevention services. Analysis of public policy across topics. Builds skills necessary to develop integrated approach to health of immigrant populations. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Immigrant Health", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 209": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, three hours. Enforced requisite: course M208. Population models and their dynamics in population processes. How demographic models are used in estimation of population size, its age structure, and dynamics associated with these processes. Advancements in computer science used to provide students with understanding of simulation of demographic processes to gauge conclusions from demographic models. Emphasis on estimation of demographic models in human population while making clear broader relevance of demographic analysis to study of any population or system, including health and social systems. Letter grading.", 
        "prerequisiteDescription": "course M208", 
        "prerequisites": [
            [
                "COM HLT M208"
            ]
        ], 
        "title": "Demographic Techniques II: Modeling Population Processes and Dynamics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 210": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, three hours; discussion, one hour. Preparation: one social sciences course. Basic concepts, relationships, and policy issues in field of community health, variability in definitions of health and illness, correlates of health and illness behavior, impact of social and community structure on health status, major contemporary approaches to health promotion and health education at community level. Use of comparative international perspective. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Community Health Sciences", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 211A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, three hours; discussion, one hour; outside assignments, eight hours. Requisite: course 210. Course 211A is requisite to 211B. Development, planning, and administration of public health programs in community settings. Introduction to range of research methods and techniques used in designing and conducting health research, with particular emphasis on evaluation of community-based public health programs. Course organized into three modules. Letter grading.", 
        "prerequisiteDescription": "course 210", 
        "prerequisites": [
            [
                "COM HLT 210"
            ]
        ], 
        "title": "Program Planning, Research, and Evaluation in Community Health Sciences", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 211B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, three hours; discussion, one hour; outside assignments, eight hours. Requisites: courses 210, 211A, and Biostatistics 100A or Epidemiology 100. Development, planning, and administration of public health programs in community settings. Introduction to range of research methods and techniques used in designing and conducting health research, with particular emphasis on evaluation of community-based public health programs. Course organized into three modules. Letter grading.", 
        "prerequisiteDescription": "courses 210, 211A, and BIOSTAT 100A or Epidemiology 100", 
        "prerequisites": [], 
        "title": "Program Planning, Research, and Evaluation in Community Health Sciences", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 212": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, four hours; laboratory, two hours; outside assignments, eight hours. Requisites: courses 211A, 211B, Biostatistics 100B, 406. Problems of health survey design and data collection; measurement issues in data analysis and interpretation; use of computer for analysis of large-scale survey data using various statistical techniques. Letter grading.", 
        "prerequisiteDescription": "courses 211A, 211B, BIOSTAT 100B, 406", 
        "prerequisites": [], 
        "title": "Advanced Social Research Methods in Health", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 213": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, three hours; discussion, two hours. Requisite: course 210. Application of conceptual, theoretical, and evaluation skills to community-based health education risk-reduction programs. Computer applications, data management, and research methodologies taught through microcomputer and mainframe computer management and analysis of program databases. Letter grading.", 
        "prerequisiteDescription": "course 210", 
        "prerequisites": [
            [
                "COM HLT 210"
            ]
        ], 
        "title": "Research in Community and Patient Health Education", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 214": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Discussion, three hours; reading and research paper, one hour. Requisite: course 212. Advanced seminar that explores problems of planning and implementing evaluation research in context of local demonstration projects. Letter grading.", 
        "prerequisiteDescription": "course 212", 
        "prerequisites": [
            [
                "COM HLT 212"
            ]
        ], 
        "title": "Issues in Program Evaluation", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 219": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Seminar, three hours. Enforced requisites: Biostatistics 100A, 100B, 406. Translation of theory into data analytic plan, its application to real data, and interpretation of results obtained through multivariate analysis. Analysis of quantitative data using range of multivariate techniques, such as linear multiple regression and logistic regression. Analysis of theoretical problem using student quantitative data or public use data. Letter grading.", 
        "prerequisiteDescription": "BIOSTAT 100A, 100B, 406", 
        "prerequisites": [], 
        "title": "Theory-Based Data Analysis", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 220": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Seminar, two hours; discussion, one hour. Requisite: Biostatistics 100B. Integration of social epidemiologic methods and critical approaches to study of racial stratification and public health, with focus on (1) conceptualizing racism-related factors as social determinants of health, (2) building methodological competence for conducting research on racism as social determinant of health, and (3) developing critical self-consciousness to better understand how persons' racial- or racism-related perspectives and experiences might inform their research. Letter grading.", 
        "prerequisiteDescription": "BIOSTAT 100B", 
        "prerequisites": [], 
        "title": "Racism and Public Health: Social Epidemiologic Approaches", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 224": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, three hours; discussion, one hour. Preparation: one basic nutrition course. Health promotion strategies aimed at reducing chronic disease risk through lifestyle changes have not been particularly successful in addressing needs of socioeconomically disadvantaged groups. Overview of literature supporting relationship between socioeconomic disadvantage and food-related health conditions such as obesity, diabetes, and osteoporosis. Critical examination of plausible pathways from perspectives of multidisciplines (economics, nutrition, sociology, and more), with focus on linkages between social and physical environment (including built environment) and food equity/access; discussion of how food may be catalyst for improving social capital and health. Discussion of examples of local and international efforts to improve access to healthy foods and/or limit access to unhealthy foods. Exploration of methods for assessing social capital and food-related aspects of neighborhood environments. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Social Determinants of Nutrition and Health", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 225": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Seminar, four hours. Requisites: course 219, two graduate biostatistics courses, one graduate epidemiology course. Development of skills for advanced doctoral students in producing peer-review-quality research papers, with focus on theoretically informed empirical research papers. Examination of other types of manuscripts (e.g., reviews) included. Letter grading.", 
        "prerequisiteDescription": "course 219, two graduate biostatistics courses, one graduate epidemiology course", 
        "prerequisites": [], 
        "title": "Writing for Publication in Public Health", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 226": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, four hours. Limited to graduate students. Interdisciplinary perspective critically examining research on women's health. Overview of scientific inquiry and methods; gender roles; status attainment and medical sociology. Review of current data on women's health. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Women's Health and Well-Being", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 229": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, four hours. How policies relate to violence and development of skills to transmit this knowledge. Examination of wide range of policy topics and how each might be associated with reduction/increase in violence/violent injury. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Policy and Public Health Approaches to Violence Prevention", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 230": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, three hours; community, three to four hours. Examination of rape, incest, and spouse and elder abuse. Presentation of definitions, causes, outcomes of research on family and sexual violence, as well as response of social service, medical, and criminal justice systems. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Family and Sexual Violence", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 231": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, four hours. Nutrition of mothers, infants, and children in countries at various levels of socioeconomic development; measures for prevention and treatment of protein/calorie malnutrition; relationship between nutrition and mental development; impact of ecological, socioeconomic, and cultural factors on nutrition, nutrition education, and service. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Maternal and Child Nutrition", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 233": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, three hours. Designed for graduate students. Public health aspects of hunger and food insecurity in historical and international perspectives, including measurement and identification of vulnerability, prevention, and options for relieving acute food shortage. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Hunger and Food Insecurity as Public Health Issues", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 235": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Seminar, three hours. Preparation: at least one biostatistics or epidemiology course. Limited to graduate students. Examination of how community stressors and neighborhood resources may contribute to health disparities. Discussion of multiple factors that contribute to environmental injustice and their potential solutions. Do health disparities arise because minorities and low-income populations live in harmful environments? Is relationship between environment and health disparities merely one of potential exposure to chemical/physical hazards, or are there psychosocial mechanisms at community level that act above or beyond effects of physical environment? Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Influence of Social and Physical Environment on Racial Health Disparities", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 238": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Seminar, three hours. Adolescent health and interventions, with focus on sex, alcohol, and drug use. Focus on adolescent identity development, adolescent sexuality, discussion of gay, lesbian, bisexual, transgender, and queer issues, components of sexual risk-taking behavior, and alcohol and drug use (e.g., peer influence, changes in brain activity) and interventions that have been developed to address these behaviors. Building of skills to work with adolescent populations and in community-based settings. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Evolving Paradigms of Prevention: Interventions in Adolescence", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 240": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, three hours. Recommended requisites: course 100, Epidemiology 100. Limited to graduate students. Examination of global issues of child and reproductive health in relation to environmental factors in interplay with socioeconomic and biological factors. Environmental influences are responsible for one quarter of total burden of disease worldwide, and for more than one third of burden among children -- most of them living in resource-poor countries and communities. Discussion of impacts of qualitatively different, and potentially modifiable, factors such as access to safe water or urbanization, as well as environmental contribution to high-burden outcomes in childhood and reproduction. Focus on lower income settings and discussion of relevant population-based approaches to assessment and intervention. Letter grading.", 
        "prerequisiteDescription": "course 100, Epidemiology 100", 
        "prerequisites": [], 
        "title": "Child and Reproductive Health in Communities: Global Environmental Perspective", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 246": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, two hours; discussion, one hour. Rapidly changing roles of women throughout world are having important effects on women's own health and that of their families. Analysis of multidisciplinary research from both developing and industrialized countries to provide basis for in-depth discussion of programmatic and policy implications. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Women's Roles and Family Health", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 247": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, four hours. Examination of international population change, population-related policies, and public health implications of demographic processes. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Population Change and Public Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 254": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, two hours. Recommended requisites: courses 211A, 211B, 295, Epidemiology 100, one survey methods course. Previous international experience strongly encouraged. Overview of intentional disasters, with focus on technically underdeveloped areas and consequent population migration. Principal focus on health consequences of these events and strategies to address health issues. Letter grading.", 
        "prerequisiteDescription": "courses 211A, 211B, 295, Epidemiology 100, one survey methods course", 
        "prerequisites": [], 
        "title": "Intentional Disasters: War and Refugees", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 257": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, four hours; outside study, eight hours. Requisites: courses 211A, 211B, 295. Health education and emergency management principles combined to design, plan, implement, and evaluate community disaster preparedness programs, including needs assessment, identification of target population, objective writing, program planning, and process, outcome, and impact evaluation. Letter grading.", 
        "prerequisiteDescription": "courses 211A, 211B, 295", 
        "prerequisites": [], 
        "title": "Program Planning in Community Disaster Preparedness", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 258": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, four hours. Recommended requisite: course 295. Designed for graduate students. Broad overview of how different agencies involved in disaster responses work together to handle impact of mass population emergencies. Identification of role of local, state, and federal governments, nonprofit and private sector organizations, media, and healthcare facilities in disaster situations. Students meet with representatives of different agencies involved in disaster responses and visit one of area's state-of-art emergency management operations facilities. Letter grading.", 
        "prerequisiteDescription": "course 295", 
        "prerequisites": [
            [
                "COM HLT 295"
            ]
        ], 
        "title": "Cooperative Interagency Management in Disasters", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 270A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, four hours. Enforced requisite: course 210. Course 270A is enforced requisite to 270B. Limited to departmental doctoral students. In-depth analysis of theories, methods, and research on which community health sciences are based. Letter grading.", 
        "prerequisiteDescription": "course 210", 
        "prerequisites": [
            [
                "COM HLT 210"
            ]
        ], 
        "title": "Foundations of Community Health Sciences", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 270B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, four hours. Enforced requisites: courses 210, 270A. Limited to departmental doctoral students. In-depth analysis of theories, methods, and research on which community health sciences are based. Letter grading.", 
        "prerequisiteDescription": "courses 210, 270A", 
        "prerequisites": [], 
        "title": "Foundations of Community Health Sciences", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 271": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, four hours. Requisite: course 210. Unified behavioral science approach to natural determinants of change, as foundation for planned change in health-related behavior at community, group, and individual levels. Letter grading.", 
        "prerequisiteDescription": "course 210", 
        "prerequisites": [
            [
                "COM HLT 210"
            ]
        ], 
        "title": "Health-Related Behavior Change", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 276": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, three hours. Requisites: course 100 or 210, Health Policy 100. Analysis of use and acceptance of complementary and alternative medicine (CAM) by clients and providers. Core beliefs of CAM, relationship of CAM and spirituality, licensure and certification of CAM providers, relationship of CAM and conventional medicine, impact of CAM on client identity. Letter grading.", 
        "prerequisiteDescription": "course 100 or 210, Health Policy 100", 
        "prerequisites": [], 
        "title": "Complementary and Alternative Medicine", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 277": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, two hours; discussion, two hours. Requisite: course 210. Before planning educational components of health program, one must assess behaviors and factors influencing health problem. Conceptual, theoretical, and evaluative skills developed and applied in constructing community-based educational program. Letter grading.", 
        "prerequisiteDescription": "course 210", 
        "prerequisites": [
            [
                "COM HLT 210"
            ]
        ], 
        "title": "Advanced Community Health Education", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 281A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Formerly numbered 281.) Seminar, 90 minutes; discussion, 90 minutes. Enforced requisite: course 210. Current problems and findings in health promotion and education (e.g., nutrition, family health, AIDS/HIV, minority health); learning from presentations and critical discussions of master's project reports completed under faculty supervision. Letter grading.", 
        "prerequisiteDescription": "course 210", 
        "prerequisites": [
            [
                "COM HLT 210"
            ]
        ], 
        "title": "Capstone Seminar: Health Promotion and Education", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 281B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Seminar, one hour; discussion, one hour. Current problems and findings in health promotion and education (e.g., nutrition, family health, AIDS/HIV, minority health); learning from presentations and critical discussions of master's project reports completed under faculty supervision. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Capstone Seminar: Health Promotion and Education", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 282": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, three hours; fieldwork, one hour. Requisite: course 210. Planning, creating, implementation, and evaluation of comprehensive health communication campaigns, including use of social marketing practices and strategies of audience research, marketing psychology, creative message development, branding, comprehensive media use for dissemination, transmedia. Competencies: conducting focus group interviews, creating and evaluating effective health campaigns, critical assessment of existing campaigns. Letter grading.", 
        "prerequisiteDescription": "course 210", 
        "prerequisites": [
            [
                "COM HLT 210"
            ]
        ], 
        "title": "Social Marketing for Health Promotion and Communication", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 283": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Seminar, three hours. Requisite: course 210. Graduate seminar intended to explore sociocultural determinants of health-related behaviors among aged. Letter grading.", 
        "prerequisiteDescription": "course 210", 
        "prerequisites": [
            [
                "COM HLT 210"
            ]
        ], 
        "title": "Evidence-Based Health Promotion Programs for Older Adults", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 284": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Discussion, three hours. Designed for graduate students. Examination of how society shapes mental health of its members and lives of those who have been identified as mentally ill. Group differences (e.g., gender, ethnicity) in disorder and how it is socially constructed. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sociocultural Aspects of Mental Health", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 286": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Seminar, two hours. Designed for departmental doctoral students who must enroll every term until they are advanced to candidacy. Interactive seminar with focus on research process and social mechanisms in science. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Doctoral Roundtable in Community Health Sciences", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 288": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, three hours; discussion, one hour. Requisites: course 210 or prior social sciences courses. Media utilization, media effects, media content, media advocacy, media literacy, health journalism, video and audio storytelling techniques, new media, entertainment education, and transmedia. Competencies: media content analysis, writing popular nonfiction (blogs, journalism), creating and evaluating effective communications using popular media. Letter grading.", 
        "prerequisiteDescription": "course 210 or prior social sciences courses", 
        "prerequisites": [], 
        "title": "Health Communication in Popular Media", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 290": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, three hours; discussion, one hour. Experience of aging for African American, Latino, and Asian elderly examined in context of their families, communities, and nation. Exploration of cultural and structural influences on health and lived experiences of those elders. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Race, Class, Culture, and Aging", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 291": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, three hours; discussion, one hour. Examination of political, economic, and social forces that shape health policy for aged, identifying failings in those policies within framework of broader health policy problems. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Health Policy and Aged", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 292": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, three hours; field practice, one hour. Requisites: course 210 or prior social sciences courses. Health literacy, Internet use and health communication, design of health communication materials using digital media that integrates practice and theory and includes websites, print materials, short videos, curricula, and training materials. Laboratory sessions for materials production. Competencies: creating health communication materials for diverse audiences using new media information technology applied to website, social media, print media, video, and audio platforms. Letter grading.", 
        "prerequisiteDescription": "course 210 or prior social sciences courses", 
        "prerequisites": [], 
        "title": "Information Technology for Health Promotion and Communication", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 293": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Discussion, two hours; individual consultation, two hours. Review and discussion of research programs directed toward identification of psychosocial, biobehavioral, environmental, and community factors related to prevention and control of AIDS/HIV. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Social and Behavioral Research in AIDS: Roundtable Discus   sion", 
        "unit": "2 to 4", 
        "unitType": "RANGE"
    }, 
    "COM HLT 295": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, four hours. Designed for graduate students. Overview of issues involved in disaster preparedness and response for public health agencies. Introduction to theoretical and practice aspects of field of emergency public health. Examination of disaster cycle and various natural and human-induced hazards from public health perspective. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Overview of Emergency Public Health", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 296": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Discussion, two to four hours. Advanced study and analysis of current topics in community health sciences. Discussion of current research and literature in research specialty of faculty member teaching course. May be repeated for credit. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Research Topics in Community Health Sciences", 
        "unit": "2 to 4", 
        "unitType": "RANGE"
    }, 
    "COM HLT 375": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Seminar, to be arranged. Preparation: apprentice personnel employment as teaching assistant, associate, or fellow. Teaching apprenticeship under active guidance and supervision of regular faculty member responsible for curriculum and instruction at UCLA. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Teaching Apprentice Practicum", 
        "unit": "1 to 4", 
        "unitType": "RANGE"
    }, 
    "COM HLT 400": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Fieldwork, to be arranged. Field observation and studies in selected community organizations for health promotion or medical care. Students must file field placement and program training documentation on form available from Student Affairs Office. May not be applied toward M.S. minimum course requirement; 4 units may be applied toward 60-unit minimum total required for M.P.H. degree. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Field Studies in Public Health", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 427": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, four hours. Recommended requisite: course 247. In-depth understanding of reproductive health challenges facing sub-Saharan Africa and main programs designed to address them. Topics include family planning, STIs, abortion, adolescents, HIV/AIDS, and refugees. Letter grading.", 
        "prerequisiteDescription": "course 247", 
        "prerequisites": [
            [
                "COM HLT 247"
            ]
        ], 
        "title": "Reproductive Health in Sub-Saharan Africa", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 431": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, three hours. Limited to graduate students. Understanding reproductive technologies and practices is critical for public health students interested in designing programs to address problems such as unwanted pregnancy, family planning, sexually transmitted diseases, and inadequate preventive services. Examination of foundations of reproductive health from medical perspective, with particular attention to implications for public health programs, health services, and policy. Topics include anatomy and physiology of male and female reproductive health tracts, methods of birth control, medical and surgical abortion, infertility, maternal care, and sexual violence and trauma. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Foundations of Reproductive Health", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 432": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, three hours; discussion, one hour. Comprehensive examination of perinatal healthcare, including perinatal epidemiology, outcome measures, public programs, controversies surrounding new technology, regionalization, organization of services at federal, state, and county levels, and medical/legal issues. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Perinatal Healthcare: Principles, Programs, and Policies", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 434A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, four hours. Requisite: course 231. Major health problems of mothers and children in developing areas, stressing causation, management, and prevention. Particular reference to adapting programs to limited resources in cross-cultural milieux. S/U or letter grading.", 
        "prerequisiteDescription": "course 231", 
        "prerequisites": [
            [
                "COM HLT 231"
            ]
        ], 
        "title": "Maternal and Child Health in Developing Areas", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 435": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Seminar, three hours. Preparation: at least one prior women's health course, one to two biostatistics courses, one research methods course. Provides more advanced and in-depth understanding of ways in which scientists \"know\" and considerations of women's place in scientific discourse. Examination of series of case studies as starting point for discussion. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Seminar: Advanced Issues in Women's Health", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 440": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, two hours; discussion, one hour; research and literature review, one hour. Designed for graduate students. Exploration of community and environmental health and health services issues that are present along U.S.-Mexico and coastal California borders. Integrated within public health framework are issues and mitigation of national security and disaster/terrorist risks and hazards. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Public Health and National Security at U.S.-Mexico Border", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 441": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, four hours. Theory, guidelines, and team exercise for planning community health/family planning projects in U.S. and in developing countries. Phases include community needs identification; goal setting; budget and work plan development; funding; staffing; evaluation design; data and cost analysis; and project presentation. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Planning and Evaluation of Global Health Programs", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 444": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, two hours; discussion, one hour; laboratory, two hours. Practical skills in anthropometric and dietary assessment, including selection of appropriate methods, data gathering and handling, and analysis and presentation. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Anthropometric and Dietary Aspects of Nutritional Assessment", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 446": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, two hours; discussion, one hour; student participation, one hour. Requisite: course 434A. Problems and priorities in nutrition education and training for families and health workers in Third World countries, including new concepts in primary healthcare services, mass media, communications, and governmental and international interventions. S/U or letter grading.", 
        "prerequisiteDescription": "course 434A", 
        "prerequisites": [
            [
                "COM HLT 434A"
            ]
        ], 
        "title": "Nutrition Education and Training: Third World Considerations", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 447": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, four hours. Recommended preparation: background in Islamic or Middle Eastern studies. Requisite: course 200 or 231 or 434A. Current health issues and problems of countries in Middle East and implications for socioeconomic development. Review of economic, demographic, and cultural variation of region to provide background for discussion of trends and patterns of health and nutritional status of population in area. Letter grading.", 
        "prerequisiteDescription": "course 200 or 231 or 434A", 
        "prerequisites": [], 
        "title": "Health and Social Context in Middle East", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 448": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, two hours; discussion, two hours; field visits. Preparation: one nutrition sciences course and/or nutrition program experience. Nutrition programs and policies in U.S. and developing countries compared and contrasted. Analysis of role of major international, governmental, and nongovernmental agencies. Emphasis on meeting needs of vulnerable populations. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Nutrition Policies and Programs: Domestic and International  Perspectives", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 449": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, four hours. Requisite: course 130 or one introductory nutrition or biology course. Advanced-level seminar on nutritional needs of healthy individuals, current knowledge of role of nutrition in disease prevention, nutritional and metabolic responses to disease, and role of nutritional therapy in management of disease. Letter grading.", 
        "prerequisiteDescription": "course 130 or one introductory nutrition or biology course", 
        "prerequisites": [], 
        "title": "Nutrition and Chronic Disease", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 451": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, four hours. Examination of how public health research and practices can be combined to address post-disaster community health needs. Identification of disaster-related health problems, data collection strategies, and service delivery approaches in post-disaster environment. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Post-Disaster Community Health", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 452": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, three hours. Designed for second-year master's or doctoral students interested in humanitarian relief. Basic principles required to design rational and cost-effective food and nutrition emergency relief approaches and programs. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Management of Food and Nutrition in Major Emergencies", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 477": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, two hours; discussion, one hour. Limited to graduate students. Examination of health disparities affecting sexual minority populations, category that includes lesbians, gay men, bisexuals, and transgender (LGBT) persons. Use of Healthy People 2010 Companion Document for LGBT Health to outline key health issues and national recommendations for achieving reductions in each area. Discussion of considerations for providing clinical care and public health practice in this population, unique social and contextual factors influencing LGBT health, and methodological issues for conducting research among LGBT persons. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Health Disparities, Health Equity, and Sexual Minority Populations", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 48": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, three hours; discussion, one hour. Overview of nutritional sciences and public health nutrition. Examination of basic science concepts of nutrition and application of them to student lives and real-world issues through lectures, videos, diet analysis, activities, reports, discussion of video and reading assignments, and reviews of community programs that apply nutrition and behavior theory to improve health of public. Students use observational research methods to create and answer questions about nutrition question in their cohort. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Nutrition and Food Studies: Principles and Practice (Effective Fall 2018 )", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 482": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Discussion, two hours; fieldwork, up to 20 hours. Requisites: courses 210, 211A, 211B. Understanding of professional practice in health-related organizations. Letter grading.", 
        "prerequisiteDescription": "courses 210, 211A, 211B", 
        "prerequisites": [], 
        "title": "Practicum: Community Health Sciences", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 484": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, three hours; fieldwork, one hour. Requisites: courses 210, 211A, and 211B, or prior public health and behavioral sciences courses. Risk communication theory, research, and practice, including social and psychological bases of population risk perceptions, media theories, and how risk is portrayed in media. Environmental, product safety, food-borne and infectious diseases, disasters, and bioterrorism communication. Competencies: understanding everyday and emergency risk communication principles, creating valid risk communication messages and materials, working proactively with new media. Letter grading.", 
        "prerequisiteDescription": "courses 210, 211A, and 211B, or prior public health and behavioral sciences courses", 
        "prerequisites": [], 
        "title": "Risk Communications", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 485": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, three hours; fieldwork, one hour. Designed for graduate students. Overview course of fund and resource development for public health and community-based programs. Lectures and workshops include developing grant proposals, researching funding sources, evaluating proposals, developing volunteer and in-kind resources, and implementing capital campaigns. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Resource Development for Community Health Programs", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 487": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, three hours; fieldwork, four to six hours. Preparation: three public health, sociology, or anthropology courses. Requisite: course 210. Theory and practice of community organizations, including models and strategies of community organization and their application to health problems and health policy. Particular attention to use of community organization for health promotion and to change public policy. Letter grading.", 
        "prerequisiteDescription": "course 210", 
        "prerequisites": [
            [
                "COM HLT 210"
            ]
        ], 
        "title": "Community Organization for Health", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 501": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Tutorial, to be arranged. Preparation: consent of UCLA graduate adviser and graduate dean, and host campus instructor, department chair, and graduate dean. Used to record enrollment of UCLA students in courses taken under cooperative arrangements with USC. No more than 8 units may be applied toward master's degree minimum total course requirement; may not be applied toward minimum graduate course requirement. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Cooperative Program", 
        "unit": "2 to 8", 
        "unitType": "RANGE"
    }, 
    "COM HLT 596": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Tutorial, to be arranged. Limited to graduate students. Individual guided studies under direct faculty supervision. Only 4 units may be applied toward M.P.H. and M.S. minimum total course requirement. May be repeated for credit. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Directed Individual Study or Research", 
        "unit": "2 to 12", 
        "unitType": "RANGE"
    }, 
    "COM HLT 597": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Tutorial, to be arranged. Limited to graduate students. May not be applied toward any degree course requirements. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Preparation for Master's Comprehensive or Doctoral Qualifying Examinations", 
        "unit": "2 to 12", 
        "unitType": "RANGE"
    }, 
    "COM HLT 598": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Tutorial, to be arranged. Only 4 units may be applied toward M.P.H. and M.S. minimum total course requirement; may not be applied toward minimum graduate course requirement. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Master's Thesis Research", 
        "unit": "2 to 8", 
        "unitType": "RANGE"
    }, 
    "COM HLT 599": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Tutorial, to be arranged. May not be applied toward any degree course requirements. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Doctoral Dissertation Research", 
        "unit": "2 to 12", 
        "unitType": "RANGE"
    }, 
    "COM HLT 60": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Seminar, two hours. Discussion on issues of difference, conflict, and community to facilitate understanding between social/cultural groups. Student participation in semi-structured face-to-face meetings with students from other social identity groups to learn from each others' perspectives, read and discuss relevant reading material, and explore their own and other groups' experiences in various social and institutional contexts. Exploration of ways of taking action to create change and bridge differences at interpersonal and social/community levels. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Intergroup Dialogue: Peer Dialogue", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 80": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, one hour; activity, two hours. Success in undergraduate experience is very much influenced by attributes beyond intellectual competence. Examination of personal, social, and environmental factors that influence college students' eating behaviors, physical activity patterns, and body image. Development of individualized student plans for eating well, being active, and feeling good about their bodies. Learning of practical skills with application to nutrition, physical activity, positive body image, stress management, and other aspects of wellness as students participate in critical evaluation of popular diets, healthy body weights, fitness, supplements, media body ideals, and self-destructive thoughts. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "FITTED: Fitness Improvement Training through Exercise and Diet", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 89": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 89HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Tutorial, three hours. Limited to students in College Honors and departmental honors programs. Designed as adjunct to lower division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Contracts", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 91": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Lecture, four hours. Limited to students in Peer Health Counselor Program. Analysis of student healthcare issues as related to campus healthcare delivery system and to healthcare consumer. Identification of health needs, determination of appropriate resources, delivery of preventive and self-care education, and delineation of peer health counselor's role. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Peer Health Counselor Training", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT 99": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Student Research Program", 
        "unit": "1 to 2", 
        "unitType": "RANGE"
    }, 
    "COM HLT CM170": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Labor and Workplace Studies M170.) Lecture, three hours; fieldwork, two hours. Examination of intersection between work, health, and environment, analysis of social causes of health disparities, investigation of historical trends and social movements, interpretation of current policy debates, and development of innovative interventions. Concurrently scheduled with course CM470. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Improving Worker Health: Social Movements, Policy Debates, and Public Health", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT CM470": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Environmental Health Sciences M471 and Urban Planning M470.) Lecture, three hours; fieldwork, two hours. Examination of intersection between work, health, and environment, analysis of social causes of health disparities, investigation of historical trends and social movements, interpretation of current policy debates, and development of innovative interventions. Concurrently scheduled with course CM170. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Improving Worker Health: Social Movements, Policy Debates, and Public Health", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M140": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Asian American Studies M129.) Lecture, three hours; fieldwork, one hour. Introductory overview of mental and physical health issues of Asian Americans and Pacific Islanders; identification of gaps in health status indicators and barriers to both care delivery and research for these populations. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Health Issues for Asian Americans and Pacific Islanders: Myth or Model?", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M208": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Biostatistics M208, Economics M208, and Sociology M213A.) Lecture, four hours. Preparation: one introductory statistics course. Introduction to methods of demographic analysis. Topics include demographic rates, standardization, decomposition of differences, life tables, survival analysis, cohort analysis, birth interval analysis, models of population growth, stable populations, population projection, and demographic data sources. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Demographic Methods", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M216": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Anthropology M284A.) Seminar, three hours; laboratory, one hour. Intensive seminar/field course in qualitative research methodology. Emphasis on using qualitative methods and techniques in research and evaluation related to healthcare. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Qualitative Research Methodology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M218": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Epidemiology M218.) Lecture, four hours. Requisites: courses 211A and 211B, or Epidemiology 200B and 200C. Design, testing, field use, and administration of data collection instruments, with particular emphasis on questionnaires. Letter grading.", 
        "prerequisiteDescription": "courses 211A and 211B, or Epidemiology 200B and 200C", 
        "prerequisites": [], 
        "title": "Questionnaire Design and Administration", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M222": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Sociology M206.) Lecture, three hours. Preparation: one formal or social demography course. Requisite: Biostatistics 100A. Application of demographic theories and methods to describe fertility trends and differentials and social and proximate determinants of fertility, with emphasis on understanding key proximate determinants. For advanced students interested in population, demography of health, and social demography. Letter grading.", 
        "prerequisiteDescription": "BIOSTAT 100A", 
        "prerequisites": [], 
        "title": "Understanding Fertility: Theories and Methods", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M228": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Health Policy and Management M228.) Seminar, three hours; discussion, one hour. Limited to graduate students. Highly recommended: Health Policy and Management 225A and 225B, or completion of coursework in basic research design and methods. Introduction to mixed methods research, with emphasis on its application to public health research. Equips students with skills to critique mixed method research designs and to design mixed methods research investigation for health issue of interest. Study of different mixed methods research designs commonly used in public health and health services research, including feasibility studies, convergent parallel design, sequential mixed methods, and multiphase studies. Use of combination of didactic and applied techniques. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Mixed Methods Research", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M232": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Health Policy M242.) Lecture, three hours; discussion, one hour. Designed for graduate students. Critical analysis of models for what determines health and evidence for social, economic, environmental, genetic, health system, and other factors that influence health of populations and defined subgroups. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Determinants of Health", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M234": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Health Policy M255.) Seminar, three hours; outside study, one hour. Designed for graduate students. Multidisciplinary introduction at graduate level to epidemiology, physiology, and current state of preventive and therapeutic interventions for obesity in adults and children, including public health policy approaches to healthy nutrition and physical activity promotion. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Obesity, Physical Activity, and Nutrition Seminar", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M237": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Health Policy M290.) Seminar, three hours; fieldwork, one hour. Designed for graduate students. Introduction to use of early childhood interventions as means of preventing adverse health and developmental outcomes. Concepts of developmental vulnerability, approaches to assessment, models of service delivery, evaluation and cost-benefit issues, funding, and other policy issues. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Evolving Paradigms of Prevention: Interventions in Early Childhood", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M239": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Asian American Studies M239.) Seminar, three hours. Integration of cross-cultural findings in healthcare with current American (U.S.) healthcare system paradigms to facilitate designing culturally based public health programs and train culturally competent practitioners. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Race, Ethnicity, and Culture as Concepts in Practice and Research", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M245A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Dentistry M300A, Education M217G, Law M281A, Medicine M290A, Nursing M290A, and Social Welfare M203F.) Lecture, two hours. Course M245A is requisite to M245B, which is requisite to M245C. Intensive interdisciplinary study of child physical and sexual abuse and neglect, with lectures by faculty members of Schools of Dentistry, Law, Medicine, Nursing, and Public Health and Departments of Education and Psychology, as well as by relevant public agencies. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Child Abuse and Neglect", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M245B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Dentistry M300B, Education M217H, Law M281A-M281B, Medicine M290A-M290B, Nursing M290B, and Social Welfare M203G.) Lecture, two hours. Requisite: course M245A. Intensive interdisciplinary study of child physical and sexual abuse and neglect, with lectures by faculty members of Schools of Dentistry, Law, Medicine, Nursing, and Public Health and Departments of Education and Psychology, as well as by relevant public agencies. Letter grading.", 
        "prerequisiteDescription": "course M245A", 
        "prerequisites": [
            [
                "COM HLT M245A"
            ]
        ], 
        "title": "Child Abuse and Neglect", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M245C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Dentistry M300C, Education M217I, Law M281B, Medicine M290B, Nursing M290C, and Social Welfare M203H.) Lecture, two hours. Requisite: course M245B. Intensive interdisciplinary study of child physical and sexual abuse and neglect, with lectures by faculty members of Schools of Dentistry, Law, Medicine, Nursing, and Public Health and Departments of Education and Psychology, as well as by relevant public agencies. Letter grading.", 
        "prerequisiteDescription": "course M245B", 
        "prerequisites": [
            [
                "COM HLT M245B"
            ]
        ], 
        "title": "Child Abuse and Neglect", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M249L": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Health Policy M285.) Lecture, four hours. Requisites: Health Policy 200A, 200B. Introduction to ethical theories and critical ethical issues pertaining to healthcare policy and healthcare management. Research, writing, and discussion on variety of topics related to health and human rights to enhance professionalism, leadership, and systems thinking and improve student sensitivity to needs of patients, coworkers, and fiduciary shareholders. How ethics are foundation of leadership. Letter grading.", 
        "prerequisiteDescription": "Health Policy 200A, 200B", 
        "prerequisites": [], 
        "title": "Ethical Theory and Applications in Public Health", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M250": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Latin American Studies M262.) Seminar, three hours. Exploration of cultural, political, and public health context for people living with and at risk for HIV/AIDS and their families in Latin America. Public health aspects, including epidemiology, comorbidity concerns and community interventions, medical anthropological study of experience of those impacted, and grass-roots responses, as well as political/economic context addressing poverty and structural violence. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "HIV/AIDS and Culture in Latin America", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M251": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Epidemiology M254.) Lecture, two hours; discussion/laboratory exercise, one hour. Preparation: introductory biostatistics and epidemiology courses. Review of all aspects of contemporary nutrition sciences that require application of epidemiologic principles and methods, ranging from food-borne outbreak investigation to evidence-based regulatory assessment of health claims for foods. Experience in actual world of collecting, analyzing, and interpreting data related to nutrition and health or disease outcomes. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Nutritional Epidemiology I", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M252": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Health Policy M233.) Lecture, three hours. Requisites: Health Policy 100 or 200A, 236, M287. Conceptual and procedural tools for analysis of health policy, emphasizing role of analysis during various phases of lifecycle of public policy. Letter grading.", 
        "prerequisiteDescription": "Health Policy 100 or 200A, 236, M287", 
        "prerequisites": [], 
        "title": "Health Policy Analysis", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M256": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Medicine M256, Nursing M298, and Oral Biology M256.) Lecture, three hours; discussion, one hour. Designed to instill in professional students ideas of common emergency health problems and coordinated response, with specific attention to bioterrorism. Examination of tools to help students prevent, detect, and intervene in infectious disease emergencies. Interdisciplinary sessions also attended by students in Schools of Dentistry, Medicine, and Nursing during weeks two through five. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Interdisciplinary Response to Infectious Disease Emergencies: Public Health Perspective", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M260": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Anthropology M233R and Latin American Studies M260.) Lecture, three hours. Recommended requisite: course 132. Health issues throughout Americas, especially indigenous/Mestizo Latin American populations. Holistic approach covering politics, economics, history, geography, human rights, maternal/child health, culture. Letter grading.", 
        "prerequisiteDescription": "course 132", 
        "prerequisites": [
            [
                "COM HLT 132"
            ]
        ], 
        "title": "Health and Culture in Americas", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M263": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Sociology M263.) Lecture, three hours. Designed for graduate students. Use of city of Los Angeles to examine major social and demographic factors that characterize cities in U.S. Examination of role of these factors in affecting health outcomes. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Social Demography of Los Angeles", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M264": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Anthropology M233Q and Latin American Studies M264.) Lecture, three hours. Recommended preparation: course 132, bilingual English/Spanish skills. Examination of role of traditional medicine and shamanism in Latin America and exploration of how indigenous and mestizo groups diagnose and treat folk illness and Western-defined diseases with variety of health-seeking methods. Examination of art, music, and ritual and case examples of religion and healing practices via lecture, film, and audiotape. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Latin America: Traditional Medicine, Shamanism, and Folk Illness", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M272": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Epidemiology M272.) Lecture, two hours; discussion, one hour. Requisite: Epidemiology 100. Relationship between sociological, cultural, and psychosocial factors in etiology, occurrence, and distribution of morbidity and mortality. Emphasis on lifestyles and other socioenvironmental factors associated with general susceptibility to disease and subsequent mortality. Letter grading.", 
        "prerequisiteDescription": "Epidemiology 100", 
        "prerequisites": [], 
        "title": "Social Epidemiology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M278": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Environmental Health Sciences M270.) Lecture, three hours; practicum, one hour. Recommended preparation: graduate-level methods/statistics course, basic epidemiology. Designed for graduate students. Exploration of impact of work on physical and psychological health in context of newly emerging discipline. Focus on psychosocial models, measurement (including hands-on experience), contextual factors (gender, ethnicity, social class), and how work stressors can be ameliorated. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Work and Health", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M287": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Health Policy M287.) Lecture, three hours; discussion, one hour. Requisites: course 210, or Health Policy 200A and 200B. Examination of politics of health policy process, including effects of political structure and institutions; economic and social factors; interest groups, classes, and social movements; media and public opinion; and other factors. Letter grading.", 
        "prerequisiteDescription": "course 210, or Health Policy 200A and 200B", 
        "prerequisites": [], 
        "title": "Politics of Health Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M294": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Psychiatry M288.) Lecture, four hours. Requisites: course 100 and Epidemiology 100, or prior social sciences courses. Overview of social and behavioral factors that influence both transmission and prevention of HIV/AIDS throughout world. Letter grading.", 
        "prerequisiteDescription": "course 100 and Epidemiology 100, or prior social sciences courses", 
        "prerequisites": [], 
        "title": "Social and Behavioral Factors of HIV/AIDS: Global Perspective", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M411": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Health Policy M411.) Lecture, four hours. Designed for juniors/seniors and graduate students. Introduction to causes and characteristics of cancer epidemic, cancer control goals for nation, and interventions designed to encourage smoking cessation/prevention, cancer screening, and other dietary, psychosocial, and lifestyle changes. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Issues in Cancer Prevention and Control", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M420": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Health Policy M420 and Social Welfare M290I.) Lecture, three hours; fieldwork, one hour. Examination and evaluation of principles, policies, programs, and practices that have evolved to identify, assess, and meet special needs of infants, children, and adolescents with developmental disabilities or chronic illness and their families. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Children with Special Healthcare Needs: Systems Perspective", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M428": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Health Policy M428.) Seminar, two hours. Designed for graduate students. Examination of characteristics of community-based organizations (CBOs) and role of leadership in decision-making process involved in major issues facing maternal and child health in Los Angeles County. Focus on specific leadership competencies that are or should be employed by organizations effective in shaping maternal and child health programs and policies (or any population-level policies and programs). Leaders from CBOs in Los Angeles meet with students, comment on their practicum experiences, and underscore community leadership concepts demonstrated by those CBOs. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Child and Family Health Program Community Leadership Seminar", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M430": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Health Policy M434.) Seminar, three hours. Recommended requisite: one prior health policy course such as Community Health Sciences 247 or Health Policy 235. Designed for School of Public Health graduate and doctoral students. Skills-building course to develop competency in assessing, developing, and implementing advocacy strategies for reproductive health initiatives. Introduction to legislative and community advocacy initiatives and to policymaking process, including policy analysis and development of resources necessary for legislative advocacy. Identification of advocacy goals and objectives, development of advocacy plan, coalition building, organizational capacity building, media relations, and message development for various audiences. Students learn about range of former and current reproductive health advocacy campaigns. Letter grading.", 
        "prerequisiteDescription": "one prior health policy course such as Community Health Sciences 247 or Health Policy 235", 
        "prerequisites": [], 
        "title": "Building Advocacy Skills: Reproductive Health Focus", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M436A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Health Policy M449A.) Lecture, four hours. Requisite: Health Policy 100. Course M436A is requisite to M436B. Examination of history of child health policy trends and determinants of health, structure, and function of health service system; needs, programs, and policies affecting especially at-risk populations. Letter grading.", 
        "prerequisiteDescription": "Health Policy 100", 
        "prerequisites": [], 
        "title": "Child Health, Programs, and Policies", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM HLT M436B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM HLT", 
        "departmentFullName": "Community Health Sciences", 
        "description": "(Same as Health Policy M449B.) Lecture, four hours. Requisites: course M436A, Health Policy 100. Examination of history of child health policy trends and determinants of health, structure, and function of health service system; needs, programs, and policies affecting especially at-risk populations. Letter grading.", 
        "prerequisiteDescription": "course M436A, Health Policy 100", 
        "prerequisites": [], 
        "title": "Child Health, Programs, and Policies", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }
}