{
    "COM LIT 10": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Lecture, two hours; discussion, two hours. What exactly are humanities? Position of humanities as not science is becoming unclear as human communication, thought, and culture are increasingly tied to technology. Examination of various disciplines within humanities at UCLA to define their place in today's society, contemplate their possible function in tomorrow's world, and determine to whom humanities will and will not cater in future. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Virtual Realities: Introduction to Humanities", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 100": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Lecture, four hours. Preparation: satisfaction of Entry-Level Writing and College Writing requirements. Requisites: two courses from Comparative Literature 1 or 2 series or English 10 series or Spanish 60 series, etc. Seminar-style introduction to discipline of comparative literature presented through series of texts illustrative of its formation and practice. Letter grading.", 
        "prerequisiteDescription": "two courses from Comparative Literature 1 or 2 series or English 10 series or Spanish 60 series, etc", 
        "prerequisites": [], 
        "title": "Introduction to Literary and Critical Theory", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 102": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Designed for upper division literature majors. Analysis of \"Iliad,\" \"Odyssey,\" \"Aeneid,\" \"Gerusalemme Liberata,\" and \"Paradise Lost\" both in relation to their contemporary societies and to literary traditions. Emphasis on how poets build on work of their predecessors. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Classical Tradition: Epic", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 103": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Problem of migrants and refugees in ongoing crisis of European Union. Examination of contemporary crisis of European Union and of European multiculturalism in particular. Overview of history of European integration since World War II, as well as more focused examination of ways in which culture and migration have come to dominate discussions of future of what had primarily been conceived of as one economic union. Offered in summer only. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "People on Run: Migrants, Minorities, and Multiculturalism in Europe", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 106": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Designed for juniors/seniors. Survey and analysis of function and appearance of such archetypal heroes as Achilles, Ulysses, Prometheus, Oedipus, and Orpheus in literature from antiquity to modern period. All works read in translation. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Archetypal Heroes in Literature", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 108": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Designed for juniors/seniors. Focus on number of narratives that use autobiographical mode to situate self in relation to history of nations and biography of family members. Introduction to theories of subjectivity and to genre of self-writing in France, Africa, and Caribbean. Comparison of serial autobiographies of Assia Djebar, Annie Ernaux, and Jamaica Kincaid to better understand limits of genre. Texts represent different limit cases of autobiography and can be read as biography, auto/ethnography, and auto/historiography. Examination of differences that emerge between autobiographical pact (Lejeune) that some authors create with their readers and liberties that others take with history. Attention to way visual culture (painting, photography, film) helps authors make their point, access memory, or create metaphors of self. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Autobiography in Francophone and Anglophone Worlds", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 111": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Preparation: satisfaction of Entry-Level Writing and College writing requirements. Requisites: two courses from Comparative Literature 1 or 2 series or English 10 series or Spanish 60 series. Recommended: course 100. Exploration of history of comparative literature discipline and variety of central methodological past and present debates concerning nature of discipline. Introduction to several key theoretical texts from early 20th century to present, addressing these and other related questions: what does it mean to read comparatively? What is significance of reading literature across existing national and linguistic borders? What are criteria for conducting such comparative readings? Is comparative reading more concerned with finding similarities or differences? P/NP or letter grading.", 
        "prerequisiteDescription": "two courses from Comparative Literature 1 or 2 series or English 10 series or Spanish 60 series", 
        "prerequisites": [], 
        "title": "Histories and Methodologies of Comparative Literature", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 154": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, four hours. Designed for upper division literature majors. Interdisciplinary study of avant-garde literature and art, including futurism, Dadaism, Expressionism, Surrealism, new avant-gardes. Works by Marinetti, Boccioni, Picasso, Stein, Malevich, Popova, Mayakovsky, Brecht, Fritz Lang, Duchamp, Breton, Bunuel, Lispector, Warhol, Orlan. Emphasis on cross-fertilization among different kinds of aesthetic expression. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Adventures of Avant-Garde", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 169": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Lecture, three hours. Requisite: one course from 1A, 1B, 1C, 2AW, 2BW, 2CW, or English Composition 3 or 3H. Introduction to new set of African authors and attempt to discern similarities or differences they may have with major authors such as Achebe, Ngugi, Armath, Soyinka, etc. P/NP or letter grading.", 
        "prerequisiteDescription": "one course from 1A, 1B, 1C, 2AW, 2BW, 2CW, or English Composition 3 or 3H", 
        "prerequisites": [], 
        "title": "Continental African Authors", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 177": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Designed for juniors/seniors. Introduction to literature and culture of Caribbean basin from New Orleans to Haiti, Martinique, Guadeloupe, Jamaica, Antigua, or Trinidad. Topics include history of French and English colonial influences and rivalries, Haitian revolution and its literary legacies, emergence of nationalist discourses, search for cultural identity, rhetoric of negritude, global poetics of relation, créolité movement. and literary achievements of African diaspora. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Comparative Studies of Francophone and Anglophone Caribbean", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 180": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Designed for juniors/seniors. Study and discussion of defined periods and approaches in medical humanities, giving pride of place to literary and cultural expressions in dialogue with other disciplines such as anthropology, history, linguistics, philosophy, psychology, or sociology. Consult \"Schedule of Classes\" for topics to be offered in specific term. May be repeated for credit with topic change. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Variable Topics: Medical Humanities in Comparative Contexts", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 180SL": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours; fieldwork, three hours. Exploration of topics in medical humanities with community service component, giving pride of place to literary and cultural expressions with other disciplines such as art, philosophy, or sociology. Ways in which medical humanities can make contributions to Los Angeles community through service learning. Consult Schedule of Classes for topics to be offered in specific term. May be repeated for credit with topic or instructor change. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Variable Topics: Medical Humanities in Comparative Contexts and Community-Based Learning", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 186": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Preparation: satisfaction of Entry-Level Writing and College Writing requirements. Designed for undergraduate students interested in learning more about research and/or writing honors thesis. Introduction to research in comparative literature, with focus on critical and theoretical methodologies and approaches to analyzing literary texts. Students complete final paper on topic of their own design. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Undergraduate Research Seminar: Comparative Literature", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 188SA": {
        "corequisiteDescription": "HNRS 101E", 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Individual Studies for USIE Facilitators", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 188SB": {
        "corequisiteDescription": "HNRS 101E", 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.", 
        "prerequisiteDescription": "course 188SA", 
        "prerequisites": [
            [
                "COM LIT 188SA"
            ]
        ], 
        "title": "Individual Studies for USIE Facilitators", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 188SC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.", 
        "prerequisiteDescription": "course 188SB", 
        "prerequisites": [
            [
                "COM LIT 188SB"
            ]
        ], 
        "title": "Individual Studies for USIE Facilitators", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 189": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 189HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Contracts", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 19": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Fiat Lux Freshman Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 190": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Designed to bring together students undertaking supervised tutorial research in seminar setting with one or more faculty members to discuss their own work or related work in discipline. Led by one supervising faculty member. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Research Colloquia in Comparative Literature", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 191": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Designed for juniors/seniors. Study and discussion of limited periods and specialized issues and approaches in literary theory, especially in relation to other modes of discourse such as history, philosophy, psychology, linguistics, anthropology. Development of culminating project required. Consult \"Schedule of Classes\" for topics to be offered in specific term. May be repeated for credit with topic change. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Variable Topics in Comparative Literature", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 197": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Tutorial, three hours. Limited to juniors/seniors. Individual intensive study, with scheduled meetings to be arranged between faculty member and student. Assigned reading and tangible evidence of mastery of subject matter required. May be repeated for credit. Individual contract required. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Individual Studies in Comparative Literature", 
        "unit": "2 to 4", 
        "unitType": "RANGE"
    }, 
    "COM LIT 198": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Tutorial, three hours. Limited to senior comparative literature honors students. Development and completion of honors thesis or comprehensive project on comparative topic selected by student and written under supervision of core faculty member. Students expected to meet regularly with supervisor throughout term. No more than one course may be used to fulfill four-course requirement for Comparative Literature majors. May be repeated once for maximum of 8 units. Individual contract required. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Research in Comparative Literature", 
        "unit": "2 to 4", 
        "unitType": "RANGE"
    }, 
    "COM LIT 199": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Tutorial, three hours. Requisite: course 100. Limited to juniors/seniors. Supervised individual research or investigation under guidance of faculty mentor. Culminating paper or project required. May be repeated for credit with consent of chair. Individual contract required. P/NP or letter grading.", 
        "prerequisiteDescription": "course 100", 
        "prerequisites": [
            [
                "COM LIT 100"
            ]
        ], 
        "title": "Directed Research or Senior Project in Comparative Literature", 
        "unit": "2 to 4", 
        "unitType": "RANGE"
    }, 
    "COM LIT 1A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Lecture, three hours; discussion, one hour. Enforced requisite: satisfaction of Entry-Level Writing requirement. Not open for credit to students with credit for course 2AW or 4AW. Study of major texts in world literature, with emphasis on Western civilization. Texts include major works and authors such as \"Iliad\" or \"Odyssey,\" Greek tragedies, portions of Bible, Virgil, Petronius, St. Augustine, and others such as \"Gilgamesh\" or \"Tristan and Iseult.\" P/NP or letter grading.", 
        "prerequisiteDescription": "satisfaction of Entry-Level Writing requirement", 
        "prerequisites": [], 
        "title": "World Literature: Antiquity to Middle Ages", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 1B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Lecture, three hours; discussion, one hour. Enforced requisite: satisfaction of Entry-Level Writing requirement. Not open for credit to students with credit for course 2BW or 4BW. Study of world literature, with emphasis on Western civilization as it grapples with its past and with other civilizations. Examination of works such as Dante's \"Divine Comedy,\" Cervantes' \"Don Quixote,\" Shakespeare's \"King Lear,\" and Sor Juana's Mexican poetry. P/NP or letter grading.", 
        "prerequisiteDescription": "satisfaction of Entry-Level Writing requirement", 
        "prerequisites": [], 
        "title": "World Literature: Middle Ages to 17th Century", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 1C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Lecture, three hours; discussion, one hour. Enforced requisite: satisfaction of Entry-Level Writing requirement. Not open for credit to students with credit for course 2CW or 4CW. Study of major texts in world literature, with emphasis on Western civilization. Authors include Swift, Voltaire, Diderot, Rousseau, Goethe, Flaubert, Ibsen, Strindberg, Dostoevsky, Kafka, Joyce, Woolf, and Stevens. P/NP or letter grading.", 
        "prerequisiteDescription": "satisfaction of Entry-Level Writing requirement", 
        "prerequisites": [], 
        "title": "World Literature: Age of Enlightenment to 20th Century", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 1D": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Lecture, three hours; discussion, one hour. Enforced requisite: satisfaction of Entry-Level Writing requirement. Not open for credit to students with credit for course 2DW or 4DW. Study of major literary texts usually overlooked in courses that focus only on canon of Western literature. Texts from at least three of following areas read in any given term: African, Caribbean, East Asian, Latin American, and Middle Eastern literature. P/NP or letter grading.", 
        "prerequisiteDescription": "satisfaction of Entry-Level Writing requirement", 
        "prerequisites": [], 
        "title": "Great Books from World at Large", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 1E": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Lecture, two hours; discussion, two hours. Enforced requisite: satisfaction of Entry-Level Writing requirement. Study of social media as platform for storytelling, with core focus on three distinct cultures: U.S., China, and Russia. History, form, and various functions of social media. Examination of how we tell stories about ourselves and how we interpret digital narratives we see, hear, or read from organizations near and far. Analysis of networked narratives encountered online. P/NP or letter grading.", 
        "prerequisiteDescription": "satisfaction of Entry-Level Writing requirement", 
        "prerequisites": [], 
        "title": "Social Media and Storytelling: Comparing Cultures", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 200A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Study of theory of literature, with emphasis on genealogy of theoretical problems. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Theory of Comparative Literature", 
        "unit": 6, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 200B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Requisite: course 200A. Study of methodology of comparative literature, with emphasis on its history. S/U or letter grading.", 
        "prerequisiteDescription": "course 200A", 
        "prerequisites": [
            [
                "COM LIT 200A"
            ]
        ], 
        "title": "Methodology of Comparative Literature", 
        "unit": 6, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 202": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Preparation: reading knowledge of Greek, Latin, or Italian. Analysis of Greek and Roman works and their re-creations in Renaissance and modern periods. Emphasis on how poets build on work of their predecessors. Reading may range from \"Iliad\" or \"Odyssey\" to tragedies by Sophocles and Euripides or satires by Aristophanes. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Classical Tradition: Epic, Tragedy, or Comedy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 206": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Preparation: reading knowledge of one appropriate foreign language. Survey and analysis of function and appearance of such archetypal heroes as Achilles, Ulysses, Prometheus, Oedipus, and Orpheus in literature from antiquity to modern period. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Archetypal Heroes in Literature", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 210": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Limited to graduate students. Introduction to theories of autobiography and subjectivity and to genre of autobiography in literatures in French and English and across centuries. Topics include early modern approaches to self-writing, Rousseau and emergence of modern self, women's autobiography, postcolonial autobiography, cultural studies and turn to personal, fictions of self-representation, serial autobiography, and virtual selves. Theorists may include Georges Gusdorf, Philippe Lejeune, Paul de Man, Jacques Derrida, Helene Cixous, Michel Foucault, Pierre Bourdieu, and Toril Moi. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Comparative Studies in Autobiography", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 220": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, four hours. Preparation: reading knowledge of one appropriate foreign language. Examination of nature of cross-cultural, cross-linguistic, and cross-confessional exchange in known medieval worlds of Europe, Asia, and Africa, with focus on communication and translation. Drawing on literary, social, cultural, economic, art history, and manuscript studies to trace formation of discourses produced by diverse encounters. Choice of bilingual texts. May be repeated for credit with topic change. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Topics in Medieval Studies", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 266": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Preparation: knowledge of one appropriate foreign language. Designed for graduate students. Investigation of intertextual relations between writing and photography in American and European contexts. Study rests on premise that photograph enters public domain framed by writing and discourse and that, in turn, some forms of writing are framed by photographic modes of representation. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Writing and Photographic Image", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 267": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Limited to graduate students. Investigation of ways in which Arab littérateurs, artists, and intellectuals have perseveringly sought to imagine and construct viable structures of cultural empowerment on pyre of political project of Arab nationalism and in growing response to globalization and consolidation of Western colonial and imperial ideologies in Arab world. Particular attention to technical and experimental modes of expression through which Arab artists working in different genres have engaged with some persistent and recurrent questions related to their mission, vocation, and commitment (iltizam) to fundamental concerns of Arab world, to responsible mimetic urgency, and to general uses/potencies of rhetoric and poetics within contexts of profound asymmetries of power, temporalities, and actualities. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Comparative Arab Studies", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 271": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Preparation: reading knowledge of one appropriate foreign language. Examination of archetypal female figures in classical/traditional literatures and their reincarnations in modern African American, Anglo-American, Asian American, European, Native American, and Spanish-American literatures. Particular emphasis on position of women in cultures and ideology of authors. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Imaginary Women", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 275": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Preparation: knowledge of one appropriate foreign language. Designed for graduate students. Literary and social discourses on issues of nationalism, immigration, and politics of identity in our postcolonial era, with consideration of broad range of texts (aesthetic representations, theoretical reflections, and legal documents). S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Nationalism and Immigration Today", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 277": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Historical approach to modern Anglophone and Francophone Caribbean literature, retracing search for cultural identity, beginning with negritude movement's claim to Africa as expressed in Aime Cesaire's classic poem \"Cahier d un retour au pays natal\" and ending with consideration of dispersion of identities in work of writers and intellectuals who contend with problem of diasporic Caribbean culture. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Caribbean Literature from Negritude to Diaspora", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 279": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Examination of certain links between practice of cultural criticism and problems in historiography of colonial and postcolonial societies. Use of key texts by members of Subaltern Studies collective of Indian historians to explore some central issues arising from this relationship. What kind of interdisciplinary space is produced by dialog of history and literary and cultural theory? Attention to literary texts to practice such interdisciplinary criticism. Nature of modernity in colonial setting. What is nature of bourgeoisie in colonial society? What kind of modernization does it seek? What is relationship of modern metropolitan bourgeoisie to indigenous one? S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Subaltern Studies: Colonial Histories and Cultural Critique", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 280": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Preparation: reading knowledge of one foreign language. In-depth study of one topic of Latin American literature in comparative context. May be repeated for credit. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Latin American Literature in Comparative Contexts", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 284": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Examination of various approaches to concept of translation and to its significance for literary studies. Readings include authors such as Matthew Arnold, Walter Benjamin, George Steiner, and Susan Bassnett. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Theories of Translation", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 285": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Preparation: solid reading knowledge of at least one foreign language. Open to qualified undergraduates with proper language preparation. Introduction to principles of literary translation heuristically, that is, on basis of texts participating students translate, and presentation of student work for discussion. Opportunity for students to determine whether they have desire and talent to pursue literary translation as part of their professional lives. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Translation Workshop", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 286": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours; tutorial, one hour. Preparation: solid reading knowledge of at least one foreign language. Designed for graduate social sciences students. Techniques students need to render scholarly texts in their fields from language they use in their research into English and to advance their knowledge of language to stage where they can use it more effectively in all aspects of their research, as well as take advantage of translation techniques they have learned. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Workshop: Social Sciences Translation", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 289": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours; film screening, two hours. Study of redefinition and aims of theories of film and literature. Approaches vary by instructor (e.g., postcoloniality, psychoanalysis, semiotics, transnationalism, gender theory). S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Theory of Film and Literature", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 290": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Requisite: course 200A. Advanced course in theory of literature focusing on structuralist, psychoanalytic, and Marxist approaches. S/U or letter grading.", 
        "prerequisiteDescription": "course 200A", 
        "prerequisites": [
            [
                "COM LIT 200A"
            ]
        ], 
        "title": "Contemporary Theories of Criticism", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 291": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Preparation: reading knowledge of French or German. Requisite: course 290. Study of specific topics in theory of literature for advanced students in criticism and literary theory. May be repeated for credit. S/U or letter grading.", 
        "prerequisiteDescription": "course 290", 
        "prerequisites": [
            [
                "COM LIT 290"
            ]
        ], 
        "title": "Problems in Theory of Literature", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 292": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. History of theorizations of modern imperialism and colonialism since relevant writings of Karl Marx and Friedrich Engels. Examination of number of landmark theories of empire and consideration of whether or not they may be said to constitute coherent tradition or line of theoretical development. Question of resistance to imperial rule and role it plays in these theoretical accounts. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Theories of Empire", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 299": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Preparation: reading knowledge of one appropriate foreign language. Study of literary theory through exploration of approaches to literature by philosophers grounded on analytic tradition. Careful attention to concepts of truth, meaning, expression, representation, metaphor, fiction, and literature. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Aesthetics and Literature", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 2AW": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Lecture, two hours; discussion, two hours. Enforced requisite: English Composition 3 or 3H or English as a Second Language 36. Not open for credit to students with credit for course 1A or 4AW. Study of selected texts from antiquity to Middle Ages, with emphasis on literary analysis and expository writing. Texts include works and authors such as \"Odyssey,\" \"Gilgamesh,\" Sappho, Greek tragedies, \"Aeneid,\" Petronius, Beowulf, Marie de France, \"Tristan and Iseult,\" \"1001 Nights,\" \"Popul Vuh.\" Satisfies Writing II requirement. Letter grading.", 
        "prerequisiteDescription": "English Composition 3 or 3H or English as a Second Language 36", 
        "prerequisites": [], 
        "title": "Survey of Literature: Antiquity to Middle Ages", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 2BW": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Lecture, two hours; discussion, two hours. Enforced requisite: English Composition 3 or 3H or English as a Second Language 36. Not open for credit to students with credit for course 1B or 4BW. Study of selected texts from Middle Ages to 17th century, with emphasis on literary analysis and expository writing. Texts may include works by authors such as Chaucer, Dante, Cervantes, Marguerite de Navarre, Shakespeare, Calderón, Molière, and Racine. Satisfies Writing II requirement. Letter grading.", 
        "prerequisiteDescription": "English Composition 3 or 3H or English as a Second Language 36", 
        "prerequisites": [], 
        "title": "Survey of Literature: Middle Ages to 17th Century", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 2CW": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Lecture, two hours; discussion, two hours. Enforced requisite: English Composition 3 or 3H or English as a Second Language 36. Not open for credit to students with credit for course 1C or 4CW. Study of selected texts from Age of Enlightenment to 20th century, with emphasis on literary analysis and expository writing. Texts may include works by authors such as Swift, Voltaire, Diderot, Rousseau, Goethe, Flaubert, Ibsen, Strindberg, M. Shelley, Dostoevsky, Kafka, James Joyce, Garcia Marquez, and Jamaica Kincaid. Satisfies Writing II requirement. Letter grading.", 
        "prerequisiteDescription": "English Composition 3 or 3H or English as a Second Language 36", 
        "prerequisites": [], 
        "title": "Survey of Literature: Age of Enlightenment to 20th Century", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 2DW": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Lecture, two hours; discussion, two hours. Enforced requisite: English Composition 3 or 3H or English as a Second Language 36. Not open for credit to students with credit for course 1D or 4DW. Study of major literary texts usually overlooked in courses that focus only on canon of Western literature, with emphasis on literary analysis and expository writing. Texts from at least three of following areas read in any given term: African, Caribbean, East Asian, Latin American, and Middle Eastern literature. Satisfies Writing II requirement. Letter grading.", 
        "prerequisiteDescription": "English Composition 3 or 3H or English as a Second Language 36", 
        "prerequisites": [], 
        "title": "Survey of Literature: Great Books from World at Large", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 375": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, to be arranged. Preparation: apprentice personnel employment as teaching assistant, associate, or fellow. Teaching apprenticeship under active guidance and supervision of regular faculty member responsible for curriculum and instruction at UCLA. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Teaching Apprentice Practicum", 
        "unit": "1 to 4", 
        "unitType": "RANGE"
    }, 
    "COM LIT 495": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Seminar on problems and methods of presenting literary texts as exemplary materials in teaching of composition. Deals with theory and classroom practice and involves individual counseling and faculty evaluation of teaching assistants' performance. May not be applied toward M.A. course requirements. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Preparation for Teaching Literature and Composition", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 4AW": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Discussion, four hours. Enforced requisite: English Composition 3 or 3H or English as a Second Language 36. Not open for credit to students with credit for course 1A or 2AW. Study and discussion of selected texts from antiquity to Middle Ages, with emphasis on literary analysis and expository writing. Texts include works and authors such as \"Iliad,\" \"Odyssey,\" \"Gilgamesh,\" Sappho, Greek tragedies, \"Aeneid,\" Petronius, \"Beowulf,\" or Marie de France. Satisfies Writing II requirement. Letter grading.", 
        "prerequisiteDescription": "English Composition 3 or 3H or English as a Second Language 36", 
        "prerequisites": [], 
        "title": "Literature and Writing: Antiquity to Middle Ages", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 4BW": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Discussion, four hours. Enforced requisite: English Composition 3 or 3H or English as a Second Language 36. Not open for credit to students with credit for course 1B or 2BW. Study and discussion of selected texts from Middle Ages to 17th century, with emphasis on literary analysis and expository writing. Texts may include works and authors such as Chaucer, Dante's \"Divine Comedy,\" Cervantes' \"Don Quixote,\" Shakespeare, \"1001 Nights,\" Christine de Pizan, \"Popul Vuh,\" Molière, and Racine. Satisfies Writing II requirement. Letter grading.", 
        "prerequisiteDescription": "English Composition 3 or 3H or English as a Second Language 36", 
        "prerequisites": [], 
        "title": "Literature and Writing: Middle Ages to 17th Century", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 4CW": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Discussion, four hours. Enforced requisite: English Composition 3 or 3H or English as a Second Language 36. Not open for credit to students with credit for course 1C or 2CW. Study and discussion of selected texts from Age of Enlightenment to 20th century, with emphasis on literary analysis and expository writing. Texts may include works by authors such as Swift, Voltaire, Diderot, Rousseau, Goethe, M. Shelley, Flaubert, Ibsen, Strindberg, Dostoevsky, Gogol, Kafka, Joyce, Beckett, L. Hughes, and Garcia Marquez. Satisfies Writing II requirement. Letter grading.", 
        "prerequisiteDescription": "English Composition 3 or 3H or English as a Second Language 36", 
        "prerequisites": [], 
        "title": "Literature and Writing: Age of Enlightenment to 20th Century", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 4DW": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Discussion, four hours. Enforced requisite: English Composition 3 or 3H or English as a Second Language 36. Not open for credit to students with credit for course 1D or 2DW. Study and discussion of major literary texts usually overlooked in courses that focus only on canon of Western literature, with emphasis on literary analysis and expository writing. Texts from at least three of following areas read in any given term: African, Caribbean, East Asian, Latin American, and Middle Eastern literature. Texts may include works by authors such as Ngugi, Desai, Kincaid, Emecheta, El Saadawi, Achebe, Pak, Can Xue, Neruda, and Rushdie. Satisfies Writing II requirement. Letter grading.", 
        "prerequisiteDescription": "English Composition 3 or 3H or English as a Second Language 36", 
        "prerequisites": [], 
        "title": "Literature and Writing: Great Books from World at Large", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 501": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Tutorial, to be arranged. Preparation: consent of UCLA graduate adviser and graduate dean, and host campus instructor, department chair, and graduate dean. Used to record enrollment of UCLA students in courses taken under cooperative arrangements with USC. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Cooperative Program", 
        "unit": "2 to 8", 
        "unitType": "RANGE"
    }, 
    "COM LIT 596": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Tutorial, to be arranged. Limited to graduate comparative literature students. Necessary for students in comparative literature who need additional individual study and research. May be repeated for credit. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Directed Individual Study or Research", 
        "unit": "2 to 12", 
        "unitType": "RANGE"
    }, 
    "COM LIT 596X": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Tutorial, to be arranged. Preparation for foreign language examination. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Directed Individual Study", 
        "unit": "2 to 4", 
        "unitType": "RANGE"
    }, 
    "COM LIT 597": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Tutorial, to be arranged. Limited to graduate students. Preparation for M.A. comprehensive examination or Ph.D. qualifying examinations. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Preparation for M.A", 
        "unit": "2 to 12", 
        "unitType": "RANGE"
    }, 
    "COM LIT 599": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Tutorial, to be arranged. Limited to Ph.D. students. Research for and preparation of Ph.D. dissertation. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Research for Ph.D", 
        "unit": "2 to 12", 
        "unitType": "RANGE"
    }, 
    "COM LIT 89": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 89HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Contracts", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT 99": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Student Research Program", 
        "unit": "1 to 2", 
        "unitType": "RANGE"
    }, 
    "COM LIT C105": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Lecture, three hours. Designed for upper division literature majors. Literary masterpieces, both dramatic and nondramatic, selected to demonstrate varieties of comic expression. May be concurrently scheduled with course C205. Undergraduate students read all works in translation. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Comic Vision", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT C122": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Lecture, three hours. Designed for upper division literature majors. Broad introduction to subject matter and types of plays in Renaissance, with consideration of historical and literary influences on plays. Readings include works of such dramatists as Tasso, Machiavelli, Lope de Vega, Racine, Jonson, Shakespeare. May be concurrently scheduled with course C222. Undergraduate students read all works in translation. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Renaissance Drama", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT C152": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, four hours. Designed for upper division literature majors. Study of symbolist and decadent movements in 19th- and 20th-century English and French poetry and prose, including authors such as Baudelaire, Rimbaud, Verlaine, Mallarmé, Wilde, Yeats, and Eliot. May be concurrently scheduled with course C252. Undergraduate students may read all required French texts in translation. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Symbolism and Decadence", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT C153": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, four hours. Designed for upper division literature majors. Study of specific poets and poetics related to them during first half of 20th century. Texts may include poets such as W.B. Yeats, Ezra Pound, T.S. Eliot, Paul Valéry, R.M. Rilke, Gunnar Ekelöf, and Wallace Stevens. May be concurrently scheduled with course C253. Undergraduate students may read all works in translation. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Post-Symbolist Poetry and Poetics", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT C156": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Designed for upper division literature majors. Time and again in modern literature, corpses become conduits or catalysts for revelation. What are ghosts that fiction frequently cannot put to rest, and what is their connection to national history or nation language or narrative? Readings from James Joyce, John Banville, Henry James, Toni Morrison, Adolfo Bioy Casares, Juan Carlos Onetti, Juan Rulfo, and Carlos Fuentes, with films by Alejandro Amenabar, Andrei Tarkovsky, and Kenji Mizoguchi. May be concurrently scheduled with course C256. Undergraduate students read all works in translation. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Fantastic Fictions", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT C160": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Lecture, three hours. Designed for juniors/seniors. Knowledge of art history valuable but not required. Assuming that literature and visual arts are in some degree expressions of cultural and philosophical patterns of eras, study of relationships between writers and movements in painting, architecture, and sculpture. Interdisciplinary investigation of similarities and differences between plastic and verbal arts in comparative study. May be repeated for credit with instructor and/or topic change. May be concurrently scheduled with course C260. Undergraduate students read all works in translation. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Literature and Visual Arts", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT C161": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Designed for upper division literature majors. Analysis of use of historical events, situations, and characters in literary works of Renaissance and/or modern period. Texts and individual assignments range from Renaissance historical narratives (Italian humanists, Machiavelli) to 19th- and 20th-century novels by authors such as Stendhal, Verga, Tomasi di Lampedusa, Carpentier, and Kundera. Use of fictional methods by historians. Emphasis on how aesthetic, ideological, and political factors influence authors' choice and use of historical material. May be concurrently scheduled with course C261. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Fiction and History", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT C163": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Designed for upper division literature majors. Study of modern European and American works that are concerned both in subject matter and artistic methods with growing self-consciousness of human beings and their society, with focus on works of Kafka, Rilke, Woolf, Sartre, and Stevens. May be concurrently scheduled with course C263. Undergraduate students may read all works in translation. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Crisis of Consciousness in Modern Literature", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT C164": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Designed for upper division literature majors. Study of modern European novel's development from 19th to 21st century. Use of authors such as Hardy, Strindberg, Lagerkvist, Gide, Proust, Mann, Joyce, Kafka, Woolf, Nabokov, Grass, Christa Wolf, and Enquist to focus on development of themes such as shifting authority, gender conflicts, change versus stability, formal experimentation, and self-consciousness in narrative. May be concurrently scheduled with course C264. Undergraduate students may read all works in translation but are encouraged to read in original language whenever possible. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Modern European Novel", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT C172": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Designed for upper division literature majors. Study of postmodern novel as it developed out of modernism. Postmodernism defined in three different ways -- philosophically, scientifically, and economically. Emphasis on relationship of recent novels to theories of structuralism and poststructuralism. Readings include authors such as Borges, Beckett, Nabokov, Pynchon, Fuentes, Grass, Böll, and Calvino. Concurrently scheduled with course C272. Undergraduate students read all works in translation. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Postmodern Novel", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT C178": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Survey of significant issues in history of 20th-century Indian literature and culture. Great works of modern Indian culture by such figures as Rabindranath Tagore, Satyajit Ray, Faiz Ahmed Faiz, and U.R. Anantha Murthy, including novels, short stories, poetry, films, music, and works in cultural criticism and historical scholarship. Central and defining issue for 20th-century Indian culture is experience of British colonial rule and massive cultural and material changes that accompanied it. Exploration of manner in which literature and culture have developed in interaction with powerful social forces, such as struggle for national independence from Britain under leaders like Mahatma Gandhi and expansion of Indian diaspora. Concurrently scheduled with course C278. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "India Ink: Literature and Culture of Modern South Asia", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT C187": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. What is it we do when we try to understand words, habits, gestures, and beliefs not our own? Do we understand something foreign to us by immersing ourselves in it or by standing apart? Does ability to understand something foreign imply taking universal standpoint? Can we make judgments about beliefs other than our own? Questions of cultural interpretation have long history in both Western and non-Western cultures. Discussion of history of questions about cross-cultural interpretation and comparative interpretation of cultures in both comparative literature and cultural anthropology. Reading of some very complex and influential works by such writers as Claude Lévi-Strauss, Amitav Ghosh, James Clifford, Edward Said, Gayatri Spivak, and Erich Auerbach. Concurrently scheduled with course C287. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Reading across Culture", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT C205": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Lecture, three hours. Preparation: reading knowledge of one appropriate foreign language. Literary masterpieces, both dramatic and nondramatic, selected to demonstrate varieties of comic expression. May be concurrently scheduled with course C105. Graduate students required to prepare papers based on texts read in original languages and to meet as group one additional hour each week. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Comic Vision", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT C222": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Lecture, three hours. Preparation: reading knowledge of one appropriate foreign language. Broad introduction to subject matter and types of plays in Renaissance, with consideration of historical and literary influences on plays. Readings include works of such dramatists as Tasso, Machiavelli, Lope de Vega, Racine, Jonson, Shakespeare. May be concurrently scheduled with course C122. Graduate students required to prepare papers based on texts read in original languages and to meet as group one additional hour each week. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Renaissance Drama", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT C252": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, four hours. Preparation: reading knowledge of French. Study of symbolist and decadent movements in 19th- and 20th-century English and French poetry and prose, including authors such as Baudelaire, Rimbaud, Verlaine, Mallarmé, Wilde, Yeats, and Eliot. May be concurrently scheduled with course C152. Graduate students required to prepare papers based on texts read in original languages and may meet as group one additional hour each week. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Symbolism and Decadence", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT C253": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, four hours. Study of specific poets and poetics related to them during first half of 20th century. Texts may include poets such as W.B. Yeats, Ezra Pound, T.S. Eliot, Paul Valéry, R.M. Rilke, Gunnar Ekelöf, and Wallace Stevens. May be concurrently scheduled with course C153. Graduate students may meet as group one additional hour each week. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Post-Symbolist Poetry and Poetics", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT C256": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Time and again in modern literature, corpses become conduits or catalysts for revelation. What are ghosts that fiction frequently cannot put to rest, and what is their connection to national history or nation language or narrative? Readings from James Joyce, John Banville, Henry James, Toni Morrison, Adolfo Bioy Casares, Juan Carlos Onetti, Juan Rulfo, and Carlos Fuentes, with films by Alejandro Amenabar, Andrei Tarkovsky, and Kenji Mizoguchi. May be concurrently scheduled with course C156. Graduate students have additional meetings and theoretical readings by Benjamin, Freud, Barthes, Derrida, Rabate, Rickels, and Caruth. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Fantastic Fictions", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT C260": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Lecture, three hours. Knowledge of art history valuable but not required. Assuming that literature and visual arts are in some degree expressions of cultural and philosophical patterns of eras, study of relationships between writers and movements in painting, architecture, and sculpture. Interdisciplinary investigation of similarities and differences between plastic and verbal arts in comparative study. May be repeated for credit with instructor and/or topic change. May be concurrently scheduled with course C160. Graduate students required to read works in original languages. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Literature and Visual Arts", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT C261": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Analysis of use of historical events, situations, and characters in literary works of Renaissance and/or modern period. Texts and individual assignments range from Renaissance historical narratives (Italian humanists, Machiavelli) to 19th- and 20th-century novels by authors such as Stendhal, Verga, Tomasi di Lampedusa, Carpentier, and Kundera. Use of fictional methods by historians. Emphasis on how aesthetic, ideological, and political factors influence authors' choice and use of historical material. May be concurrently scheduled with course C161. Graduate students required to prepare papers based on texts read in original languages. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Fiction and History", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT C263": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Preparation: reading knowledge of one appropriate foreign language. Study of modern European and American works that are concerned both in subject matter and artistic methods with growing self-consciousness of human beings and their society, with focus on works of Kafka, Rilke, Woolf, Sartre, and Stevens. May be concurrently scheduled with course C163. Graduate students required to prepare papers based on texts read in original languages and to meet as group one additional hour each week. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Crisis of Consciousness in Modern Literature", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT C264": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Preparation: reading knowledge of at least one appropriate foreign language. Study of modern European novel's development from 19th to 21st century. Use of authors such as Hardy, Strindberg, Lagerkvist, Gide, Proust, Mann, Joyce, Kafka, Woolf, Nabokov, Grass, Christa Wolf, and Enquist to focus on development of themes such as shifting authority, gender conflicts, change versus stability, formal experimentation, and self-consciousness in narrative. May be concurrently scheduled with course C164. Graduate students required to prepare papers based on texts read in original languages whenever possible and to meet one additional hour each week. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Modern European Novel", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT C272": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Preparation: reading knowledge of one appropriate foreign language. Study of postmodern novel as it developed out of modernism. Postmodernism defined in three different ways -- philosophically, scientifically, and economically. Emphasis on relationship of recent novels to theories of structuralism and poststructuralism. Readings include authors such as Borges, Beckett, Nabokov, Pynchon, Fuentes, Grass, Böll, and Calvino. Concurrently scheduled with course C172. Graduate students required to meet as group one additional hour each week. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Postmodern Novel", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT C278": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. Survey of significant issues in history of 20th-century Indian literature and culture. Great works of modern Indian culture by such figures as Rabindranath Tagore, Satyajit Ray, Faiz Ahmed Faiz, and U.R. Anantha Murthy, including novels, short stories, poetry, films, music, and works in cultural criticism and historical scholarship. Central and defining issue for 20th-century Indian culture is experience of British colonial rule and massive cultural and material changes that accompanied it. Exploration of manner in which literature and culture have developed in interaction with powerful social forces, such as struggle for national independence from Britain under leaders like Mahatma Gandhi and expansion of Indian diaspora. Concurrently scheduled with course C178. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "India Ink: Literature and Culture of Modern South Asia", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT C287": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "Seminar, three hours. What is it we do when we try to understand words, habits, gestures, and beliefs not our own? Do we understand something foreign to us by immersing ourselves in it or by standing apart? Does ability to understand something foreign imply taking universal standpoint? Can we make judgments about beliefs other than our own? Questions of cultural interpretation have long history in both Western and non-Western cultures. Discussion of history of questions about cross-cultural interpretation and comparative interpretation of cultures in both comparative literature and cultural anthropology. Reading of some very complex and influential works by such writers as Claude Lévi-Strauss, Amitav Ghosh, James Clifford, Edward Said, Gayatri Spivak, and Erich Auerbach. Concurrently scheduled with course C187. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Reading across Culture", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT CM170": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "(Same as Gender Studies CM170.) Seminar, three hours. Designed for upper division literature majors. Investigation of narrative texts by contemporary French, German, English, American, Spanish American, African, and Asian women writers from cross-cultural perspective. Common themes, problems, and techniques. Concurrently scheduled with course CM270. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Alternate Traditions: In Search of Female Voices in Contemporary Literature", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT CM270": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "(Same as Gender Studies CM270.) Seminar, four hours. Designed for graduate students. Investigation of narrative texts by contemporary French, German, English, American, Spanish American, African, and Asian women writers from cross-cultural perspective. Common themes, problems, and techniques. Concurrently scheduled with course CM170. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Alternate Traditions: In Search of Female Voices in Contemporary Literature", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT M101": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "(Same as Jewish Studies M150A.) Lecture, three hours. Study of literary culture of ancient Israel through examination of principal compositional strategies of Hebrew Bible and Apocrypha (read in translation). P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Hebrew Literature in English: Literary Traditions of Ancient Israel -- Bible and Apocrypha", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT M110": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "(Same as Arabic M110.) Lecture, three hours. Knowledge of Arabic not required. Since its appearance in Europe in 1704, \"Thousand and One Nights\" is most well-known work of Arabic literature in West. Examination of cycle of tales more commonly known as \"Arabian Nights,\" including history of its translation, contemporary oral performances of tales in Arabic-speaking world, literary emergence of vernacular language in relation to classical Arabic, and Western appropriations of tales in music, film, and novels (Ravel, Rimsky-Korsakov, Barth, Poe, and Walt Disney). P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Thousand and One Nights/Alf Layla Wa-Layla", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT M119": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "(Same as Arabic M155.) Lecture, three hours. Study of literature of Islamic Spain to learn about interaction of Arabic and Western and Arabic and Jewish cultures and to recognize Islamic culture as vital force in European life and letters. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Al-Andalus: Literature of Islamic Spain", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT M123": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "(Same as Arabic M123.) Lecture, three hours. Knowledge of Arabic not required. Introduction to study of living oral traditions of troubadours, storytellers, oral poets, and performers in Arabic-speaking Middle East. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Oral Literature and Performance of Arab World", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT M132": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "(Same as Russian M132.) Lecture, three hours. History, form, and function of various media. Grounded in political and commercial experience of eastern Europe, comparative investigation of media technologies, today's burgeoning markets, and yesterday's tragic abuses. Development of media form(s) and content across various times, places, and cultures, with special attention to Slavic phenomena. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Comparative Media Studies", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT M148": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "(Same as Arabic M148.) Seminar, three hours. Exploration of conjunctions between contemporary Arab film and song and between popular cultures and cultures of commitment (Iltizam), with possible focus on specific genres such as realist/neorealist Arab film; feminist Arab film or popular Arab film and song; topics such as nation, gender, and representation or democracy and human rights or censorship, reception, and resistance. Possible examination of various national cinemas such as Tunisian, Egyptian, Moroccan, Algerian, and Palestinian. Various musical genres such as Rai, Mizoued, and Hip-hop also examined in relation to emergence not only of national cinemas, national music industries, and iconic singers but also of video clip, satellite TV, star academy, and reality shows -- all products of transnational and pan-Arab mass media. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Contemporary Arab Film and Song", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT M162": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "(Same as Jewish Studies M162.) Lecture, three hours. Attempt to impart profound understanding of Israel as seen through its literature. Examination of variety of literary texts -- stories, novels, and poems -- and reading of them in context of their historical backgrounds. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Israel Seen through Its Literature", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT M165": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "(Same as Jewish Studies M187.) Lecture, three hours. Investigation of how Holocaust informs variety of literary and cinema works and raises wide range of aesthetic and moral questions. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Holocaust in Literature", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT M166": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "(Same as Jewish Studies M151A.) Lecture, three hours. Study of literary responses of Jews to modernity, its challenges, and threats. Readings in texts originally written in English or translated from Hebrew, Yiddish, German, Russian, French, and Italian. Analysis of formal aspects of each work. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Modern Jewish Literature in English: Diaspora Literature", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT M167": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "(Same as Arabic M151.) Lecture, three hours. Designed for upper division literature majors. Topics may include constructions of otherness in modern Arab culture; East-West debate; memory, trauma, and mourning; violence, narrative, and ethics; globalization, oil, and cultural insurgency; Arab culture in transnational context or questions of reception, exoticism, translation, and marketing. Genres may include prison narratives; novel of terror; memoirs by women and/or by refugees and exiles; 19th- and 20th-century travel narratives; Arabic romantic poetry; literature of pre-1948; rise of Arab novel. Areas may range from generic look at Arab world to narrow focus on Maghreb or one country such as Algeria, Palestine, Iraq, Lebanon, or Egypt. May also be organized around Arab literatures written in one specific language, namely English, Arabic, or French. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Modern Arabic Literature in English", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT M171": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "(Same as Asian American Studies M130B and Chinese M153.) Lecture, three hours; discussion, one hour. Knowledge of Chinese not required. In-depth look at Chinese immigrant experience by reading literature and watching films. Theories of diaspora, gender, and race to inform thinking and discussion of relevant issues. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Chinese Immigrant Literature and Film", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT M175": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "(Same as Asian American Studies M165.) Seminar, three hours. Theoretical and literary readings combined to explore three main aspects of social and cultural experience (race, gender, class) as separate but interconnected spheres affecting both minority and majority populations in U.S. Examination of these issues from comparative perspectives. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Race, Gender, Class", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT M176": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "(Same as Japanese M156.) Lecture, three hours. Knowledge of Japanese not required. Examination of representation of technology in 20th-century fiction. Discussion of impact of technology on shifting images of gender, subjectivity, and national identity. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Literature and Technology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT M251": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "(Same as Arabic M255.) Seminar, three hours. Limited to graduate students. Examination of traditionally diverse literatures of Maghreb in their multiple and competing contexts of language and gender politics, religious and cultural formations, Pan-Arabism and postcolonial nationhood, Third-Worldism and economic development, modernity and globalization, immigration and citizenship, soccer industry and Rai music, mass media and Star Academy Maghreb, and more. Readings of literatures in English and in English translations from different Maghrebian languages (particularly Arabic and French) in conjunction with theories of language and linguistic pluralism, cultural translation, deconstruction, and host of other relevant theories of gender, globalization, and postcolonial cultural studies. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Literatures and Cultures of Maghreb", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT M274": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "(Same as Asian American Studies M261.) Seminar, three hours. Investigation of politics of power, gender, and race in complex relationships between so-called First World and Third World, using both theoretical and textual approaches. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Theorizing Third World", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT M276": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "(Same as Japanese M276.) Seminar, three hours. Designed for graduate students. Exploration of construction of human body through various modern technologies and discourses, including those of disease, diet, race, gender, and sexuality. Examination of texts from variety of locales, with particular emphasis on Japan. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Reading Modern Bodies", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT M288": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "(Same as Arabic M288.) Seminar, three hours. While much has been written and said about resurgence and spread of political Islam after collapse of ideology of secular nationalism and failure of Arab left to apprehend exigencies of postrevolutionary/postcolonial moment, little has been devoted to less sensational topic of modern Arab thought despite unmistakable proliferation of critical output produced by Arab thinkers and artists in aftermath of 1967. Course addresses and redresses this glaring imbalance by considering new cultural material -- literary, critical, philosophical, artistic, and journalistic -- produced before and after al-Nahda but mostly before and after 1967 and fosters insightful approaches to unlikely coexistence in Arab contemporaneity of ever-deepening and generalized crisis and of steady and consolidated development (if not effervescence) of cultural and artistic production. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Modern Arab Thought", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "COM LIT M294": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "COM LIT", 
        "departmentFullName": "Comparative Literature", 
        "description": "(Same as English M270.) Seminar, three hours. Advanced interdisciplinary seminar to explore philosophical, historical, and critical foundations of literary theory as well as current issues in literary and cultural studies. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Seminar: Literary Theory", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }
}