{
    "CAEM 19": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Fiat Lux Freshman Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "CAEM 211": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "Lecture, three hours. Introduction to important scientific parameters in conservation of materials that are of great importance for both fundamental science and practical applications. Students gain better understanding of intrinsic properties of materials, mechanisms of deterioration, and conservation treatments. General chemistry, physics, and physical chemistry (atomic structure bonding, etc.), fluid transfer in porous materials, diffusion, interfaces, surface tension, wetting, adsorption, adhesion, dissolution and crystallization, mechanical properties (properties/charactization), phase transformations (glass, metals, polymers). Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Science Fundamentals in Conservation of Materials", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CAEM 221": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "Lecture, three hours; activity, one hour. Introduction to preservation of cultural heritage materials, including what should be preserved and why, as well as who should be involved in decision-making process. Use of several examples of issues and problems involved in preservation of works of art, from L.A. Murals to Sistine Chapel, from ancient wall paintings to Statue of Liberty. Discussion of issues of preservation and restoration of these cultural heritage materials both in museum and outdoor environment contexts. Materials and techniques used to make cultural heritage materials, in relation to preservation efforts needed to prevent decay and loss. Introduction to examples of conservation issues related to sites, buildings, monuments, and collections. Ethical and contextual aspects with reference to changing values in conservation of cultural materials, illustrating how cultural materials may have been treated differently according to those values. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Principles, Practice, and Ethics in Conservation", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CAEM 222": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "Laboratory, four hours. Designed for graduate conservation students. Introduction to work as conservators with indigenous repositories housing cultural collections. Students learn different models for tribal museums and cultural centers, and importance of material selection and properties in baskets they are treating. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Conservation and Ethnography", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CAEM 224": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "Seminar, three hours. Designed to offer practical model of preservation and management planning for heritage sites that reflects real case-study scenarios. Adaptive management planning following iterative processes for sustainable heritage preservation addressing threats and challenges such as climate change and global warming, conflicts, and neglect. Consideration of significance and value of heritage sites and role of stakeholders. Investigation of methods of evaluation of physical condition and development of risk assessments to address physical risks in milieu of site preservation management, including visitors' organization, urban development, socioeconomic growth, and tourist development. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Issues in Preservation and Management of Archaeological and Cultural Sites", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CAEM 230": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "Laboratory, four hours. Requisite: course 260. Recommended: course M215. Hands-on study in deterioration and conservation of ceramics and glass. Evaluation of use of conservation materials in joining, gap-filling, and restoration of ceramics and experience in their use provided. Letter grading.", 
        "prerequisiteDescription": "course 260", 
        "prerequisites": [
            [
                "CAEM 260"
            ]
        ], 
        "title": "Conservation Laboratory: Ceramics, Glass, Glazes", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CAEM 231": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "Laboratory, four hours. Enforced requisite: course 261. Research-based laboratory on conservation of stone and adobe. Conservation issues on cleaning, consolidation, protection, and structural instability. Characterization, diagnostic assessment, and development of conservation treatment proposals. Testing of materials. Letter grading.", 
        "prerequisiteDescription": "course 261", 
        "prerequisites": [
            [
                "CAEM 261"
            ]
        ], 
        "title": "Conservation Laboratory: Stone and Adobe", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CAEM 232": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "Laboratory, four hours. Enforced requisite: course 262. Designed for graduate conservation students. How to recognize characteristic deterioration problems found in organic materials from archaeological and ethnographic contexts and introduction to typical treatments used historically and currently for these materials. Materials focus on wood, bark and barkcloth, paper, and plastics and rubber. Letter grading.", 
        "prerequisiteDescription": "course 262", 
        "prerequisites": [
            [
                "CAEM 262"
            ]
        ], 
        "title": "Conservation Laboratory: Organic Materials I", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CAEM 234": {
        "corequisiteDescription": "course M210", 
        "corequisites": [
            [
                "CAEM M210"
            ]
        ], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "Laboratory, four hours. Enforced requisite: course 263. Recommended: course 215. Recommended corequisite: course M210. Designed for graduate conservation students. Hands-on work to study deterioration and conservation of metallic artifacts and composite objects containing metals (copper and copper alloys, and silver). Corrosion of ancient metals and their deterioration processes, conservation, problems in stability, issues with composite objects, their deterioration and stabilization, cleaning, joining, and gap-filling. Letter grading.", 
        "prerequisiteDescription": "course 263", 
        "prerequisites": [
            [
                "CAEM 263"
            ]
        ], 
        "title": "Conservation Laboratory: Metals I", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CAEM 238": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "Laboratory, four hours. Enforced requisite: course 262. Designed for graduate conservation students. Typical treatments used historically and currently for deterioration problems found in organic materials from archaeological and ethnographic contexts. Materials include plant and animal fibers, feathers, and quills. Letter grading.", 
        "prerequisiteDescription": "course 262", 
        "prerequisites": [
            [
                "CAEM 262"
            ]
        ], 
        "title": "Conservation Laboratory: Organic Materials II", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CAEM 239": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "Laboratory, four hours; outside study, eight hours. Requisites: courses 234, 263. Recommended: courses M210, M215. Treatment of conservation problems of metallic artifacts made of iron, steel, cast iron, gold, zinc, and aluminum that have some importance in ethnographic objects. Practical work on metallic artifacts. Letter grading.", 
        "prerequisiteDescription": "courses 234, 263", 
        "prerequisites": [], 
        "title": "Conservation Laboratory: Metals II", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CAEM 241": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "Laboratory, four hours. Enforced requisites: courses 232, 238, 262. Designed for graduate conservation students. Treatment of organic materials from archaeological and ethnographic contexts and introduction to typical treatments used historically and currently for these materials. Materials include wood, gourd, paper, bark, and barkcloth. Letter grading.", 
        "prerequisiteDescription": "courses 232, 238, 262", 
        "prerequisites": [], 
        "title": "Conservation Laboratory: Organic Materials III", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CAEM 251": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "Seminar, two hours. Designed for graduate conservation students. Seminar series of invited international experts in archaeological and ethnographic conservation, who address contemporary issues in conservation of cultural materials. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Contemporary Development in Conservation", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CAEM 260": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "Lecture, three hours. General introduction to different types of ancient ceramic and glass materials. Relationship between composition (chemistry), structure (crystals, molecular arrangement, and microstructure), and properties of ceramics, glass, glazes. Nature of frit and faience deterioration explained using basic concepts from physics and chemistry. Chemical, optical, and structural properties. Deterioration phenomena, defects, and products of alteration of ceramics and vitreous artifacts. Hands-on examination of variety of samples and artifacts. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Structure, Properties, and Deterioration of Materials: Ceramics, Glass, Glazes", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "CAEM 261": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "Lecture, three hours. Introduction to igneous, sedimentary, and metamorphic rocks (geological context, mineralogical composition, macrostructure, and microstructure). Clay minerals: composition, structure, and properties. Rocks and stone: geographical distribution and occurrence, and usage by ancient cultures. Adobe: clay-based manmade materials. Mechanical and petrophysical properties of stone and adobe. Relationships between composition/structure and properties. Intrinsic and structural stability, resistance to weathering. Deterioration mechanisms and factors (physical, chemical, and biochemical). Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Structure, Properties, and Deterioration of Materials: Stone and Adobe", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "CAEM 262": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "Lecture, one hour; laboratory, one hour. General introduction to different types of organic materials used to produce ethnographic and archaeological cultural heritage. Relationship between material composition, processing, and properties of natural and manufactured materials using basic concepts from biology and chemistry. Structural stability and deterioration phenomena of these materials as found in cultural collections. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Structure, Properties, and Deterioration of Materials: Organics I", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "CAEM 263": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "Lecture, three hours. General introduction to different types of ancient and ethnographic metals. Relationship between composition (chemistry), structure (crystals, molecular arrangement, and microstructure), and properties of metals explained using basic concepts from physics and chemistry. Chemical, optical, and structural properties. Deterioration phenomena, defects, and products of alteration of metallic artifacts. Hands-on examination of variety of samples and artifacts. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Structure, Properties, and Deterioration of Materials: Metals", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "CAEM 265": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "Lecture, one hour; laboratory, one hour. General introduction to plant-based organic materials used to produce ethnographic and archaeological cultural heritage: wood, bark, paper, bast fibers, grasses. Relationship between materials, processing, and properties of natural materials using basic concepts from biology and chemistry. Structural stability and deterioration phenomena of these materials as found in cultural collections. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Structure, Properties, and Deterioration of Materials: Organics II", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "CAEM 288": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "Lecture, three hours; laboratory, one hour. Special topics on theoretical and practical subjects in conservation such as focused materials studies, new conservation approaches, advanced scientific applications, or current special work by core program faculty or visiting scholars. If appropriate, field trips may be arranged. May be repeated for credit with topic or instructor change. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Topics in Conservation", 
        "unit": "2 or 4", 
        "unitType": "RANGE"
    }, 
    "CAEM 290": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "Fieldwork, 20 or 40 hours. Open only to Conservation M.A. program graduate students who have completed first year of conservation program coursework.Supervised conservation-related professional and research-based training in field through participation in field projects (i.e., archaeological excavation, site management, indigenous site preservation and consultation), as well as in museum, library, archive, and collections conservation and science departments, regional and national laboratories, or at other similar venues. All intern placements must be preapproved by program and developed in collaboration between student, faculty members, and host institution/agency. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Conservation Program Internship", 
        "unit": "6 or 12", 
        "unitType": "RANGE"
    }, 
    "CAEM 596": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "Tutorial, seven hours. Limited to graduate conservation students. Individual guided studies that may include conservation research and/or surveys or treatment projects carried out at Villa laboratories or at local collection or analytical facility. To be arranged with program faculty members, and supervision may be shared between faculty members and outside specialists. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Directed Individual Studies", 
        "unit": "2 to 6", 
        "unitType": "RANGE"
    }, 
    "CAEM 598": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "Tutorial, two hours; laboratory, one hour. Development of research paper on conservation topic or treatment-based investigation that can be theoretical in scope or practically oriented. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "M.A", 
        "unit": "2 to 12", 
        "unitType": "RANGE"
    }, 
    "CAEM 99": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Student Research Program", 
        "unit": "1 to 2", 
        "unitType": "RANGE"
    }, 
    "CAEM C120": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "Laboratory, four hours. Overview of risks (direct and indirect) and materials vulnerability of in situ cultural heritage and movable archaeological materials in emergency situations (rescue excavations, disasters, conflicts), with emphasis on readiness, first aid response, and recovery. Readiness focuses on preparedness and preventive measures, including reburials, shelters, rescue excavations, and documentation as well as developing inventories and awareness campaigns. First aid response covers development of on-site emergency risk assessments to evaluate damage and putting triage theory into practice, salvage rescue operations, emergency temporary in situ stabilization and protection (using locally available materials), and training. Recovery is based on documentation, lifting methods, handling, transportation, and storage. Emphasis on finding practical solutions to prevent and mitigate damage and to recover and safeguard archaeological artifacts. Concurrently scheduled with course C220. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Field Methods in Archaeological Conservation: Readiness, Response, and Recovery", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CAEM C142": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "Lecture, two hours; activity, two hours. How conservators work together with curators, collections managers, mount makers, designers, and registrars to permit collections to be both accessed and preserved. Concurrently scheduled with course C242. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Managing Collections for Museums, Libraries, and Archives", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CAEM C220": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "Laboratory, four hours. Overview of risks (direct and indirect) and materials vulnerability of in situ cultural heritage and movable archaeological materials in emergency situations (rescue excavations, disasters, conflicts), with emphasis on readiness, first aid response, and recovery. Readiness focuses on preparedness and preventive measures, including reburials, shelters, rescue excavations, and documentation as well as developing inventories and awareness campaigns. First aid response covers development of on-site emergency risk assessments to evaluate damage and putting triage theory into practice, salvage rescue operations, emergency temporary in situ stabilization and protection (using locally available materials), and training. Recovery is based on documentation, lifting methods, handling, transportation, and storage. Emphasis on finding practical solutions to prevent and mitigate damage and to recover and safeguard archaeological artifacts. Concurrently scheduled with course C120. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Field Methods in Archaeological Conservation: Readiness, Response, and Recovery", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CAEM C242": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "Lecture, two hours; activity, two hours. Designed for graduate conservation students. How conservators work together with curators, collections managers, mount makers, designers, and registrars to permit collections to be both accessed and preserved. Concurrently scheduled with course C142. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Managing Collections for Museums, Libraries, and Archives", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CAEM M210": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "(Same as Materials Science CM212.) Lecture, four hours. Preparation: general chemistry, inorganic and organic chemistry, materials science. Principles and methods of materials characterization in conservation: optical and electron microscopy, X-ray and electron spectroscopy, X-ray diffraction, infrared spectroscopy, reflectance spectroscopy and multispectral imaging spectroscopy, chromatography, design of archaeological and ethnographic materials characterization procedures. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Cultural Materials Science II: Characterization Methods in Conservation of Materials", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CAEM M210L": {
        "corequisiteDescription": "course M210 (or MAT SCI C112 or CM212)", 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "(Formerly numbered 210L.) (Same as Materials Science M213L.) Laboratory, four hours. Requisites: course M215 (or M216) and one course from 260 through M264. Corequisite: course M210 (or Materials Science C112 or CM212). Research-based laboratory through object-based problem-solving approach in conservation materials science. Experimental techniques, characterization, and analysis of archaeological and ethnographic materials (using materials science principles and reverse engineering processes) to determine technological features, defects, and products of alteration. Hands-on experience with noninvasive imaging and spectroscopic techniques, sampling and sample preparation methods, analysis of microsamples. Letter grading.", 
        "prerequisiteDescription": "course M215 (or M216) and one course from 260 through M264", 
        "prerequisites": [], 
        "title": "Cultural Materials Science Laboratory: Technical Study (Effective Spring 2018 )", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CAEM M215": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "(Formerly numbered 215.) (Same as Materials Science M213.) Lecture, two hours; laboratory, two hours. Basic and advanced techniques on digital photography, computer-aided recording tools, and scientific imaging to determine and document condition (defects) and technological features of archaeological and ethnographic materials. Development of basic theoretical knowledge on imaging and photonics technology and practical skills on conservation photo-documentation, analytical (forensic) photography, and advanced new imaging technologies. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Cultural Materials Science I: Analytical Imaging and Documentation in Conservation of Materials", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CAEM M216": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "(Same as Materials Science M216.) Lecture, two hours; laboratory, two hours. Recommended requisite: laboratory safety fundamental concepts course by Office of Environment, Health, and Safety. Introduction to physical, chemical, and mechanical properties of conservation materials (employed for preservation of archaeological and cultural materials) and their aging characteristics. Science and application methods of traditional organic and inorganic systems and introduction of novel technology based on biomineralization processes and nanostructured materials. Letter grading.", 
        "prerequisiteDescription": "laboratory safety fundamental concepts course by Office of Environment, Health, and Safety", 
        "prerequisites": [], 
        "title": "Science of Conservation Materials and Methods I", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CAEM M240": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "(Same as Information Studies M238.) Lecture, two hours; laboratory, two hours. Requisite: Information Studies 432. Required of graduate conservation students. Review of environmental and biological agents of deterioration, including light, temperature, relative humidity, pollution, insects, and fungi. Emphasis on monitoring to identify agents and understanding of materials sensitivities, along with protective measures for collections. Letter grading.", 
        "prerequisiteDescription": "Information Studies 432", 
        "prerequisites": [], 
        "title": "Environmental Protection of Collections for Museums, Libraries, and Archives", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CAEM M250": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "(Same as Materials Science M215.) Laboratory, four hours. Requisites: courses M210 (or M216 or Materials Science C112), 210L, M264. Recommended: course M215. Research-based laboratory on conservation of rock art, wall paintings (archaeological and modern composites on cements), mosaics, and decorated architectural surfaces. Experimental techniques and analysis of materials (using materials science and reverse engineering processes) for characterization of technology, constituent materials, and alteration products; development of conservation treatment proposals, testing of conservation products, and methods and conservation treatment. Letter grading.", 
        "prerequisiteDescription": "courses M210 (or M216 or MAT SCI C112), 210L, M264", 
        "prerequisites": [], 
        "title": "Conservation Laboratory: Rock Art, Wall Paintings, and Mosaics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "CAEM M264": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "CAEM", 
        "departmentFullName": "Conservation of Archaeological and Ethnographic Materials", 
        "description": "(Formerly numbered 264.) (Same as Materials Science M214.) Lecture, three hours. Recommended preparation: basic knowledge of general chemistry and materials science. Introduction to materials and techniques of rock art, wall paintings (including painted surfaces on cement and composite decorative architectural surfaces), and mosaics. Archaeological and ethnographic context, techniques, and materials. Pigments, colorants, and binding media. Chemical, optical, and structural properties. Relationship between composition (chemistry), structure (crystals, molecular arrangement, and microstructure), and properties explained using basic concepts from physics and chemistry. Intrinsic attributes and resistance to weathering. Causes, sources, and mechanisms of deterioration (physical, chemical, and biochemical). Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Structure, Properties, and Deterioration of Materials: Rock Art, Wall Paintings, Mosaics", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }
}