{
    "DENT 19": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "DENT", 
        "departmentFullName": "Dentistry", 
        "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Fiat Lux Freshman Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "DENT 199": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "DENT", 
        "departmentFullName": "Dentistry", 
        "description": "Tutorial, to be arranged. Studies in dentistry and related subject areas appropriate for training of particular students, with required reading assignments or laboratory work leading to final oral or written examination. May be repeated for maximum of 16 units. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Individual Special Studies", 
        "unit": "2 to 8", 
        "unitType": "RANGE"
    }, 
    "DENT 199H": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "DENT", 
        "departmentFullName": "Dentistry", 
        "description": "Tutorial, to be arranged. Studies in dentistry and related subject areas appropriate for training of particular students, with required paper submitted at end of course in addition to final examination (paper to be of publication quality as judged by course mentor). May be taken for maximum of 8 units. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Individual Special Studies (Honors)", 
        "unit": "2 to 8", 
        "unitType": "RANGE"
    }, 
    "DENT 441C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "DENT", 
        "departmentFullName": "Dentistry", 
        "description": "Lecture, two hours. Description and analysis of American dental care system from historical, ethical, and legal perspectives. Assessment of how dentistry fits within general provision of healthcare services in America, with comparisons to dental care provisions in other countries. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Healthcare", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "DENT 99": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "DENT", 
        "departmentFullName": "Dentistry", 
        "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Student Research Program", 
        "unit": "1 to 2", 
        "unitType": "RANGE"
    }, 
    "DENT M300A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "DENT", 
        "departmentFullName": "Dentistry", 
        "description": "(Same as Community Health Sciences M245A, Education M217G, Law M281A, Medicine M290A, Nursing M290A, and Social Welfare M203F.) Lecture, two hours. Course M300A is requisite to M300B, which is requisite to M300C. Intensive interdisciplinary study of child physical and sexual abuse and neglect, with lectures by faculty members of Schools of Dentistry, Law, Medicine, Nursing, and Public Health and Departments of Education and Psychology, as well as by relevant public agencies. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Child Abuse and Neglect", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "DENT M300B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "DENT", 
        "departmentFullName": "Dentistry", 
        "description": "(Same as Community Health Sciences M245B, Education M217H, Law M281A-M281B, Medicine M290A-M290B, Nursing M290B, and Social Welfare M203G.) Lecture, two hours. Requisite: course M300A. Intensive interdisciplinary study of child physical and sexual abuse and neglect, with lectures by faculty members of Schools of Dentistry, Law, Medicine, Nursing, and Public Health and Departments of Education and Psychology, as well as by relevant public agencies. Letter grading.", 
        "prerequisiteDescription": "course M300A", 
        "prerequisites": [
            [
                "DENT M300A"
            ]
        ], 
        "title": "Child Abuse and Neglect", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "DENT M300C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "DENT", 
        "departmentFullName": "Dentistry", 
        "description": "(Same as Community Health Sciences M245C, Education M217I, Law M281B, Medicine M290B, Nursing M290C, and Social Welfare M203H.) Lecture, two hours. Requisite: course M300B. Intensive interdisciplinary study of child physical and sexual abuse and neglect, with lectures by faculty members of Schools of Dentistry, Law, Medicine, Nursing, and Public Health and Departments of Education and Psychology, as well as by relevant public agencies. Letter grading.", 
        "prerequisiteDescription": "course M300B", 
        "prerequisites": [
            [
                "DENT M300B"
            ]
        ], 
        "title": "Child Abuse and Neglect", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }
}