{
    "DGT HUM 101": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "DGT HUM", 
        "departmentFullName": "Digital Humanities", 
        "description": "Lecture, four hours; discussion, one hour. Foundation course for students in Digital Humanities minor, providing theoretical and conceptual framework for understanding genesis of digital world. Use of contemporary cultural-historical methodology to focus on rise of new media and information technologies in 19th, 20th, and 21st centuries, such as photography, film, radio, television, Internet, and World Wide Web and their impact on how individuals, groups, and cultures experienced their worlds. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Digital Humanities", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "DGT HUM 150": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "DGT HUM", 
        "departmentFullName": "Digital Humanities", 
        "description": "Seminar, three hours. Requisite: course 101. Introduction to advanced research methods or thematic issues in digital humanities such as database and visualization technologies, social media technologies, application programming interfaces, and digital mapping to acquire familiarity with particular set of technologies by learning practical research methods and theoretical issues to carry out advanced research in this area. Consult \"Schedule of Classes\" for topics to be offered in specific term. May be repeated for credit with topic change. Letter grading.", 
        "prerequisiteDescription": "course 101", 
        "prerequisites": [
            [
                "DGT HUM 101"
            ]
        ], 
        "title": "Advanced Topics in Digital Humanities", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "DGT HUM 151": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "DGT HUM", 
        "departmentFullName": "Digital Humanities", 
        "description": "Seminar, three hours. Introduction to advanced research topics in urban humanities. Looking at specific subject matters related to notion of spatial equity in context of Los Angeles, exploration of how certain spatial technologies such as geographic information systems (GIS) cartography, mobile telephony, real-time data collection, social media, digital databases, and interactive web platforms can be deployed to research and document urban experience. Familiarization with digital tools used to study urban issues, from affordable housing to access to public space and employment, to civic participation. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Topics in Urban Humanities", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "DGT HUM 189": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "DGT HUM", 
        "departmentFullName": "Digital Humanities", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "DGT HUM 189HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "DGT HUM", 
        "departmentFullName": "Digital Humanities", 
        "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Contracts", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "DGT HUM 19": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "DGT HUM", 
        "departmentFullName": "Digital Humanities", 
        "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Fiat Lux Freshman Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "DGT HUM 194": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "DGT HUM", 
        "departmentFullName": "Digital Humanities", 
        "description": "Seminar, two hours. Requisites: course 101, completion of two other minor courses. May be taken concurrently with course 195 or 196. Designed for undergraduate students who are part of research group. Discussion of research methods, tools, and current literature in field or of research of faculty members and students. May be repeated for credit. P/NP or letter grading.", 
        "prerequisiteDescription": "course 101, completion of two other minor courses", 
        "prerequisites": [], 
        "title": "Research Group Seminars: Digital Humanities", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "DGT HUM 195": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "DGT HUM", 
        "departmentFullName": "Digital Humanities", 
        "description": "Tutorial, two hours; fieldwork, eight hours. Limited to juniors/seniors. May be taken concurrently with course 194. Internship in supervised setting in community agency or business. Placements to be arranged by instructor. Students meet on regular basis with instructor and provide periodic reports of their experience. May be repeated for credit. Individual contract with supervising faculty member required. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Community or Corporate Internships in Digital Humanities", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "DGT HUM 196": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "DGT HUM", 
        "departmentFullName": "Digital Humanities", 
        "description": "Tutorial, three hours per week per unit. Limited to juniors/seniors. Entry-level research apprenticeship for upper division students under guidance of faculty mentor. May be repeated for credit. Individual contract required. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Research Apprenticeship in Digital Humanities", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "DGT HUM 198": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "DGT HUM", 
        "departmentFullName": "Digital Humanities", 
        "description": "Tutorial, one hour. Requisite: course 194. Limited to juniors/seniors. Development and completion of significant research project under direct supervision of faculty member. May be repeated for credit. Individual contract required. Letter grading.", 
        "prerequisiteDescription": "course 194", 
        "prerequisites": [
            [
                "DGT HUM 194"
            ]
        ], 
        "title": "Honors Research in Digital Humanities", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "DGT HUM 199": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "DGT HUM", 
        "departmentFullName": "Digital Humanities", 
        "description": "Tutorial, one hour. Requisite: course 194. Limited to juniors/seniors. Supervised individual research or investigation under guidance of faculty mentor. Culminating paper or project required. May be repeated for credit. Individual contract required. Letter grading.", 
        "prerequisiteDescription": "course 194", 
        "prerequisites": [
            [
                "DGT HUM 194"
            ]
        ], 
        "title": "Directed Research in Digital Humanities (Effective Spring 2018 )", 
        "unit": "2 to 4", 
        "unitType": "RANGE"
    }, 
    "DGT HUM 201": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "DGT HUM", 
        "departmentFullName": "Digital Humanities", 
        "description": "Seminar, three hours; laboratory, one hour. Introduction to field of digital humanities. Historical overview of field from its beginning in post-World War II era to present, highlighting major intellectual problems, disciplinary paradigms, and institutional challenges that are posed by digital humanities. Examination of major epistemological, methodological, technological, and institutional challenges posed by digital humanities through number of specific projects that address fundamental problems in creating, interpreting, preserving, and transmitting human cultural record. How digital technologies and tools, ranging from map visualizations and modeling environments to database structures and interface design, are arguments that make certain assumptions about, and even transform, objects of study. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Digital Humanities", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "DGT HUM 250": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "DGT HUM", 
        "departmentFullName": "Digital Humanities", 
        "description": "Seminar, three hours. Enforced requisite: course 201. Introduction to advanced research method or thematic issue in digital humanities, such as digital textual analysis, digital mapping database and visualization technologies, or social media technologies. Acquisition of familiarity with particular set of technologies by learning practical research methods and theoretical issues to carry out advanced research in this area. Examination of critiques of theoretical underpinnings of such technologies and issues that they raise. May be repeated for credit with topic change. Letter grading.", 
        "prerequisiteDescription": "course 201", 
        "prerequisites": [
            [
                "DGT HUM 201"
            ]
        ], 
        "title": "Special Topics in Digital Humanities", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "DGT HUM 299": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "DGT HUM", 
        "departmentFullName": "Digital Humanities", 
        "description": "Tutorial, one hour. Enforced requisite: course 201. Limited to and required of graduate students in Digital Humanities Graduate Certificate Program. Supervised research and investigation under guidance of faculty mentor. Culminating project required. May be repeated for maximum of 12 units. Letter grading.", 
        "prerequisiteDescription": "course 201", 
        "prerequisites": [
            [
                "DGT HUM 201"
            ]
        ], 
        "title": "Special Projects in Digital Humanities", 
        "unit": "2 to 4", 
        "unitType": "RANGE"
    }, 
    "DGT HUM 30": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "DGT HUM", 
        "departmentFullName": "Digital Humanities", 
        "description": "Lecture, two and one half hours; studio, two hours. Investigation of spatial justice and injustice in multi-ethnic city of Los Angeles through Lens of three thematic technologies that built and transformed Los Angeles into global metropolis: cars and highways, networking technologies culminating in Internet and World Wide Web, and film and broadcast media. Use of innovative forms of investigation and communication, from digital mapping to video-sensing, to integrate interpretative and historical approaches of humanities with material and projective practices of design. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Los Angeles Tech City: Digital Technologies and Spatial Justice", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "DGT HUM 596": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "DGT HUM", 
        "departmentFullName": "Digital Humanities", 
        "description": "Tutorial, three hours. To be arranged with faculty member who directs study or research. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Directed Individual Study or Research", 
        "unit": "2 to 12", 
        "unitType": "RANGE"
    }, 
    "DGT HUM 89": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "DGT HUM", 
        "departmentFullName": "Digital Humanities", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "DGT HUM 89HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "DGT HUM", 
        "departmentFullName": "Digital Humanities", 
        "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Contracts", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "DGT HUM 99": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "DGT HUM", 
        "departmentFullName": "Digital Humanities", 
        "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Student Research Program", 
        "unit": "1 to 2", 
        "unitType": "RANGE"
    }
}