{
    "ESL 103": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "(Formerly numbered 38B.) Lecture, four hours. Emphasis on accurate articulation of sounds, word stress, rhythm, linking between syllables, intonation, and other features of fluent spoken English, using variety of videorecorded models and online pronunciation resources. Individualized feedback provided through frequent recording assignments. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Pronunciation for Multilingual Students", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 104": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "(Formerly numbered 34.) Lecture, four hours. Emphasis on making presentations in academic and professional settings, interacting with audience members, leading group discussions, and preparing for job interviews. Videorecording of student performances to allow students to improve through self and peer evaluation, as well as through individualized instructor feedback. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Public Speaking for Multilingual Students", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 105": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "(Formerly numbered 37.) Lecture, four hours. Review of form and use of common grammatical structures found in academic discourse. Analysis of stylistic function of certain structures and practice in self-editing strategies. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Grammar and Style for Multilingual Students", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 106": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "Lecture, four hours. Requisite: satisfaction of English as a Second Language requirement. Writing of texts that are rhetorically appropriate for discipline-specific audiences. Extensive revising of papers to allow writers to edit their texts for grammatical appropriateness and for clear and coherent style. Focus on language and writing issues of concern to multilingual writers. P/NP or letter grading.", 
        "prerequisiteDescription": "satisfaction of English as a Second Language requirement", 
        "prerequisites": [], 
        "title": "Workshop in Disciplinary Writing for Multilingual Students", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 107": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "Lecture, four hours. Instruction in and practice of academic reading skills using authentic university texts. Focus on improving reading rate and comprehension, expanding academic vocabulary, and developing critical reading skills. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Academic Reading and Vocabulary for Multilingual Students", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 109": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "Lecture, four hours. Requisite: satisfaction of English as a Second Language requirement. Introduction to effective approaches to appreciating and analyzing variety of literature written in English. Review of literary techniques and terms to deepen understanding of poetry, short stories, and novels. Focus on author styles and grammatical and vocabulary choices. P/NP or letter grading.", 
        "prerequisiteDescription": "satisfaction of English as a Second Language requirement", 
        "prerequisites": [], 
        "title": "Literature and Language for Multilingual Students", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 189": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 189HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Contracts", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 19": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Fiat Lux Freshman Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 197": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "Tutorial, four hours. Limited to juniors/seniors. Individual intensive study for undergraduate and graduate students who desire more advanced or specialized treatment of issues in English as second language beyond those covered in current course offerings. Scheduled meetings to be arranged between faculty member and student. Assigned reading and tangible evidence of mastery of subject matter required. May be repeated for credit. Individual contract required; see academic coordinator. P/NP (undergraduates), S/U (graduates), or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Individual Studies in English as a Second Language", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 20": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "(Formerly numbered 32.) Lecture, four hours. Emphasis on speaking fluently in English by examining rules of conversation, participating actively in class discussions, making group presentations, and completing out-of-class assignments designed to promote interaction with native speakers and familiarize international students with UCLA campus and local community. Offered in summer only. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Conversation and Fluency", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 21": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "Lecture, four hours. Designed to improve clarity, accuracy, and understanding of spoken English through study and practice of pronunciation features as they occur in real speech, using models from television, movies, and online talks. Emphasis on individualized feedback through audiorecording and videorecording technology. Offered in summer only. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Pronunciation", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 22": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "Lecture, four hours. Emphasis on making presentations, interacting with audience members, and leading group discussions. Videorecording of student performances to allow students to improve through self and peer evaluation, as well as through individualized instructor feedback. Offered in summer only. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Public Speaking", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 23": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "Lecture, four hours. Designed to improve listening comprehension and discussion skills by viewing and analyzing variety of American films. Emphasis on understanding and using idiomatic language, expanding vocabulary, recognizing dialect differences, and reflecting on cultural similarities and differences. Offered in summer only. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "American Culture through Film", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 24": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "Lecture, four hours. Designed for international students planning to study at American universities. Students research suitable undergraduate or graduate programs, interview advisers at local universities, and learn to write effective personal statements. Additional focus on academic reading, vocabulary, and speaking skills. Offered in summer only. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Preparation for American Universities", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 25": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "Lecture, four hours. Designed to improve reading speed, comprehension, and knowledge of academic writing conventions. Emphasis on synthesizing information from sources, providing proper citations, and avoiding plagiarism. Focus on development of ability to revise and edit one's own writing. Offered in summer only. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Academic Reading and Writing", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 26": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "Lecture, four hours. Emphasis on giving business and marketing-focused presentations (both individual and group), handling audience questions, and running effective meetings. Videorecording of student performances to allow students to improve through self-evaluation, as well as through individualized instructor feedback. Offered in summer only. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Business Communication: Speaking", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 27": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "Lecture, four hours. Emphasis on writing persuasive texts for diverse business audiences. Topics include writing effective summaries and reports, researching companies, and developing professional online profile. Offered in summer only. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Business Communication: Writing", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 28": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "Lecture, four hours. Survey of selective language structures through their occurrence within contemporary cultural and societal topics within thematic, content-based English language learning environment. Focus on understanding and applying these structures to improve fluency while enhancing critical thinking skills. Meaningful discussions in conjunction with salient written/spoke assignments that situate language within authentic contexts. Topics may include gender, sexuality, politics, humor, intercultural communication, media, environmental issues, and local/regional identities. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "English through Language, Culture, and Society", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 300": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "(Formerly numbered 200.) Lecture, five hours. Enforced requisite: proficiency demonstrated on English as a Second Language Placement Examination. Development of academic reading, writing, and language skills with focus on reading comprehension, vocabulary development, and analysis of discipline-specific research articles, with additional work on fundamental composition techniques, grammar, and editing. S/U or letter grading.", 
        "prerequisiteDescription": "proficiency demonstrated on English as a Second Language Placement Examination", 
        "prerequisites": [], 
        "title": "Intermediate Writing and Communication for International Graduate Students", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 301": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "(Formerly numbered 201.) Lecture, five hours. Enforced requisite: course 300 or proficiency demonstrated on English as a Second Language Placement Examination. Development of academic writing skills with focus on reading comprehension, vocabulary development, and composition techniques, with additional work on grammar and editing. S/U or letter grading.", 
        "prerequisiteDescription": "course 300 or proficiency demonstrated on English as a Second Language Placement Examination", 
        "prerequisites": [], 
        "title": "High-Intermediate Writing and Communication for International Graduate Students", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 302": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "Lecture, five hours. Requisite: course 301 or proficiency demonstrated on English as a Second Language Placement Examination. Writing and revision of papers for academic work or publication in student fields of study. Emphasis on rhetorical strategies as well as stylistic and organizational conventions for presenting research-based arguments in disciplines including humanities, social sciences, and pure and applied sciences. Focus on grammar structures and vocabulary that contribute to clear and coherent writing style. S/U or letter grading.", 
        "prerequisiteDescription": "course 301 or proficiency demonstrated on English as a Second Language Placement Examination", 
        "prerequisites": [], 
        "title": "Advanced Writing Workshop for International Graduate Students", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 310": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "(Formerly numbered 210.) Lecture, five hours. Satisfies Test of Oral Proficiency (TOP) requirement for international graduate students who have received marginal pass on TOP. Focus on accurate articulation of sounds, word stress, linking, and other features of fluent spoken English, using authentic models of classroom language. Additional emphasis on comprehending typical undergraduate speech. Frequent audiorecordings and videorecordings provide opportunity for self-review and individualized instructor feedback. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Pronunciation for International Teaching Assistants", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 311": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "(Formerly numbered 211.) Lecture, five hours. Satisfies Test of Oral Proficiency (TOP) requirement for international graduate students who received marginal pass on TOP. Focus on stress, rhythm, and intonation of fluent spoken English using videos and transcripts of actual teaching assistants. Communication patterns include introducing syllabus, explaining visuals, handling questions, and interacting in office hours. Microteaching performances videorecorded for self, peer, and instructor evaluation. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Classroom Communication for International Teaching Assistants I", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 312": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "(Formerly numbered 212.) Lecture, five hours. Satisfies Test of Oral Proficiency (TOP) requirement for international graduate students who received marginal pass on TOP. Course 311 is not requisite to 312. Focus on stress, rhythm, and intonation of fluent spoken English using videos and transcripts of actual teaching assistants. Communication patterns include building rapport, giving instructions, handling questions, encouraging participation, and organizing lessons. Microteaching performances videorecorded for self, peer, and instructor evaluation. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Classroom Communication for International Teaching Assistants II", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 313": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "(Formerly numbered 213.) Lecture, five hours. Satisfies Test of Oral Proficiency (TOP) requirement for international graduate students who received marginal pass on TOP. Focus on communicating effectively as teaching assistants through interactive teaching demonstrations and student-led discussions of topics from one's own field. Emphasis on presenting academic subject matter in well-organized, interactive, and accessible way. Student performances videorecorded for extensive self, peer, and instructor evaluation. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Presentation and Discussion-Leading Skills for International Teaching Assistants", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 89": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 89HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Contracts", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 97A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "Lecture, four hours. Specialized topics in English as second language or English for academic purposes. Emphasis varies according to topics covered and/or audience to whom course is directed. May be repeated for credit with topic change. Offered in summer only. P/NP (undergraduates), S/U (graduates), or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Variable Topics in English as a Second Language", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 97B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "Lecture, two hours. Enforced requisite: course 33B or proficiency demonstrated on English as a Second Language Placement Examination. Specialized topics in English as second language or English for academic purposes. Emphasis varies according to topics covered and/or audience to whom course is directed. May be repeated for credit with topic change. P/NP (undergraduates) or S/U (graduates) grading.", 
        "prerequisiteDescription": "course 33B or proficiency demonstrated on English as a Second Language Placement Examination", 
        "prerequisites": [], 
        "title": "Variable Topics in English as a Second Language", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ESL 99": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ESL", 
        "departmentFullName": "English as A Second Language", 
        "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Student Research Program", 
        "unit": "1 to 2", 
        "unitType": "RANGE"
    }
}