{
    "ENGR 102": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, four hours; outside study, eight hours. Requisites: course M101, Life Sciences 3. Introduction to current progress in engineering to integrate biosciences and nanosciences into synthetic systems, where biological components are reengineered and rewired to perform desirable functions in both intracellular and cell-free environments. Discussion of basic technologies and systems analysis that deal with dynamic behavior, noise, and uncertainties. Design project in which students are challenged to design novel biosystems and nanosystems for nontrivial task required. Letter grading.", 
        "prerequisiteDescription": "course M101, LIFESCI 3", 
        "prerequisites": [], 
        "title": "Synthetic Biosystems and Nanosystems Design", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 10A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, four hours; outside study, eight hours. How macroscopic patterns emerge dynamically from local interactions of large number of interdependent (often heterogeneous) entities, without global design or central control. Such emergent order, whose explanation cannot be reduced to explanations at level of individual entities, is ubiquitous in biology and human social collectives, but also exists in certain physical processes such as earthquakes and some chemical reactions. Complexity also deals with how such systems undergo sudden changes, including catastrophic breakdowns, in absence of external force or central influence. Key aspect of biological and social collectives is their nature as complex adaptive systems, where individuals and groups adjust their behavior to external conditions. In biological and social systems, complexity science goes beyond traditional mathematics and statistics in its use of multiagent computational models that better capture these complex, adaptive, and self-organizing phenomena. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Complex Systems Science", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 110": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Fundamental principles of micro-level (individual, firm, and industry) and macro-level (government, international) economics as they relate to technology management. How individuals, firms, and governments impact successful commercialization of high technology products and services. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Technology Management and Economics for Engineers", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 111": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Critical components of finance and marketing research and practice as they impact management of technology commercialization. Internal (within firm) and external (in marketplace) marketing and financing of high-technology innovation. Concepts include present value, future value, discounted cash flow, internal rate of return, return on assets, return on equity, return on investment, interest rates, cost of capital, and product, price, positioning, and promotion. Use of market research, segmentation, and forecasting in management of technological innovation. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Finance and Marketing for Engineers", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 112": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Critical components of entrepreneurship, finance, marketing, human resources, and accounting disciplines as they impact management of technology commercialization. Topics include intellectual property management, team building, market forecasting, and entrepreneurial finance. Students work in small teams studying technology management plans to bring new technologies to market. Students select from set of available technology concepts, many generated at UCLA, that are in need of plans for movement from laboratory to market. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Laboratory to Market, Entrepreneurship for Engineers", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 113": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Designed for juniors/seniors. Introduction to current management concept of product development. Topics include product strategy, product platform, and product lines; competitive strategy, vectors of differentiation, product pricing, first-to-market versus fast-follower; growth strategy, growth through acquisition, and new ventures; product portfolio management. Case studies, class projects, group discussions, and guest lectures by speakers from industry. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Product Strategy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 116": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, four hours; outside study, eight hours. Management as well as engineering decisions nearly always take place in environment characterized by uncertainty. Probability provides mathematical framework for understanding how to make rational decisions when outcomes of actions are uncertain. Application of probability to problem of reasoning from sample data, encompassing estimation, hypothesis testing, and regression analysis. Discussion of specific analytical techniques needed in later courses in program. Development of basic understanding of statistical analysis. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Statistics for Management Decisions", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 120": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Seminar, two hours; outside study, four hours. Designed for seniors and graduate students. Identification of business opportunities and outline of basic requisites for viable business plans, followed by specific topics related to securing basic assets and resources needed to execute those plans. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Entrepreneurship for Scientists and Engineers", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 180": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Designed for junior/senior engineering majors. Holistic view of engineering discipline, covering lifecycle of engineering, processes, and techniques used in industry today. Multidisciplinary systems engineering perspective in which aspects of electrical, mechanical, material, and software engineering are incorporated. Three specific case studies in communication, sensor, and processing systems included to help students understand these concepts. Special attention paid to link material covered to engineering curriculum offered by UCLA to help students integrate and enhance their understanding of knowledge already acquired. Motivation of students to continue their learning and reinforce lifelong learning habits. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Engineering of Complex Systems", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 181EW": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, five hours; discussion, three hours; outside study, four hours. Requisite: English Composition 3. Not open for credit to students with credit for course 182EW, 183EW, or 185EW. Focuses on changing nature of technology and complex ethical issues that emerge as result in areas such as biotechnology, information technology, nanotechnology, and energy technology. Discussion of nature of these issues; their ethical, legal, and social ramifications; and what society values in relation to these issues. Exploration of philosophy, religion, and natural and social sciences in relation to these issues. Emphasis on research and writing within engineering environments. Writing and revision of about 20 pages total, including two individual technical essays and one team-written research report. Readings address technical issues and writing form. Satisfies engineering writing requirement. Letter grading.", 
        "prerequisiteDescription": "English Composition 3", 
        "prerequisites": [], 
        "title": "Ethics and Impact of Technology on Society", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 182EW": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, four hours; discussion, three hours; outside study, five hours. Requisite: English Composition 3, Electrical and Computer Engineering 131A or Statistics 100A or consent of instructor. Not open for credit to students with credit for course 182EW, 183EW, or 185EW. Places engineering in broader societal context through examination of some of key ethical, legal, and regulatory issues and frameworks relevant to design and deployment of emerging technology products and services. Historical examination of ethical and legal frameworks generally and in relation to technology. Exploration of series of specific contemporary technology-related topics to examine their broader ramifications. Topics include driverless cars, algorithms and artificial intelligence, global supply chain for engineering products, cryptocurrencies and blockchain, net neutrality, and impact of technology on employment. Offers students tools enabling them to think more proactively and holistically about ethical and societal dimensions of their work as technology creators. Satisfies engineering writing requirement. Letter grading.", 
        "prerequisiteDescription": "English Composition 3, Electrical and Computer Engineering 131A or STATS 100A or consent of instructor", 
        "prerequisites": [], 
        "title": "Technology and Society", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 183EW": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, four hours; discussion, three hours; outside study, five hours. Enforced requisite: English Composition 3 or 3H or English as a Second Language 36. Not open for credit to students with credit for course 185EW. Limited to sophomore/junior/senior engineering students. Professional and ethical considerations in practice of engineering. Impact of technology on society and on development of moral and ethical values. Contemporary environmental, biological, legal, and other issues created by new technologies. Emphasis on research and writing within engineering environments. Writing and revision of about 20 pages total, including two individual technical essays and one team-written research report. Readings address technical issues and writing form. Satisfies engineering writing requirement. Letter grading.", 
        "prerequisiteDescription": "English Composition 3 or 3H or English as a Second Language 36", 
        "prerequisites": [], 
        "title": "Engineering and Society", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 185EW": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, four hours; discussion, three hours; outside study, five hours. Enforced requisite: English Composition 3 or 3H or English as a Second Language 36. Not open for credit to students with credit for course 183EW. Designed for junior/senior engineering students. Nontechnical skills and experiences necessary for engineering career success. Importance of group dynamics in engineering practice. Teamwork and effective group skills in engineering environments. Organization and control of multidisciplinary complex engineering projects. Forms of leadership and qualities and characteristics of effective leaders. How engineering, computer sciences, and technology relate to major ethical and social issues. Societal demands on practice of engineering. Emphasis on research and writing in engineering environments. Satisfies engineering writing requirement. Letter grading.", 
        "prerequisiteDescription": "English Composition 3 or 3H or English as a Second Language 36", 
        "prerequisites": [], 
        "title": "Art of Engineering Endeavors", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 188": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Seminar, four hours; outside study, eight hours. Special topics in engineering for undergraduate students taught on experimental or temporary basis, such as those taught by resident and visiting faculty members. May be repeated for credit with topic or instructor change. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Courses in Engineering", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 19": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Fiat Lux Freshman Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 192": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Seminar, two hours; outside study, four hours. Principles and practical techniques for instruction of hands-on engineering design projects in high school outreach programs. Curriculum planning, project preparation, classroom management, team collaboration, diversity awareness, fostering of group cohesion, and emergency procedures. Preparation of lessons and project for summer outreach program, with practice presentations. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Fundamentals of Engineering Mentorship", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 195": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Tutorial, two to four hours. Limited to juniors/seniors. Internship studies course supervised by associate dean or designated faculty members. Further supervision to be provided by organization for which students are doing internship. Students may be required to meet on regular basis with instructor and provide periodic reports of their experience. May not be applied toward major requirements. May be repeated for credit. Individual contract with associate dean required. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Internship Studies in Engineering", 
        "unit": "2 to 4", 
        "unitType": "RANGE"
    }, 
    "ENGR 199": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Tutorial, to be arranged. Limited to juniors/seniors. Supervised individual research or investigation under guidance of faculty mentor. Culminating paper or project required. May be repeated for credit with school approval. Individual contract required; enrollment petitions available in Office of Academic and Student Affairs. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Directed Research in Engineering", 
        "unit": "2 to 8", 
        "unitType": "RANGE"
    }, 
    "ENGR 20": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Seminar, 32 hours. Designed primarily for new students to help them understand UCLA, its culture, structure, and academic policies and to facilitate their transition from high school to college. Examination of research on first-year experience of college students, studying at UCLA versus high school, policies and procedures, and campus resources. Advanced preparation and early exposure to Fall Quarter mathematics, chemistry, and computer science curricula. Collaborative learning techniques and community-building activities are integral processes to both day and evening programs. Intensive classroom instruction and collaborative learning workshops. Offered in summer only. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "First-Year Engineering Transition Bridge", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 200": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, four hours; outside study, eight hours. Designed for graduate students. Practical review of necessary processes and procedures to successfully manage technology programs. Review of fundamentals of program planning, organizational structure, implementation, and performance tracking methods to provide program manager with necessary information to support decision-making process that provides high-quality products on time and within budget. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Program Management Principles for Engineers and Professionals", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 201": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, four hours; outside study, eight hours. Designed for graduate students. Practical review of major elements of system engineering process. Coverage of key elements: system requirements and flow down, product development cycle, functional analysis, system synthesis and trade studies, budget allocations, risk management metrics, review and audit activities and documentation. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Systems Engineering", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 202": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, four hours; outside study, eight hours. Requisite: course 201. Designed for graduate students with one to two years work experience. Integrated logistic support (ILS) is major driver of system life-cycle cost and one key element of system engineering activities. Overview of engineering disciplines critical to this function -- reliability, maintainability, and supportability -- and their relationships, taught using probability theory. Topics also include fault detections and isolations and parts obsolescence. Discussion of 6-sigma process, one effective design and manufacturing methodology, to ensure system reliability, maintainability, and supportability. Letter grading.", 
        "prerequisiteDescription": "course 201", 
        "prerequisites": [
            [
                "ENGR 201"
            ]
        ], 
        "title": "Reliability, Maintainability, and Supportability", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 203": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, four hours; outside study, eight hours. Requisite: course 201. Designed for graduate students with B.S. degrees in engineering or science and one to two years work experience in selected domain. Art and science of architecting. Introduction to architecting methodology -- paradigm and tools. Principles of architecting through analysis of architecture designs of major existing systems. Discussion of selected elements of architectural practices, such as representation models, design progression, and architecture frameworks. Examination of professionalization of system architecting. Letter grading.", 
        "prerequisiteDescription": "course 201", 
        "prerequisites": [
            [
                "ENGR 201"
            ]
        ], 
        "title": "System Architecture", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 204": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, four hours; outside study, eight hours. Trust is placed in information systems to behave properly, but cyber threats and breaches have become routine, including penetration of financial, medical, government, and national security systems. To build systems that can protect confidentiality, integrity, and availability involves more than composing systems from network security, computer security, data security, cryptography, etc. One can use most secure components, and resulting system could still be vulnerable. Skills learned ensure that systems are architected, designed, implemented, tested, and operated for specific levels of trust. Aspects include assessing vulnerability and risk for systems, establishing protection principles, and using them as guide to formulate system architectures; translating architecture into system design and verifying correctness of design; and constructing and following trusted development and implementation process. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Trusted Systems Engineering", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 205": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, four hours; outside study, eight hours. Model-based systems engineering (MBSE) and systems modeling language (SysML) taught through lectures and readings, individual projects, and one group project. Lectures and readings to provide students with conceptual framework and vocabulary. Individual projects enable students to develop basic skills for creating SysML requirements and structural and behavioral diagrams. In group project students learn how to package, compartmentalize, and integrate smaller efforts while being constrained to meet schedules. Industry-recognized credentials may be obtained, as course covers Object Management Group (OMG) Certified Systems Modeling Professional (OCSMP) tests, such as Model User and Model Builder Fundamentals and Model Builder Intermediate. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Model-Based Systems Engineering", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 206": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, four hours; outside study, eight hours. Recommended requisites: course 204, Computer Science 236. Systems are constructed to perform complex functions and services. How to understand needs of users, analysis of requirements and derived requirements, creation of various system architecture products, and design and integration of various components into systems that perform these functions and services. System assurance addresses confidence that systems meet specified operational requirements based on evidence provided by applying assurance techniques. Introduction, investigation, and analysis of framework of assurance to accomplish total system assurance. Development of secure, reliable, and dependable systems that range from commercial realm such as air traffic control, Supervisory Control and Data Acquisition (SCADA), and autonomous vehicles to military realm such as command, control, communication, intelligence, and cyber. Letter grading.", 
        "prerequisiteDescription": "course 204, COM SCI 236", 
        "prerequisites": [], 
        "title": "Engineering for Systems Assurance", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 21": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Seminar, 32 hours. Designed primarily for new students to help them understand UCLA, its culture, structure, and academic policies and to facilitate their transition from high school to college. Examination of research on first-year experience of college students, studying at UCLA versus high school, policies and procedures, and campus resources. Designed to immerse incoming computing students in foundation concepts and principles of computer science. with focus on fundamental computer programming principles, methodologies, and techniques. Basic concepts of programming and C++ computing language. Offered in summer only. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Computing Immersion Summer Experience", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 210": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, four hours; outside study, eight hours. Introduction to strategic and operating issues and decisions involved in managing enterprises. Operational processes use organization's resources to transform inputs into goods and utilizes them to provide service, or does both. Conceptual framework and set of analytical tools provided to enable students to better understand why processes behave as they do. Given this understanding, students are able to involve themselves in organization's defining strategic decisions, those related to key processes affecting organizational unit's performance. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Operations and Supply Chain Management", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 211": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, four hours; outside study, eight hours. Introduction to concepts reflecting material generally covered in certain M.B.A. core and elective courses. Integration of both theory -- to introduce essential conceptual building blocks in accounting and finance -- and empirical practice -- to emphasize how these theories are actually implemented in real world. Cases, comprehensive problems, and recent events presented to provide students with as much hands-on experience in applying material presented as possible. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Financial Management", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 212": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, four hours; outside study, eight hours. Prior knowledge of legal doctrines or materials not required. Intellectual property law is not just topic for lawyers. Engineers who have design responsibilities must understand how legal system in some instances protects their designs and in other instances stands as obstacle to what would otherwise be most efficient design choice. Engineers with management responsibilities must understand intellectual property law implications for everything from pricing to strategic partnerships. Examination of intellectual property law, not only by learning fundamental rules associated with patent, copyright, trademark, and trade secret protection, but by studying business strategies that these rules support. Examples and case studies to be taken from across content, technology, and pharmaceutical industries. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Intellectual Property Law and Strategy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 213": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, four hours; outside study, eight hours. Coverage of wide variety of spreadsheet models that can be used to solve business and engineering problems, with emphasis on mastery of Excel spreadsheet modeling as integral part of analytic decision making. Managerial models include data modeling, regression and forecasting, linear programming, network and distribution models, integer programming, nonlinear programming, and Monte Carlo simulation. Problems from operations, finance, and marketing taught by spreadsheet examples and describe general managerial situations from various industries and disciplines. Development of spreadsheet models to facilitate decision making. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Data and Business Analytics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 214": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, four hours. Exploration of knowledge, attributes, skills, and strategies necessary to succeed communicatively in workplace, with focus on business presentation skills, visual and verbal persuasion skills, and interpersonal communication skills. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Management Communication", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 215": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, four hours; outside study, eight hours. Limited to graduate engineering students. Topics in starting and developing high-tech enterprises and intended for students who wish to complement their technical education with introduction to entrepreneurship. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Entrepreneurship for Engineers", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 22": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Seminar, 32 hours. Designed primarily for new students to help them understand UCLA, its culture, structure, and academic policies and to facilitate their transition from high school to college. Examination of research on first-year experience of college students, studying at UCLA versus high school, policies and procedures, and campus resources. Intensive introduction of advanced topics covered in upper division engineering courses. Offered in summer only. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Summer Bridge Review for Enhancing Engineering Students", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 299": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Activity, 10 hours. Preparation: completion of minimum of four 200-level courses in online M.S. program. Project course that satisfies UCLA final comprehensive examination requirement of M.S. online degree in Engineering. Project is completed under individual guidance from UCLA Engineering faculty member and incorporates advanced knowledge learned in M.S. program of study. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Capstone Project", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 375": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Seminar, to be arranged. Preparation: apprentice personnel employment as teaching assistant, associate, or fellow. Teaching apprenticeship under active guidance and supervision of regular faculty member responsible for curriculum and instruction at UCLA. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Teaching Apprentice Practicum", 
        "unit": "1 to 4", 
        "unitType": "RANGE"
    }, 
    "ENGR 470A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, three hours; outside study, six hours. Limited to Engineering Executive Program students. Theory and application of quantitative methods in analysis and synthesis of engineering systems for purpose of making management decisions. Optimization of outputs with respect to dollar costs, time, material, energy, information, and manpower. Case studies and individual projects. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Engineer in Technical Environment", 
        "unit": 3, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 470B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, three hours; outside study, six hours. Limited to Engineering Executive Program students. Theory and application of quantitative methods in analysis and synthesis of engineering systems for purpose of making management decisions. Optimization of outputs with respect to dollar costs, time, material, energy, information, and manpower. Case studies and individual projects. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Engineer in Technical Environment", 
        "unit": 3, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 470C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, three hours; outside study, six hours. Limited to Engineering Executive Program students. Theory and application of quantitative methods in analysis and synthesis of engineering systems for purpose of making management decisions. Optimization of outputs with respect to dollar costs, time, material, energy, information, and manpower. Case studies and individual projects. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Engineer in Technical Environment", 
        "unit": 3, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 470D": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, three hours; outside study, six hours. Limited to Engineering Executive Program students. Theory and application of quantitative methods in analysis and synthesis of engineering systems for purpose of making management decisions. Optimization of outputs with respect to dollar costs, time, material, energy, information, and manpower. Case studies and individual projects. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Engineer in Technical Environment", 
        "unit": 3, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 471A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, three hours. Limited to Engineering Executive Program students. Influences of human relations, laws, social sciences, humanities, and fine arts on development and utilization of natural and human resources. Interaction of technology and society past, present, and future. Change agents and resistance to change. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Engineer in General Environment", 
        "unit": 3, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 471B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, three hours. Limited to Engineering Executive Program students. Influences of human relations, laws, social sciences, humanities, and fine arts on development and utilization of natural and human resources. Interaction of technology and society past, present, and future. Change agents and resistance to change. In Progress grading (credit to be given only on completion of course 471C).", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Engineer in General Environment", 
        "unit": 3, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 471C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, 90 minutes. Limited to Engineering Executive Program students. Influences of human relations, laws, social sciences, humanities, and fine arts on development and utilization of natural and human resources. Interaction of technology and society past, present, and future. Change agents and resistance to change. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Engineer in General Environment", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 472A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, three hours. Limited to Engineering Executive Program students. Language of business for engineering executive. Accounting, finance, business economics, business law, and marketing. Laboratory in organization and management problem solving. Analysis of actual business problems of firm, community, and nation, provided through cooperation and participation with California business corporations and government agencies. In Progress grading (credit to be given on completion of course 472B).", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Engineer in Business Environment", 
        "unit": 3, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 472B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, three hours. Limited to Engineering Executive Program students. Language of business for engineering executive. Accounting, finance, business economics, business law, and marketing. Laboratory in organization and management problem solving. Analysis of actual business problems of firm, community, and nation, provided through cooperation and participation with California business corporations and government agencies. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Engineer in Business Environment", 
        "unit": 3, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 472C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, three hours. Limited to Engineering Executive Program students. Language of business for engineering executive. Accounting, finance, business economics, business law, and marketing. Laboratory in organization and management problem solving. Analysis of actual business problems of firm, community, and nation, provided through cooperation and participation with California business corporations and government agencies. In Progress grading (credit to be given on completion of course 472D).", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Engineer in Business Environment", 
        "unit": 3, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 472D": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, 90 minutes. Limited to Engineering Executive Program students. Language of business for engineering executive. Accounting, finance, business economics, business law, and marketing. Laboratory in organization and management problem solving. Analysis of actual business problems of firm, community, and nation, provided through cooperation and participation with California business corporations and government agencies. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Engineer in Business Environment", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 473A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, two and one half hours; outside study, six hours. Limited to students in Engineering Executive Program. Problem area of modern industry or government is selected as class project, and its solution is synthesized using quantitative tools and methods. Project also serves as laboratory in organization for goal-oriented technical group. In Progress grading (credit to be given only on completion of course 473B).", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Analysis and Synthesis of Large-Scale System", 
        "unit": 3, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 473B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, two and one half hours; outside study, six hours. Limited to students in Engineering Executive Program. Problem area of modern industry or government is selected as class project, and its solution is synthesized using quantitative tools and methods. Project also serves as laboratory in organization for goal-oriented technical group. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Analysis and Synthesis of Large-Scale System", 
        "unit": 3, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 495A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Seminar, four hours; outside study, eight hours. Preparation: appointment as teaching assistant. Limited to graduate engineering students. Seminar on communication of engineering principles, concepts, and methods, preparation, organization of material, presentation, use of visual aids, grading, advising, and rapport with students. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Teaching Assistant Training Seminar", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 501": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Tutorial, to be arranged. Preparation: consent of UCLA graduate adviser and graduate dean, and host campus instructor, department chair, and graduate dean. Used to record enrollment of UCLA students in courses taken under cooperative arrangements with USC. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Cooperative Program", 
        "unit": "2 to 8", 
        "unitType": "RANGE"
    }, 
    "ENGR 87": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, four hours; discussion, four hours; outside study, four hours. Introduction to engineering as professional opportunity for freshman students by exploring difference between engineering disciplines and functions engineers perform. Development of skills and techniques for academic excellence through team process. Investigation of national need underlying current effort to increase participation of historically underrepresented groups in U.S. technological work force. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Engineering Disciplines", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 95": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Tutorial, two to four hours. Limited to freshmen/sophomores. Internship studies course supervised by associate dean or designated faculty members. Further supervision to be provided by organization for which students are doing internship. Students may be required to meet on regular basis with instructor and provide periodic reports of their experience. May not be applied toward major requirements. May be repeated for credit. Individual contract with associate dean required. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Internship Studies in Engineering", 
        "unit": "2 to 4", 
        "unitType": "RANGE"
    }, 
    "ENGR 96A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "(Formerly numbered 96.) Lecture, one hour; laboratory, one hour; outside study, four hours. Introduction to engineering design while building teamwork and communication skills and examination of engineering majors offered at UCLA and of engineering careers. Completion of hands-on engineering design projects, preparation of short report describing projects, and presentation of results. Specific project details and relevant majors explored vary with instructor. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Engineering Design", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 96B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, one hour; laboratory, one hour; outside study, four hours. Recommended for undergraduate Aerospace Engineering, Bioengineering, Computer Science, Electrical Engineering, and Mechanical Engineering majors. Introduction to engineering design while building teamwork and communication skills and examination of engineering majors offered at UCLA and of engineering careers. Hands-on experience with state-of-art solid-state imaging devices. How to focus, expose, record, and manipulate telescopic images. Development of photographic technology from early chemical experiments to wide spread use of cell phone camera. Completion of hands-on engineering design projects, preparation of short report describing projects, and presentation of results. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Engineering Design: Digital Imaging", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 96C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Lecture, one hour; laboratory, one hour; outside study, four hours. Recommended for undergraduate Aerospace Engineering, Bioengineering, Computer Science, Electrical Engineering, and Mechanical Engineering majors. Introduction to engineering design while building teamwork and communication skills and examination of engineering majors offered at UCLA and of engineering careers. Hands-on experience with state-of-art Internet of things (IoT) technology to offer students opportunity to rapidly develop innovative and inspiring systems that provide ideal introduction to computing systems and IoT applications specific to their major field. IoT technology has become one of most important advances in technology history with applications ranging from wearable devices for healthcare to residential monitoring systems, natural resource protection and management, intelligent vehicles and transportation systems, robotics systems, and energy conservation. Completion of hands-on engineering design projects, preparation of short report describing projects, and presentation of results. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Engineering Design: Internet of Things", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR 99": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Student Research Program", 
        "unit": "1 to 2", 
        "unitType": "RANGE"
    }, 
    "ENGR M101": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "(Same as Materials Science M105.) Lecture, four hours; discussion, one hour; outside study, seven hours. Enforced requisites: Chemistry 20A, 20B, Physics 1C. Introduction to underlying science encompassing structure, properties, and fabrication of technologically important nanoscale systems. New phenomena that emerge in very small systems (typically with feature sizes below few hundred nanometers) explained using basic concepts from physics and chemistry. Chemical, optical, and electronic properties, electron transport, structural stability, self-assembly, templated assembly and applications of various nanostructures such as quantum dots, nanoparticles, quantum wires, quantum wells and multilayers, carbon nanotubes. Letter grading.", 
        "prerequisiteDescription": "CHEM 20A, 20B, PHYSICS 1C", 
        "prerequisites": [], 
        "title": "Principles of Nanoscience and Nanotechnology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR M103": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "(Same as Civil Engineering M165.) Lecture, four hours; discussion, two hours; outside study, six hours. Recommended requisite: course M101. Introduction to potential implications of nanotechnology to environmental systems as well as potential application of nanotechnology to environmental protection. Technical contents include three multidisciplinary areas: (1) physical, chemical, and biological properties of nanomaterials, (2) transport, reactivity, and toxicity of nanoscale materials in natural environmental systems, and (3) use of nanotechnology for energy and water production, plus environmental protection, monitoring, and remediation. Letter grading.", 
        "prerequisiteDescription": "course M101", 
        "prerequisites": [
            [
                "ENGR M101"
            ]
        ], 
        "title": "Environmental Nanotechnology: Implications and Applications", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR M495I": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "(Formerly numbered M495B.) (Same as English Composition M495I.) Seminar, two hours; outside study, four hours. Limited to graduate students. Required of all teaching assistants for Engineering writing courses not exempt by appropriate departmental or program training. Training and mentoring, with focus on composition pedagogy, assessment of student writing, guidance of revision process, and specialized writing problems that may occur in engineering writing contexts. Practical concerns of preparing students to write course assignments, marking and grading essays, and conducting peer reviews and conferences. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Teaching Preparation Seminar: Writing for Engineers", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ENGR M495J": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENGR", 
        "departmentFullName": "Engineering", 
        "description": "(Formerly numbered M495C.) (Same as English Composition M495J.) Seminar, one hour; outside study, five hours. Enforced requisite: course M495I. Required of all teaching assistants in their initial term of teaching Engineering writing courses. Mentoring in group and individual meetings. Continued focus on composition pedagogy, assessment of student writing, guidance of revision process, and specialized writing problems that may occur in engineering writing contexts. Practical concerns of preparing students to write course assignments, marking and grading essays, and conducting peer reviews and conferences. S/U grading.", 
        "prerequisiteDescription": "course M495I", 
        "prerequisites": [
            [
                "ENGR M495I"
            ]
        ], 
        "title": "Supervised Teaching of Writing for Engineers", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }
}