{
    "ENVIRON 12": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Lecture, three hours; discussion, one hour. Introduction to sustainability with emphasis on environmental component, including Earth's physical, chemical, and biological processes as related to resource demands and management. Examination of application of scientific method in helping to understand and solve sustainability problems. Case studies illustrating how natural and social scientists work on environmental sustainability issues. Focus on global climate change, biodiversity, pollution, and water and energy resources presented in context of creating sustainable human society that is environmentally sound, economically viable, and socially just and equitable. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sustainability and Environment", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 121": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Lecture, three hours; discussion, two hours. Not open for credit to students with credit for Ecology and Evolutionary Biology 116. Examination of interrelation of natural biotic and human systems. Description of distribution of biodiversity and natural processes that maintain it. Critical analysis of various levels of threats and multidimensional challenges required for mitigating threats. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Conservation of Biodiversity", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 134": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "(Formerly numbered M134.) Lecture, three hours. Requisite: Statistics 12 or 13. Examination of challenges of balancing environmental protection with wants and needs of people in economy. Focus on how to design efficient public policies that meet environmental goals. How to quantify cause-and-effect relationships, for example, between pollution and infant mortality, using non-experimental data. P/NP or letter grading.", 
        "prerequisiteDescription": "STATS 12 or 13", 
        "prerequisites": [], 
        "title": "Environmental Economics with Data Analysis", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 150": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Lecture, three hours. Introduction to environmental journalism, science communications, and new media, including weekly guest lectures by prominent successful practitioners in wide variety of media. Focus on technologies, methods, genres, and theories of communicating environmental challenges, exploring solutions, and engaging public in newspapers, television, radio, movies, online, on mobile devices, and through social media. Discussion of possibilities and limitations of different media and importance of communications for environmental science, policy, public understanding, and individual decision making. Production by students of environmental communications in variety of media. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Environmental Journalism, Science Communications, and New Media", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 157": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Lecture, three hours. Requisites: Mathematics 3A and 3B (or 31A and 31B), Physics 1A and 1B (or 6A and 6B). Introduction to basic energy concepts and examination of role of various energy sources, energy conversion technologies, and energy policies in modern life. Analysis of implications of current patterns of energy production and consumption for future economic and environmental well-being. Integration of concepts and methods from physical and life sciences, engineering, environmental science, economics, and public policy. Basic quantitative skills provided to analyze and critique technical, economic, and policy choices to address challenge of balancing economic growth and environmental sustainability. P/NP or letter grading.", 
        "prerequisiteDescription": "MATH 3A and 3B (or 31A and 31B), PHYSICS 1A and 1B (or 6A and 6B)", 
        "prerequisites": [], 
        "title": "Energy, Environment, and Development", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 159": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Lecture, three hours. Requisites: Mathematics 3A and 3B (or 31A and 31B). Public discourse about current patterns of production and consumption of energy, and goods and services more broadly, suggest such patterns are environmentally and economically unsustainable. Introduction to basic concept of life-cycle analysis (LCA), including analytical frameworks and quantitative techniques for systematically and holistically evaluating environmental trade-offs presented by different alternatives. Focus on methodology of LCA to compute various material inputs and environmental releases from all activities associated with life cycle (i.e., raw material extraction, processing, end use, and disposal) of products or services. Discussion of strengths and limitations of LCA as tool for decision making. Students perform life-cycle analysis of one technology, product, or service of their choice. P/NP or letter grading.", 
        "prerequisiteDescription": "MATH 3A and 3B (or 31A and 31B)", 
        "prerequisites": [], 
        "title": "Life Cycle Assessment", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 160": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Seminar, three hours. Requisite: Statistics 12 or 13. Examination of intersection of environmental economics and policy, with focus on testing policy-relevant environmental hypotheses using economics research approach. Invited scholars present research aimed at yielding policy-relevant results on various topics such as climate change, pollution, and transportation. P/NP or letter grading.", 
        "prerequisiteDescription": "STATS 12 or 13", 
        "prerequisites": [], 
        "title": "Topics in Environmental Economics and Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 162": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Lecture, three hours; discussion, one hour. Focus on key entrepreneurial and financial concepts, with emphasis on applications that are vital for implementing environmental solutions in private, public, and nonprofit settings. Topics include basic elements of finance, project evaluation, financial planning, and marketing. Development of entrepreneurial skills to recognize opportunity and transfer ideas into viable projects that are better for environment and that benefit people and communities. Case studies used to equip students with tools necessary to successfully execute environmental goals and objectives. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Entrepreneurship and Finance for Environmental Scientists", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 163": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Lecture, three hours. Examination of role of business in mitigating environmental degradation and incentives to be more environmentally responsive. Emphasis on corporate strategies that deliver value to shareholders while responding to environmental concerns. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Business and Natural Environment", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 166": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Lecture, three hours; discussion, one hour. Limited to juniors/seniors. Examination of water quality and water supply issues, including interactions between scientific, technological, management, and policy issues. Invited experts, scholars, and practitioners discuss relevant issues such as pollution, climate change, and water infrastructure. Emphasis on solutions involving integrated water supply and wastewater systems. Leadership development through writing instruction and negotiations and media training. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Leadership in Water Management", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 170": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Seminar, 90 minutes; one field trip. Limited to undergraduate students. Study of current topics in environmental science, including participation in weekly colloquium series and field trips. May be repeated for credit. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Environmental Science Colloquium", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 180A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Lecture, three hours; discussion, two hours. Enforced requisite: Statistics 12 or 13. Limited to Environmental Science majors who have completed 40 or more units of preparation for major courses, including statistics, and 12 or more units of upper division courses toward major or minor requirements. Examination of case studies and presentation of tools and methodologies in environmental science, building on what students have been exposed to in other courses. Letter grading.", 
        "prerequisiteDescription": "STATS 12 or 13", 
        "prerequisites": [], 
        "title": "Practicum in Environmental Science", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 180B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Lecture, one hour; laboratory, five hours. Requisite: course 180A. Course 180B is requisite to 180C. Limited to junior/senior Environmental Science majors. Investigation of various aspects of one environmental case study representing actual multidisciplinary issue. Particular emphasis on developing skills required for working as professionals in this field. Work may involve site investigations, original data collection and analysis, mapping and geographic information systems, and environmental policy and law issues. Case study to be defined and conducted with collaboration of local agency or nonprofit institution. Letter grading.", 
        "prerequisiteDescription": "course 180A", 
        "prerequisites": [
            [
                "ENVIRON 180A"
            ]
        ], 
        "title": "Practicum in Environmental Science", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 180C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Lecture, one hour; laboratory, five hours. Requisite: course 180B. Limited to junior/senior Environmental Science majors. Investigation of various aspects of one environmental case study representing actual multidisciplinary issue. Particular emphasis on developing skills required for working as professionals in this field. Work may involve site investigations, original data collection and analysis, mapping and geographic information systems, and environmental policy and law issues. Case study to be defined and conducted with collaboration of local agency or nonprofit institution. Letter grading.", 
        "prerequisiteDescription": "course 180B", 
        "prerequisites": [
            [
                "ENVIRON 180B"
            ]
        ], 
        "title": "Practicum in Environmental Science", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 185A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Lecture, two hours. Analysis of principles of sustainability through series of lectures and films by world-renowned faculty members, authors, environmentalists, entrepreneurs, policymakers, and progressive thinkers. May be repeated for credit. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sustainability Talks", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 185B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Lecture, two hours; fieldwork, four hours. Investigation of issues of campus sustainability, including energy efficiency, transportation, waste stream management, sustainable food practices, and more by student research to generate coalition of student researchers that, together with faculty members and UCLA staff, strive to make UCLA more sustainable community. May be repeated for credit. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sustainability Action Research", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 185C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Seminar, two hours; fieldwork, six hours. Students lead research teams to investigate issues of campus sustainability, including energy efficiency, transportation, waste stream management, sustainable food practices, and more to generate coalition of student researchers that, together with faculty members and UCLA staff, strive to make UCLA more sustainable community. May be repeated for credit. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sustainability Action Research Leaders", 
        "unit": 3, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 186": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Fieldwork, four hours. Guided fieldwork and comparative analysis used to assess local sustainability practices and policies in diverse regional or international settings. Emphasis on comparing role of local and regional culture. geography, economic climate, and governmental policies on sustainability awareness and practices. Use of observations, interviews, and unobtrusive measures to document and analyze role and influence of local/global context on sustainability behavior of individuals, small businesses, and other institutions in everyday life. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Comparative Sustainability Practices in Local/Global Settings", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 188A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Lecture, three hours; discussion, one hour (when scheduled). Departmentally sponsored experimental or temporary courses, such as those taught by visiting faculty members. May be repeated for credit with topic change. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Courses in Environment", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 188B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Lecture, two hours. Departmentally sponsored experimental or temporary courses, such as those taught by visiting faculty members. May be repeated for credit with topic change. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Courses in Environment", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 188SA": {
        "corequisiteDescription": "HNRS 101E", 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Individual Studies for USIE Facilitators", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 188SB": {
        "corequisiteDescription": "HNRS 101E", 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.", 
        "prerequisiteDescription": "course 188SA", 
        "prerequisites": [
            [
                "ENVIRON 188SA"
            ]
        ], 
        "title": "Individual Studies for USIE Facilitators", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 188SC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.", 
        "prerequisiteDescription": "course 188SB", 
        "prerequisites": [
            [
                "ENVIRON 188SB"
            ]
        ], 
        "title": "Individual Studies for USIE Facilitators", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 189": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 189HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Contracts", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 19": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Fiat Lux Freshman Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 193": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Seminar, one hour. Limited to undergraduate students. Discussion of readings selected from current literature of field. May be repeated for credit. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Journal Club Seminars: Environment", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 195": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Tutorial, to be arranged. Preparation: 3.0 grade-point average in major. Limited to junior/senior majors. Internship in supervised setting in community agency or business related to environmental science and/or sustainability. Students meet on regular basis with faculty supervisor and provide periodic reports of their experience. May be repeated for maximum of 8 units. Individual contract with supervising faculty member required; consult undergraduate adviser. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Community or Corporate Internships in Environmental Science", 
        "unit": "2 or 4", 
        "unitType": "RANGE"
    }, 
    "ENVIRON 198": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Tutorial, four hours. Limited to junior/senior Environmental Science majors. Development and completion of honors thesis or comprehensive research project under direct supervision of faculty member. Must be taken for at least two terms and for total of at least 8 units. May be repeated for credit. Individual contract required. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Research in Environmental Science", 
        "unit": "2 to 4", 
        "unitType": "RANGE"
    }, 
    "ENVIRON 199": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Tutorial, two hours. Preparation: submission of written proposal outlining study or research to be undertaken. Limited to juniors/seniors. Supervised individual research or investigation under guidance of faculty mentor. Progress report must be submitted to faculty mentor at end of term. Culminating paper or project required. May be repeated for credit, but only 4 units may be taken each term. Individual contract required. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Directed Research in Environment", 
        "unit": "2 to 4", 
        "unitType": "RANGE"
    }, 
    "ENVIRON 25": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Lecture, three hours; discussion, one hour. Good food is healthy, sustainably produced, and culturally meaningful. Introduction to basic concepts and history of food systems, food science and nutrition, fair and sustainable food production, natural resources and environmental issues including climate change and biodiversity, agriculture and food policy and law, food distribution and access, cultural identity and artistic engagements with food. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Good Food for Everyone: Health, Sustainability, and Culture", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 250": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Lecture, three hours. Recommended preparation: introductory course in industrial ecology, ecological economics, environmental economics, business and management, or public policy analysis. Public discourse about implications of current patterns of production and consumption of energy and various goods and services suggests such patterns are unsustainable. What is meant by sustainability and how is it quantified? Focus on concepts and tools to assess sustainability at micro-level of individuals, products, or firms using various techniques, including lifecycle assessment, input-output analysis, and cost-benefit analysis. Exploration of sustainability at macro-level for one entire economy or nation. Discussion of usefulness and limitations of various metrics as guide for public and private decision making. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Tools for Sustainability Assessment", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 260": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Seminar, three hours. Interdisciplinary research seminar to bring sound social sciences methods to latest technology developments to design effective information-based solutions to social problems. Topics include selection and framing of research questions, developing measurements, designing appropriate methods (e.g., surveys, experiments, using available data), ethical issues, and writing up research proposals. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Information, Technology, Business, and Society", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 277": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Lecture, three hours. Common course for all students participating in Leaders in Sustainability Program, including those from engineering, law, management, public affairs, public health, natural and social sciences, and others. Creation of environment for academically based discussions on various sustainability-related themes, capitalizing on wide mix of disciplines represented among participating students. Sessions feature UCLA faculty members, external speakers, and leadership skills to help students learn more about how to best put their interests in sustainability to use. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Leaders in Sustainability", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 297A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Seminar, four hours. Advanced study and analysis of variable current topics in environment and sustainability. Consult \"Schedule of Classes\" for topics and instructors. May be repeated for credit with consent of instructor. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Topics in Environment and Sustainability", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 297B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Seminar, two hours. Advanced study and analysis of variable current topics in environment and sustainability. Consult \"Schedule of Classes\" for topics and instructors. May be repeated for credit with consent of instructor. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Topics in Environment and Sustainability", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 375": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Seminar, to be arranged. Preparation: apprentice personnel employment as teaching assistant, associate, or fellow. Teaching apprenticeship under active guidance and supervision of regular faculty member responsible for curriculum and instruction at UCLA. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Teaching Apprentice Practicum", 
        "unit": "1 to 4", 
        "unitType": "RANGE"
    }, 
    "ENVIRON 400": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Seminar, eight hours. Primarily designed for environmental science and engineering doctoral students. Multidisciplinary technical and socioeconomic analysis and prognosis of significant current environmental problems. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Environmental Science and Engineering Problems Course", 
        "unit": 8, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 501": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Tutorial, to be arranged. Preparation: consent of UCLA graduate adviser and graduate dean, and host campus instructor, department chair, and graduate dean. Used to record enrollment of UCLA students in courses taken under cooperative arrangements with USC. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Cooperative Program", 
        "unit": "2 to 8", 
        "unitType": "RANGE"
    }, 
    "ENVIRON 596": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Tutorial, to be arranged. Supervised investigation of advanced environmental problems. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Directed Individual or Tutorial Studies", 
        "unit": "2 to 8", 
        "unitType": "RANGE"
    }, 
    "ENVIRON 599": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Tutorial, to be arranged. Limited to students who have advanced to doctoral candidacy. May not be applied toward any degree course requirements. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Doctoral Dissertation Research", 
        "unit": "2 to 12", 
        "unitType": "RANGE"
    }, 
    "ENVIRON 88S": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Seminar, one hour. Exploration of issues and solutions of different topics, and how daily actions can have significant local, regional, and global impacts. Topics include our climate reality, water, energy, waste, chemicals, transportation, shopping, food, and well-being. Students learn how they can reduce their negative impact on environment through behavioral assessments, do-it-yourself projects, collaborative activities, discussions, and more. P/NP grading. Facilitated by Mark Biedlingmaier, with Carl A. Maida as faculty mentor.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Applied Sustainable Living", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 89": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 89HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Contracts", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON 99": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Student Research Program", 
        "unit": "1 to 2", 
        "unitType": "RANGE"
    }, 
    "ENVIRON M10": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "(Same as Atmospheric and Oceanic Sciences M10.) Lecture, three hours; laboratory, one hour. Limited to undergraduate students. Introduction to environmental science as discipline and as way of thinking. Discussion of critical environmental issues at local and global scales. Fundamentals of physical, chemical, and biological processes important to environmental science. Laboratory exercises to augment lectures. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Environmental Science", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON M109": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "(Same as Geography M109.) Lecture, three hours; reading period, one hour. Designed for juniors/seniors. Examination of history, mechanisms, and consequences of interactions between humans and environment. Exploration in depth of three thematic topics (deforestation, desertification, and greenhouse gas increase and ozone depletion) and four major subjects (soil, biodiversity, water, and landforms). P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Human Impact on Biophysical Environment: What Science Has Learned", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON M111": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "(Same as Atmospheric and Oceanic Sciences M100.) Lecture, three hours. Overview of Earth as system of distinct, yet intimately related, physical and biological elements. Origins and characteristics of atmosphere, oceans, and land masses. Survey of history of Earth and of life on Earth, particularly in relation to evolution of physical world. Consideration of possibility of technological solutions to global environmental problems using knowledge gained during course. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Earth and Its Environment", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON M114": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "(Same as Geography M107.) Lecture, three hours; discussion, one hour. Enforced requisite: Geography 1 or 2 or Life Sciences 1 or 3. Designed for juniors/seniors. Systematic study of processes of and hazards posed by erosion, sedimentation, development, and pollution and techniques needed to conserve soil and maintain environmental quality. Scope includes agriculture, forestry, mining, and other rural uses of land. P/NP or letter grading.", 
        "prerequisiteDescription": "Geography 1 or 2 or LIFESCI 1 or 3", 
        "prerequisites": [], 
        "title": "Soil and Water Conservation", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON M127": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "(Same as Ecology and Evolutionary Biology M127 and Geography M127.) Lecture, three hours; discussion, one hour; field trips. General treatment of soils and environmental implications: soil development, morphology, and worldwide distribution of soil orders; physical, chemical, hydrologic, and biological properties; water use, erosion, and pollution; management of soils as related to plant growth and distribution. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Soils and Environment", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON M127L": {
        "corequisiteDescription": "course M127", 
        "corequisites": [
            [
                "ENVIRON M127"
            ]
        ], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "(Same as Ecology and Evolutionary Biology M127L and Geography M127L.) Laboratory, one hour; field excursions. Corequisite: course M127. Investigations and demonstrations supporting material in course M127, including excavating, describing, and naming soils in field, soil forming processes, geomorphology, and soils. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Soils and Environment: Field", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON M130": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "(Same as Geography M131.) Lecture, three hours; reading period, one hour. Designed for juniors/seniors. Examination of natural forces producing environmental changes over past two million years. How present landscape reflects past conditions. Effects of environmental change on people. Increasing importance of human activity in environmental modification. Focus on impact of natural and anthropogenic changes on forests. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Environmental Change", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON M132": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "(Same as Geography M115 and Urban Planning M165.) Lecture, three hours; discussion, one hour. Exploration of history and origin of major environmental ideas, movements or countermovements they spawned, and new and changing nature of modern environmentalism. Introduction to early ideas of environment, how rise of modern sciences reshaped environmental thought, and how this was later transformed by 19th-century ideas and rise of American conservation movements. Review of politics of American environmental thought and contemporary environmental questions as they relate to broader set of questions about nature of development, sustainability, and equity in environmental debate. Exploration of issues in broad context, including global climate change, rise of pandemics, deforestation, and environmental justice impacts of war. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Environmentalism: Past, Present, and Future", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON M133": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "(Same as Society and Genetics M133 and Sociology M115.) Lecture, three hours; discussion, one hour. Relationship between society and environment. Analysis in detail of interrelations between social factors (such as class, race, gender, and religion) and environmental factors (such as pollution, waste disposal, sustainability, and global warming). P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Environmental Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON M134": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "(Same as Economics M134.) Lecture, three hours. Requisites: Economics 41 or Statistics 12 or 13, and Economics 101 (may be waived with consent of instructor). Introduction to major ideas in natural resources and environmental economics, with emphasis on designing incentives to protect environment. Highlights important role of using empirical data to test hypotheses about pollution's causes and consequences. P/NP or letter grading.", 
        "prerequisiteDescription": "Economics 41 or STATS 12 or 13, and Economics 101 (may be waived with consent of instructor)", 
        "prerequisites": [], 
        "title": "Environmental Economics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON M135": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "(Same as Public Policy M149 and Urban Planning M163.) Lecture, three hours. Examination of specific environmental challenges that California faces. Microeconomic perspective used, with special emphasis on incentives of polluters to reduce their pollution and incentives of local, federal, and state government to address these issues. Focus on measurement and empirical hypothesis testing. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "California Sustainable Development: Economic Perspective", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON M137": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "(Same as Geography M137.) Lecture, three hours. Designed for juniors/seniors. Study of systematic changes of natural environment in U.S. during historical time, with emphasis on interplay between and among natural factors of climate, soils, vegetation, and landforms, and human factors of settlement, economic activity, technology, and cultural traits. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Historical Geography of American Environment", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON M153": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "(Same as Architecture and Urban Design CM153.) Lecture, three hours. Relationship of built environment to natural environment through whole systems approach, with focus on sustainable design of buildings and planning of communities. Emphasis on energy efficiency, renewable energy, and appropriate use of resources, including materials, water, and land. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Sustainable Architecture and Community Planning", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON M155": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "(Same as Physics M155.) Lecture, three hours. Requisites: Mathematics 3A and 3B (or 31A and 31B), Physics 1A and 1B (or 6A and 6B), Statistics 12 or 13. Examination of physics of energy, history of energy development, and role that energy plays in our economy, particularly in transportation and power grid. Prospects for decreasing availability of fossil fuels and impact of global warming on energy development. Current and potential future government and social responses to energy issues. P/NP or letter grading.", 
        "prerequisiteDescription": "MATH 3A and 3B (or 31A and 31B), PHYSICS 1A and 1B (or 6A and 6B), STATS 12 or 13", 
        "prerequisites": [], 
        "title": "Energy in Modern Economy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON M161": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "(Same as Political Science M122B.) Lecture, three or four hours; discussion, one hour (when scheduled). Recommended requisite: Political Science 20. Politics and policy of major global environmental issues such as climate change, integrating law, policy, and political science perspectives. P/NP or letter grading.", 
        "prerequisiteDescription": "Political Science 20", 
        "prerequisites": [], 
        "title": "Global Environment and World Politics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON M164": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "(Same as Urban Planning M160.) Lecture, three hours. Environmental planning is more than simply finding problems and fixing them. Each policy must be negotiated and implemented within multiple, complex systems of governance. Institutions and politics matter deeply. Overview of how environmental governance works in practice and how it might be improved. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Environmental Politics and Governance", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON M167": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "(Same as Urban Planning M167.) Lecture, three hours. Examination of intersection between race, economic class, and environment in U.S., with focus on issues related to social justice. Because environmental inequality is highly complex phenomenon, multidisciplinary and multipopulation approach taken, using alternative ways of understanding, interpreting, and taking action. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Environmental Justice through Multiple Lenses", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON M192": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "(Same as English M192 and English Composition M192.) Seminar, two hours. Training and supervised practicum for undergraduate student editors of campus journals supervised by faculty members in English, Institute of the Environment and Sustainability, and/or Writing Programs. May be repeated for credit. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Undergraduate Practicum in English: Journals", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON M1A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "(Same as Clusters M1A.) Lecture, three hours; discussion, two hours. Course M1A is enforced requisite to M1B, which is enforced requisite to M1CW. Limited to first-year freshmen. Food as lens for local and global environmental and sustainability issues. Integration of environmental, social, economic, and technological solutions for fair, sustainable, and healthy food production, food security, and access. Focus on human impacts on Earth's biological and physical systems, including how food production and consumption contributes to, and is impacted by, global problems, including climate change, pollution, and overpopulation. Laboratory exercises included in discussions. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Food: Lens for Environment and Sustainability", 
        "unit": 6, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON M1B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "(Same as Clusters M1B.) Lecture, three hours; discussion, two hours. Enforced requisite: course M1A. Limited to first-year freshmen. Food as lens for local and global environmental and sustainability issues. Integration of environmental, social, economic, and technological solutions for fair, sustainable, and healthy food production, food security, and access. Focus on human impacts on Earth's biological and physical systems, including how food production and consumption contributes to, and is impacted by, global problems, including climate change, pollution, and overpopulation. Laboratory exercises included in discussions. Letter grading.", 
        "prerequisiteDescription": "course M1A", 
        "prerequisites": [
            [
                "ENVIRON M1A"
            ]
        ], 
        "title": "Food: Lens for Environment and Sustainability", 
        "unit": 6, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON M1CW": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "(Same as Clusters M1CW.) Seminar, three hours. Enforced requisite: course M1B. Limited to first-year freshmen. Examination of specialized environmental and sustainability topics as they relate to food, including air, water, biodiversity, climate change, food access, food security, and health. Satisfies Writing II requirement. Letter grading.", 
        "prerequisiteDescription": "course M1B", 
        "prerequisites": [
            [
                "ENVIRON M1B"
            ]
        ], 
        "title": "Food: Lens for Environment and Sustainability -- Special Topics", 
        "unit": 6, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON M30": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "(Same as English M30.) Lecture, three hours; discussion, one hour. Enforced requisite: satisfaction of Entry-Level Writing requirement. Introduction to core themes, questions, and methods within interdisciplinary field of environmental humanities. Examination of how different culture forms (e.g., fiction, journalism, poetry, visual art) represent environmental issues. Topics may include biodiversity, wilderness, food, urban ecologies, postcolonial ecologies, environmental justice, and climate change. P/NP or letter grading.", 
        "prerequisiteDescription": "satisfaction of Entry-Level Writing requirement", 
        "prerequisites": [], 
        "title": "Environmental Literature and Culture", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON M30SL": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "(Same as English M30SL.) Lecture, three hours; discussion, one hour; fieldwork, two hours. Enforced requisite: satisfaction of Entry-Level Writing requirement. Introduction to core themes, questions, and methods within interdisciplinary field of environmental humanities. Examination of how different culture forms (e.g., fiction, journalism, poetry, visual art) represent environmental issues. Topics may include biodiversity, wilderness, food, urban ecologies, postcolonial ecologies, environmental justice, and climate change. Service learning component includes meaningful work with off-campus agency/agencies selected by instructor. P/NP or letter grading.", 
        "prerequisiteDescription": "satisfaction of Entry-Level Writing requirement", 
        "prerequisites": [], 
        "title": "Environmental Literature and Culture (Service Learning)", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON M412": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "(Same as Environmental Health Sciences M412.) Seminar, two hours. Essentials of grammar, punctuation, syntax, organization, and format needed to produce well-written journal articles, research reports, memoranda, letters, and résumés. Development of technical writing skills using critique, exercises, and examples. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Effective Technical Writing", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON M413": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "(Formerly numbered 410B.) (Same as Environmental Health Sciences M413.) Seminar, two hours. Development of advanced technical writing skills, with exercises focused on preparation of manuscripts for publication in peer-reviewed journal. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Technical Writing", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON M414": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "(Formerly numbered 410A.) (Same as Environmental Health Sciences M414.) Seminar, two hours. Introduction to oral presentations. Development of oral presentation skills, including content structure, visual aids, delivery, and audience interaction. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Effective Oral Presentation", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ENVIRON M415": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ENVIRON", 
        "departmentFullName": "Environment", 
        "description": "(Formerly numbered 410C.) (Same as Environmental Health Sciences M415.) Seminar, two hours. Development of advanced oral presentation skills. Preparation for oral qualifying examination. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Oral Presentation", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }
}