{
    "FOOD ST 187": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "FOOD ST", 
        "departmentFullName": "Food Studies", 
        "description": "Lecture, three hours. Variable topics in one area within food studies. May be repeated for credit with topic and/or instructor change. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Topics in Food Studies", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "FOOD ST 189": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "FOOD ST", 
        "departmentFullName": "Food Studies", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "FOOD ST 189HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "FOOD ST", 
        "departmentFullName": "Food Studies", 
        "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Contracts", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "FOOD ST 19": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "FOOD ST", 
        "departmentFullName": "Food Studies", 
        "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Fiat Lux Freshman Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "FOOD ST 195C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "FOOD ST", 
        "departmentFullName": "Food Studies", 
        "description": "Tutorial, to be arranged; fieldwork, eight to 10 hours. Limited to juniors/seniors. Internship in corporate, governmental, or nonprofit setting coordinated through Center for Community Learning (CCL). Students complete weekly written assignments, attend biweekly meetings with graduate student coordinator, and write final research paper. Faculty sponsor and graduate student coordinator construct series of reading assignments that examine issues related to internship site. Fulfills capstone experience requirement for Food Studies minor. Individual contract with site supervisor, CCL coordinator, and faculty sponsor required. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Community and Corporate Internships in Food Studies for Capstone", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "FOOD ST 195CE": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "FOOD ST", 
        "departmentFullName": "Food Studies", 
        "description": "Tutorial, to be arranged; fieldwork, eight to 10 hours. Limited to juniors/seniors. Internship in corporate, governmental, or nonprofit setting coordinated through Center for Community Learning (CCL). Students complete weekly written assignments, attend biweekly meetings with graduate student coordinator, and write final research paper. Faculty sponsor and graduate student coordinator construct series of reading assignments that examine issues related to internship site. May be repeated for credit with consent of Center for Community Learning. Individual contract with site supervisor, CCL coordinator, and faculty sponsor required. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Community and Corporate Internships in Food Studies (Effective Fall 2018 )", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "FOOD ST 197": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "FOOD ST", 
        "departmentFullName": "Food Studies", 
        "description": "Tutorial, to be arranged. Limited to juniors/seniors. Individual intensive study, with scheduled meetings between faculty member and student. Assigned reading and tangible evidence of mastery of subject matter required. May be repeated for credit. Individual contract required. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Individual Studies in Foodways, Diet, and Nutrition", 
        "unit": "2 to 8", 
        "unitType": "RANGE"
    }, 
    "FOOD ST 199": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "FOOD ST", 
        "departmentFullName": "Food Studies", 
        "description": "Tutorial, to be arranged. Limited to juniors/seniors. Supervised individual research projects in food studies under guidance of faculty mentor. Culminating paper required. May be repeated for credit. Individual contract required. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Directed Research or Senior Project in Food Studies", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "FOOD ST 27": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "FOOD ST", 
        "departmentFullName": "Food Studies", 
        "description": "Lecture, four hours. Development of process of further thinking about stories behind conclusions from nutrition studies and food scientific literature. Exercises, discussions, reports, and readings designed to provide practices to become critical thinker in food science and literature. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Critical Thinking about Food and Science Publications", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "FOOD ST 375": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "FOOD ST", 
        "departmentFullName": "Food Studies", 
        "description": "Seminar, to be arranged. Preparation: apprentice personnel employment as teaching assistant, associate, or fellow. Teaching apprenticeship under active guidance and supervision of regular faculty member responsible for curriculum and instruction at UCLA. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Teaching Apprentice Practicum", 
        "unit": "1 to 4", 
        "unitType": "RANGE"
    }, 
    "FOOD ST 89": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "FOOD ST", 
        "departmentFullName": "Food Studies", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "FOOD ST 89HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "FOOD ST", 
        "departmentFullName": "Food Studies", 
        "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Contracts", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "FOOD ST 99": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "FOOD ST", 
        "departmentFullName": "Food Studies", 
        "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Student Research Program", 
        "unit": "1 to 2", 
        "unitType": "RANGE"
    }, 
    "FOOD ST M170SL": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "FOOD ST", 
        "departmentFullName": "Food Studies", 
        "description": "(Same as Civic Engagement M170SL.) Seminar, three hours; fieldwork, two hours. Interdisciplinary service learning course that provides general understanding of access and equity issues related to food chain in Los Angeles. Exploration of social justice issues faced by residents of lower-income communities. Reading of research from multiple disciplines, including but not limited to public health, environmental justice, and public policy. Service-learning component includes meaningful work with off-campus community partners selected in advance by instructor and Center for Community Learning. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Food Studies and Food Justice in Los Angeles", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "FOOD ST M79": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "FOOD ST", 
        "departmentFullName": "Food Studies", 
        "description": "(Same as World Arts and Cultures M79.) Lecture, four hours; discussion, one hour. Examination of issues of environmental and public health effects of intensive and extensive agriculture, influence of corporations on government, animal ethics, food deserts and urban gardening, and food insecurity. Focus on representation of such issues in documentaries, public lectures, memoirs, novels, and visual art, as well as on initiatives to address such problems through policy and activism. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Food Politics: Cultural Solutions to Political Problems", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }
}