{
    "HUM GEN 188SA": {
        "corequisiteDescription": "HNRS 101E", 
        "corequisites": [], 
        "departmentAbbreviation": "HUM GEN", 
        "departmentFullName": "Human Genetics", 
        "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Individual Studies for USIE Facilitators", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "HUM GEN 188SB": {
        "corequisiteDescription": "HNRS 101E", 
        "corequisites": [], 
        "departmentAbbreviation": "HUM GEN", 
        "departmentFullName": "Human Genetics", 
        "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.", 
        "prerequisiteDescription": "course 188SA", 
        "prerequisites": [
            [
                "HUM GEN 188SA"
            ]
        ], 
        "title": "Individual Studies for USIE Facilitators", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "HUM GEN 188SC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "HUM GEN", 
        "departmentFullName": "Human Genetics", 
        "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.", 
        "prerequisiteDescription": "course 188SB", 
        "prerequisites": [
            [
                "HUM GEN 188SB"
            ]
        ], 
        "title": "Individual Studies for USIE Facilitators", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "HUM GEN 189": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "HUM GEN", 
        "departmentFullName": "Human Genetics", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "HUM GEN 19": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "HUM GEN", 
        "departmentFullName": "Human Genetics", 
        "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Fiat Lux Freshman Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "HUM GEN 199": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "HUM GEN", 
        "departmentFullName": "Human Genetics", 
        "description": "Tutorial, to be arranged. Students select instructor among eligible research faculty and carry out independent research project under instructor supervision. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Studies in Human Genetics", 
        "unit": "2 to 8", 
        "unitType": "RANGE"
    }, 
    "HUM GEN 210": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "HUM GEN", 
        "departmentFullName": "Human Genetics", 
        "description": "Seminar, two hours. Survey of current biological theory and technology used in genomic research. Topics include genomic technologies, functional genomics, proteomics, statistical genetics, bioinformatics, and ethical issues in human genetics. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Topics in Genomics", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "HUM GEN 236A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "HUM GEN", 
        "departmentFullName": "Human Genetics", 
        "description": "Lecture, three hours. Recommended preparation: prior knowledge of basic concepts in molecular biology and genetics. Advanced topics in human genetics related to molecular genetics and relevant technologies. Topics include genomic technologies, human genome, mapping and identification of disease-causing mutations, transcriptomics, proteomics, functional genomics, epigenetics, and stem cells. Reading materials include original research articles and reviews or book chapters. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Human Genetics A: Molecular Aspects", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "HUM GEN 236B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "HUM GEN", 
        "departmentFullName": "Human Genetics", 
        "description": "Lecture, three hours; computer laboratory, one hour. Recommended preparation: introductory statistics knowledge equivalent to Biostatistics 100A or Statistics 13 and general genetics knowledge equivalent to Ecology and Evolutionary Biology 121, Human Genetics 236A, or Molecular, Cell, and Developmental Biology 144. Statistical and population genetics related to analysis of complex human genetic traits. Reading materials include original research papers and reviews. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Human Genetics B: Statistical Aspects", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "HUM GEN 282": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "HUM GEN", 
        "departmentFullName": "Human Genetics", 
        "description": "Lecture, two hours. Limited to graduate students. Covers topics related to scientific careers such as scientific writing and presentation (including to non-scientific audiences), grant writing and reviewing, curricula vitae, hiring process, social media usage, developing short- and long-term goals, and balancing career and non-work life. Exploration of differences between industry, government, teaching-college, and research-college careers. Active participation and oral and written presentations required. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Topics on Scientific Careers", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "HUM GEN 596": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "HUM GEN", 
        "departmentFullName": "Human Genetics", 
        "description": "Tutorial, to be arranged. Individual study or research for graduate students. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Directed Individual Study and Research", 
        "unit": "2 to 12", 
        "unitType": "RANGE"
    }, 
    "HUM GEN 597": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "HUM GEN", 
        "departmentFullName": "Human Genetics", 
        "description": "Tutorial, to be arranged. Individual study for M.S. comprehensive examination or Ph.D. qualifying examinations. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Preparation for M.S", 
        "unit": "2 to 12", 
        "unitType": "RANGE"
    }, 
    "HUM GEN 598": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "HUM GEN", 
        "departmentFullName": "Human Genetics", 
        "description": "Tutorial, to be arranged. Preparation of research data and writing of M.S. thesis. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "M.S", 
        "unit": "2 to 12", 
        "unitType": "RANGE"
    }, 
    "HUM GEN 599": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "HUM GEN", 
        "departmentFullName": "Human Genetics", 
        "description": "Tutorial, to be arranged. Preparation of research data and writing of Ph.D. dissertation. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Ph.D", 
        "unit": "2 to 12", 
        "unitType": "RANGE"
    }, 
    "HUM GEN 99": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "HUM GEN", 
        "departmentFullName": "Human Genetics", 
        "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Student Research Program", 
        "unit": "1 to 2", 
        "unitType": "RANGE"
    }, 
    "HUM GEN C144": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "HUM GEN", 
        "departmentFullName": "Human Genetics", 
        "description": "Lecture, three hours; discussion, one hour. Requisite: Life Sciences 4. Survey of key technologies that have led to successful application of genomics to biology, with focus on theory behind specific genome-wide technologies and their current applications. Concurrently scheduled with course C244. P/NP or letter grading.", 
        "prerequisiteDescription": "LIFESCI 4", 
        "prerequisites": [], 
        "title": "Genomic Technology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "HUM GEN C244": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "HUM GEN", 
        "departmentFullName": "Human Genetics", 
        "description": "Lecture, three hours; discussion, one hour. Requisite: Life Sciences 4. Survey of key technologies that have led to successful application of genomics to biology, with focus on theory behind specific genome-wide technologies and their current applications. Concurrently scheduled with course C144. S/U or letter grading.", 
        "prerequisiteDescription": "LIFESCI 4", 
        "prerequisites": [], 
        "title": "Genomic Technology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "HUM GEN CM124": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "HUM GEN", 
        "departmentFullName": "Human Genetics", 
        "description": "(Same as Computer Science CM124.) Lecture, four hours; discussion, two hours; outside study, six hours. Enforced requisites: Computer Science 32 or Program in Computing 10C with grade of C- or better, and one course from Biostatistics 100A, 110A, Civil Engineering 110, Electrical Engineering 131A, Mathematics 170A, or Statistics 100A. Designed for engineering students as well as students from biological sciences and medical school. Introduction to computational analysis of genetic variation and computational interdisciplinary research in genetics. Topics include introduction to genetics, identification of genes involved in disease, inferring human population history, technologies for obtaining genetic information, and genetic sequencing. Focus on formulating interdisciplinary problems as computational problems and then solving those problems using computational techniques from statistics and computer science. Concurrently scheduled with course CM224. Letter grading.", 
        "prerequisiteDescription": "COM SCI 32 or PIC 10C with grade of C- or better, and one course from BIOSTAT 100A, 110A, C&EE 110, EL ENGR 131A, MATH 170A, or STATS 100A", 
        "prerequisites": [], 
        "title": "Computational Genetics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "HUM GEN CM224": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "HUM GEN", 
        "departmentFullName": "Human Genetics", 
        "description": "(Same as Bioinformatics M224 and Computer Science CM224.) Lecture, four hours; discussion, two hours; outside study, six hours. Enforced requisites: Computer Science 32 or Program in Computing 10C with grade of C- or better, and one course from Biostatistics 100A, 110A, Civil Engineering 110, Electrical Engineering 131A, Mathematics 170A, or Statistics 100A. Designed for engineering students as well as students from biological sciences and medical school. Introduction to computational analysis of genetic variation and computational interdisciplinary research in genetics. Topics include introduction to genetics, identification of genes involved in disease, inferring human population history, technologies for obtaining genetic information, and genetic sequencing. Focus on formulating interdisciplinary problems as computational problems and then solving those problems using computational techniques from statistics and computer science. Concurrently scheduled with course CM124. Letter grading.", 
        "prerequisiteDescription": "COM SCI 32 or PIC 10C with grade of C- or better, and one course from BIOSTAT 100A, 110A, C&EE 110, EL ENGR 131A, MATH 170A, or STATS 100A", 
        "prerequisites": [], 
        "title": "Computational Genetics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "HUM GEN M203": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "HUM GEN", 
        "departmentFullName": "Human Genetics", 
        "description": "(Same as Biomathematics M203.) Lecture, four hours. Requisite: Mathematics 170A or equivalent experience in probability. Mathematical description of biological relationships, with particular attention to areas where conditions for deterministic models are inadequate. Examples of stochastic models from genetics, physiology, ecology, and variety of other biological and medical disciplines. S/U or letter grading.", 
        "prerequisiteDescription": "MATH 170A or equivalent experience in probability", 
        "prerequisites": [], 
        "title": "Stochastic Models in Biology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "HUM GEN M207A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "HUM GEN", 
        "departmentFullName": "Human Genetics", 
        "description": "(Same as Biomathematics M207A and Biostatistics M272.) Lecture, three hours; discussion, one hour. Requisites: Mathematics 115A, 131A, Statistics 100B. Mathematical models in statistical genetics. Topics include population genetics, genetic epidemiology, gene mapping, design of genetics experiments, DNA sequence analysis, and molecular phylogeny. S/U or letter grading.", 
        "prerequisiteDescription": "MATH 115A, 131A, STATS 100B", 
        "prerequisites": [], 
        "title": "Theoretical Genetic Modeling", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "HUM GEN M207B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "HUM GEN", 
        "departmentFullName": "Human Genetics", 
        "description": "(Same as Biomathematics M207B and Biostatistics M237.) Lecture, three hours; laboratory, one hour. Requisites: Biostatistics 200B, 202B (may be taken concurrently) or equivalent coursework or consent of instructor. Covers basic genetic concepts (prior knowledge of human genetics not required). Topics include statistical methodology underlying genetic analysis of both quantitative and qualitative complex traits. Laboratory for hands-on computer analysis of genetic data; laboratory reports required. Course complements M207A; students may take either and are encouraged to take both. S/U or letter grading.", 
        "prerequisiteDescription": "BIOSTAT 200B, 202B (may be taken concurrently) or equivalent coursework or consent of instructor", 
        "prerequisites": [], 
        "title": "Applied Genetic Modeling", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "HUM GEN M211": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "HUM GEN", 
        "departmentFullName": "Human Genetics", 
        "description": "(Same as Biomathematics M211 and Biostatistics M239.) Lecture, three hours; laboratory, one hour. Theoretical models in molecular evolution, with focus on phylogenetic techniques. Topics include evolutionary tree reconstruction methods, studies of viral evolution, phylogeography, and coalescent approaches. Examples from evolutionary biology and medicine. Laboratory for hands-on computer analysis of sequence data. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Mathematical and Statistical Phylogenetics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "HUM GEN M226": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "HUM GEN", 
        "departmentFullName": "Human Genetics", 
        "description": "(Same as Bioinformatics M226 and Computer Science M226.) Lecture, four hours; outside study, eight hours. Enforced requisite: Computer Science 32 or Program in Computing 10C with grade of C- or better. Recommended: one course from Biostatistics 100A, 110A, Civil Engineering 110, Electrical Engineering 131A, Mathematics 170A, or Statistics 100A. Familiarity with probability, statistics, linear algebra, and algorithms expected. Designed for engineering students as well as students from biological sciences and medical school. Biology has become data-intensive science. Bottleneck in being able to make sense of biological processes has shifted from data generation to statistical models and inference algorithms that can analyze these datasets. Statistical machine learning provides important toolkit in this endeavor. Biological datasets offer new challenges to field of machine learning. Examination of statistical and computational aspects of machine learning techniques and their application to key biological questions. Letter grading.", 
        "prerequisiteDescription": "COM SCI 32 or PIC 10C with grade of C- or better", 
        "prerequisites": [], 
        "title": "Machine Learning in Bioinformatics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "HUM GEN M229S": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "HUM GEN", 
        "departmentFullName": "Human Genetics", 
        "description": "(Same as Biological Chemistry M229S and Computer Science M229S.) Seminar, four hours; outside study, eight hours. Designed for graduate engineering students as well as students from biological sciences and medical school. Introduction to current topics in bioinformatics, genomics, and computational genetics and preparation for computational interdisciplinary research in genetics and genomics. Topics include genome analysis, regulatory genomics, association analysis, association study design, isolated and admixed populations, population substructure, human structural variation, model organisms, and genomic technologies. Computational techniques include those from statistics and computer science. May be repeated for credit with topic change. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Seminar: Current Topics in Bioinformatics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "HUM GEN M255": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "HUM GEN", 
        "departmentFullName": "Human Genetics", 
        "description": "(Same as Pathology M255.) Lecture, three hours. Basic molecular genetic and cytogenetic techniques of gene mapping. Selected regions of human genomic map scrutinized in detail, particularly gene families and clusters of genes that have remained linked from mouse to human. Discussion of localizations of disease genes. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Mapping and Mining Human Genome", 
        "unit": 3, 
        "unitType": "ABSOLUTE"
    }, 
    "HUM GEN M260A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "HUM GEN", 
        "departmentFullName": "Human Genetics", 
        "description": "(Same as Bioinformatics M221, Chemistry CM260A, and Computer Science CM221.) Lecture, four hours; discussion, two hours. Requisites: Computer Science 32 or Program in Computing 10C with grade of C- or better, and one course from Biostatistics 100A, Civil Engineering 110, Electrical Engineering 131A, Mathematics 170A, or Statistics 100A. Prior knowledge of biology not required. Designed for engineering students as well as students from biological sciences and medical school. Introduction to bioinformatics and methodologies, with emphasis on concepts and inventing new computational and statistical techniques to analyze biological data. Focus on sequence analysis and alignment algorithms. S/U or letter grading.", 
        "prerequisiteDescription": "COM SCI 32 or PIC 10C with grade of C- or better, and one course from BIOSTAT 100A, C&EE 110, EL ENGR 131A, MATH 170A, or STATS 100A", 
        "prerequisites": [], 
        "title": "Introduction to Bioinformatics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "HUM GEN M265": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "HUM GEN", 
        "departmentFullName": "Human Genetics", 
        "description": "(Same as Bioinformatics M225 and Computer Science M225.) Lecture, two and one half hours; discussion, two and one half hours; outside study, seven hours. Introduction to computational approaches in bioinformatics, genomics, and computational genetics and preparation for computational interdisciplinary research in genetics and genomics. Topics include genome analysis, regulatory genomics, association analysis, association study design, isolated and admixed populations, population substructure, human structural variation, model organisms, and genomic technologies. Computational techniques and methods include those from statistics and computer science. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Computational Methods in Genomics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }
}