{
    "NR EAST 189": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "NR EAST", 
        "departmentFullName": "Near Eastern Languages", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "NR EAST 189HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "NR EAST", 
        "departmentFullName": "Near Eastern Languages", 
        "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Contracts", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "NR EAST 19": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "NR EAST", 
        "departmentFullName": "Near Eastern Languages", 
        "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Fiat Lux Freshman Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "NR EAST 375": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "NR EAST", 
        "departmentFullName": "Near Eastern Languages", 
        "description": "Seminar, to be arranged. Preparation: apprentice personnel employment as teaching assistant, associate, or fellow. Teaching apprenticeship under active guidance and supervision of regular faculty member responsible for curriculum and instruction at UCLA. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Teaching Apprentice Practicum", 
        "unit": "1 to 4", 
        "unitType": "RANGE"
    }, 
    "NR EAST 495": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "NR EAST", 
        "departmentFullName": "Near Eastern Languages", 
        "description": "Seminar, two hours. Problems and methods of presenting literary texts as exemplary materials in teaching of language and literature in Near Eastern Languages and Cultures. Theory and classroom practice, with individual counseling and faculty evaluation of teaching assistant performances. May not be applied toward M.A. degree requirements. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Preparation for Teaching Language and Literature in Near Eastern Languages and Cultures", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "NR EAST 501": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "NR EAST", 
        "departmentFullName": "Near Eastern Languages", 
        "description": "Preparation: consent of UCLA graduate adviser and graduate dean, and host campus instructor, department chair, and graduate dean. Used to record enrollment of UCLA students in courses taken under cooperative arrangements with USC. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Cooperative Program", 
        "unit": "2 to 8", 
        "unitType": "RANGE"
    }, 
    "NR EAST 596": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "NR EAST", 
        "departmentFullName": "Near Eastern Languages", 
        "description": "Tutorial, to be arranged. May be repeated for credit. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Directed Individual Study", 
        "unit": "2 to 8", 
        "unitType": "RANGE"
    }, 
    "NR EAST 597": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "NR EAST", 
        "departmentFullName": "Near Eastern Languages", 
        "description": "Tutorial, to be arranged. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Examination Preparation", 
        "unit": "2 to 8", 
        "unitType": "RANGE"
    }, 
    "NR EAST 599": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "NR EAST", 
        "departmentFullName": "Near Eastern Languages", 
        "description": "Tutorial, to be arranged. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Ph.D", 
        "unit": "2 to 8", 
        "unitType": "RANGE"
    }, 
    "NR EAST 89": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "NR EAST", 
        "departmentFullName": "Near Eastern Languages", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "NR EAST 89HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "NR EAST", 
        "departmentFullName": "Near Eastern Languages", 
        "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Contracts", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "NR EAST 99": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "NR EAST", 
        "departmentFullName": "Near Eastern Languages", 
        "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Student Research Program", 
        "unit": "1 to 2", 
        "unitType": "RANGE"
    }, 
    "NR EAST CM114": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "NR EAST", 
        "departmentFullName": "Near Eastern Languages", 
        "description": "(Same as Asian CM124 and Slavic CM114.) Lecture, three hours. Consideration of issues relevant to heritage language learners (HLL) and to heritage language (HL) instruction. Readings and discussion on such topics as definitions of HLs and HLLs; linguistic, demographic, sociolinguistic, and sociocultural profile of HLLs, particularly HL groups most represented among UCLA students; institutional and instructor attitudes toward HLLs; impact of student motivation and expectations on HL curriculum and teaching approaches; similarities and differences between HLLs and foreign language learners (FLLs) regarding teaching methods and materials; diagnostic testing and needs analysis; use of oral/aural proficiency as springboard for literacy instruction; optimization of instruction of mixed HL and FL classes. Action research component included. Concurrently scheduled with course CM214. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Teaching and Learning of Heritage Languages", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "NR EAST CM214": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "NR EAST", 
        "departmentFullName": "Near Eastern Languages", 
        "description": "(Same as Asian CM224 and Slavic CM214.) Lecture, three hours. Consideration of issues relevant to heritage language learners (HLL) and to heritage language (HL) instruction. Readings and discussion on such topics as definitions of HLs and HLLs; linguistic, demographic, sociolinguistic, and sociocultural profile of HLLs, particularly HL groups most represented among UCLA students; institutional and instructor attitudes toward HLLs; impact of student motivation and expectations on HL curriculum and teaching approaches; similarities and differences between HLLs and foreign language learners (FLLs) regarding teaching methods and materials; diagnostic testing and needs analysis; use of oral/aural proficiency as springboard for literacy instruction; optimization of instruction of mixed HL and FL classes. Action research component included. Concurrently scheduled with course CM114. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Teaching and Learning of Heritage Languages", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "NR EAST M20": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "NR EAST", 
        "departmentFullName": "Near Eastern Languages", 
        "description": "(Same as Asian M20, Indo-European Studies M20, Slavic M20, and Southeast Asian M20.) Lecture, three hours; discussion, one hour. Consideration of concrete means of language representation in writing systems. Earliest representations of language known are those of Near East dating to end of 4th millennium B.C. While literate civilizations of Egypt, Indus Valley, China, and Mesoamerica left little evidence of corresponding earliest developments, their antiquity and, in case of China and Mesoamerica, their evident isolation mark these centers as loci of independent developments in writing. Basic characteristics of early scripts, assessment of modern alphabetic writing systems, and presentation of conceptual basis of semiotic language representation. Origins and development of early non-Western writing systems. How Greco-Roman alphabet arose in 1st millennium B.C. and how it compares to other modern writing systems. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Visible Language: Study of Writing", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "NR EAST M248": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "NR EAST", 
        "departmentFullName": "Near Eastern Languages", 
        "description": "(Same as Anthropology M248 and History M248.) Seminar, three hours. Introduction to historical and anthropological writings about Mediterranean. Draws on variety of classic and contemporary theories, histories, and ethnographies about Mediterranean Sea. Topics include geographical and imaginary boundaries, Mediterranean honor/shame concepts, colonial and post-colonial Mediterranean, Levantinism, thalassology, Mediterraneanism, French Mediterraneans, Jewish Mediterranean, colonial and post-colonial sea and migrants and mobilities. Focus on critical history of anthropological study of Mediterranean and scholarly literature that emphasizes southern shores of Mediterranean. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Anthropology and History of Mediterranean", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "NR EAST M287": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "NR EAST", 
        "departmentFullName": "Near Eastern Languages", 
        "description": "(Same as Anthropology M247Q and History M287.) Seminar, two hours. Introduction to study of central Asia as practiced in humanities and social sciences disciplines. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Central Asian Studies: Discipline, Methods, Debates", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }
}