{
    "ORL BIO 19": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Fiat Lux Freshman Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "ORL BIO 201A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Lecture, three hours. Evolutionary perspective of cellular development from simple molecules that were formed during first billion years of Earth to development of cells, tissues, and organs of invertebrates and vertebrates. Development of vertebrate feeding apparatus from comparative anatomical and physiological point of view, followed by embryogenesis of orofacial and dental structures of humans. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Oral Biology: Ontogenesis", 
        "unit": 3, 
        "unitType": "ABSOLUTE"
    }, 
    "ORL BIO 201C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Lecture, three hours. Molecular basis for pathogenic processes in tissues of oral cavity. Topics include microbially mediated demineralization of hard tissues, soft tissue infections, carcinogenesis, colonization of mucosal substrates by opportunists, etc. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Oral Biology: Pathobiology", 
        "unit": 3, 
        "unitType": "ABSOLUTE"
    }, 
    "ORL BIO 203": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Lecture, four hours. Lectures and laboratory instruction in development and histological structure of facial region and oral and peri-oral organs and tissues. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Oral Embryology and Histology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "ORL BIO 205A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Lecture, two hours. Designed for graduate oral biology students. Integration of didactic lectures in descriptive and inferential statistics and in research design (emphasis on experimental design), presentations of statistical software, and open discussion of specific needs of oral biology students when they design their research. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Methodology in Research Design and Data Analysis", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ORL BIO 205B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Seminar, two hours. Designed for oral biology graduate students. Fundamentals of evidence-based research in dentistry and its implications for practice. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Methodology in Evidence-Based Dentistry", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ORL BIO 205C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Seminar, one hour; discussion, one hour. Requisites: courses 205A, 205B (may be taken concurrently). Hands-on experience in process of systematic review, as shared mechanism in comparative effectiveness and evidence-based research. Specialized topics include level and quality of evidence assessments, acceptable sampling analysis, meta-analysis and meta-regression, and Bayesian-derived decision making following utility versus logic model. Students work on examples of their choice and interest in oral biology, medicine, and orthodontics. Letter grading.", 
        "prerequisiteDescription": "courses 205A, 205B (may be taken concurrently)", 
        "prerequisites": [], 
        "title": "Advanced Seminar: Comparative Effectiveness and Evidence-Based Research", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ORL BIO 206": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Lecture, two hours. Preparation: basic immunology. Discussion and analysis of current research dealing with immunological issues related to oral health, including HIV, opportunistic oral infections, periodontal pathology, oral immunopathology, caries immunology, endodontic immunology, etc. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Current Topics in Oral Immunology", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ORL BIO 208": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Lecture, one hour; discussion, one hour. Introduction to fundamentals and technical aspects of genomics and proteomics and analysis of data derived therefrom. Discussion of implications and applications of genomics and proteomics in diagnostic protocols such as salivary diagnostics. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Genomics and Proteomics in Oral Biology Research", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ORL BIO 209": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Seminar, two hours. Required course in scientific ethics for graduate students in Oral Biology M.S. and Ph.D. programs and for NRSA trainees in School of Dentistry. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Scientific Ethics", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ORL BIO 211": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Lecture, two hours. Anatomy, histology, physiology, and biomechanics of temporomandibular joint (TMJ) and related musculature. Pain mechanisms, sensorimotor integration, and motor mechanisms in TMJ function, and current methods of TMJ imaging. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Biology of Temporomandibular Joint", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ORL BIO 212": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Seminar, one hour; discussion, one hour. Introductory course for graduate M.S. students. Guest seminars on topics of research in oral biology (pain pathways, immunology, bone biology, microbiology, cancer, and salivary genomics), followed by discussions led by course chair. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Proseminar: Oral Biology Research", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ORL BIO 214": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Seminar, one hour; discussion, one hour. Exploration of oral bone biology and immunology and how both systems talk to each other. Topics include immune modulation of bone metabolism, osteoblastic niche for hematopoietic progenitors, adult bone marrow stem cell changes, and osteoimmunology in at-risk populations. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Current Research in Osteoimmunology", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ORL BIO 215A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Lecture, two hours. Basic cellular and molecular mechanisms involved in responses mediated by immune effectors, with emphasis on immunopathology involved in autoimmunity, cancer, and immunodeficiency syndromes. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Fundamentals of Immunology", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ORL BIO 215B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Seminar, one hour; discussion, one hour. Overview of rapidly changing discoveries in very important field of immunology. Directed and student-led discussions of current cutting-edge research developments in immunology. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Current Advanced Research Topics in Immunology", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ORL BIO 220": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Lecture, one hour; laboratory, 90 minutes. Introduction to integrative biology and biomaterials science by bringing together diversity of disciplines that complement one another to unravel complexity of biology in biomaterials in relation to dentistry. Integration of bioengineering, materials sciences, cell biology, and dentistry. Fundamentals of materials science in relation to dentistry, stem cell biology, and knowledge necessary to participate in dental and biomedical research, innovation, and product development. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Integrative Biology and Biomaterials Science in Relation to Dentistry", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ORL BIO 221": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Lecture, one hour; laboratory, 90 minutes. Preparation of individuals for academic and research careers in dental materials science or broader area of biomaterials relevant to clinical dental practice. Fundamentals of dental materials and knowledge necessary to participate in research and product development. Introduction to materials science, with focus on major classes of materials used in dentistry, including polymers, metals, and ceramics, and providing up-to-date information on dental materials currently used in clinical dentistry. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Dental Materials", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ORL BIO 226": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Lecture, two hours. Preparation: strong background in histology and embryology. Students acquire, from scientific literature discussed in lecture/seminar format, advanced knowledge of relevant aspects of human biology as they apply to classic and current concepts of principles governing growth and development of craniofacial region. Students required to present seminars on assigned topics that aid their understanding and analysis of course content that has application to their specific and professional fields. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Craniofacial Growth and Development", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ORL BIO 227": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Lecture, two hours. Description and interpretation of important stages in development of orofacial apparatus and histological features of its component tissues. Critique of scientific literature relevant to course content and analysis of current state of knowledge about selected features of orofacial apparatus that are of significance to clinical dental specialists. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Dental Embryology and Histology", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ORL BIO 228": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Lecture, three hours. Survey of pharmacology, with particular emphasis on how drugs interact with dentistry. General principles of drug action and drug effects on autonomic and central nervous systems. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Dental Pharmacology and Therapeutics", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ORL BIO 229A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Seminar, one hour; discussion, one hour. Examination of sociocultural, biological, and linguistic anthropology to understand factors that influence health and well-being, experience and distribution of illness, prevention and treatment of sickness, healing processes, social relations of therapy management, and cultural importance and utilization of pluralistic medical systems. Theory, perspectives, and methods from clinical medicine, public health, epidemiology, demography, and social sciences. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Culture, Ethnicity, and Health: Implications for Oral Biology and Medicine", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ORL BIO 229B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Seminar, one hour; discussion, one hour. What factors determine health, illness, and disease in global context, including political ecology of infectious diseases, child health issues, women's health and reproductive health, global trade in legal and illegal drugs, demography and health transition, structural adjustment, problems associated with globalization of pharmaceutical industry; antibiotic resistance, and globalization and health equity. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Anthropological Perspectives on Global Health: Implications for Oral Biology and Medicine", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ORL BIO 234": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Seminar, two hours. Designed for graduate students. Psychological and physiological processes intertwine, and one important aspect of psychoneuroimmunological research is characterization of mechanisms that underlie these interactions. Examination of current literature on neuroimmune interaction from developmental perspective. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Seminar: Developmental Neuroendocrineimmunology", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ORL BIO 260": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Seminar, one hour. Discussion of peer-reviewed literature readings in basic sciences related to oral biology. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Oral Biology Seminar", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "ORL BIO 273": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Lecture, one hour; discussion, one hour. Forum for discussion of cutting-edge topics in immunology and lymphology from clinical perspective. Emphasis on immune surveillance and lymphatic drainage of oral pathologies associated with AIDS and other diseases. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Research in Clinical Immunology and Lymphology", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ORL BIO 275": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Lecture, two hours; literature review, one hour. Advanced course on prokaryotic and eukaryotic molecular and cell biology, with emphasis on applications in dental research. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Molecular and Cell Biology for Oral Biology Graduate Students", 
        "unit": 3, 
        "unitType": "ABSOLUTE"
    }, 
    "ORL BIO 596": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Tutorial, to be arranged. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Directed Individual Study or Research", 
        "unit": "2 to 8", 
        "unitType": "RANGE"
    }, 
    "ORL BIO 597": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Tutorial, to be arranged. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Preparation for Ph.D", 
        "unit": "4 to 8", 
        "unitType": "RANGE"
    }, 
    "ORL BIO 598": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Tutorial, to be arranged. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Thesis Research and Preparation", 
        "unit": "2 to 8", 
        "unitType": "RANGE"
    }, 
    "ORL BIO 599": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Tutorial, to be arranged. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Research for and Preparation of Ph.D", 
        "unit": "4 to 8", 
        "unitType": "RANGE"
    }, 
    "ORL BIO 99": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Student Research Program", 
        "unit": "1 to 2", 
        "unitType": "RANGE"
    }, 
    "ORL BIO M204": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "(Same as Neuroscience M233.) Lecture, two hours. Advanced treatment of neuroanatomical, neurophysiological, and biochemical bases of pain perception. Topics include classical pain theories, pain receptors and pathways, endogenous mechanisms of pain modulation, and pharmacological basis for treatment of pain disorders. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Mechanisms and Relief of Pain", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "ORL BIO M256": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "ORL BIO", 
        "departmentFullName": "Oral Biology", 
        "description": "(Same as Community Health Sciences M256, Medicine M256, and Nursing M298.) Lecture, three hours; discussion, one hour. Designed to instill in professional students ideas of common emergency health problems and coordinated response, with specific attention to bioterrorism. Examination of tools to help students prevent, detect, and intervene in infectious disease emergencies. Interdisciplinary sessions also attended by students in Schools of Medicine, Nursing, and Public Health during weeks two through five. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Interdisciplinary Response to Infectious Disease Emergencies: Dentistry Perspective", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }
}