{
    "PUB PLC 102": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. Idea that individuals are capable of acting rationally, in their own interest, is central to economic theory and to custom, law, and common sense thinking. Economics offers thorough account of ways in which such people should deal with choice, risk, and time. Casual observation and experimentation agree that actual behavior deviates in systematic ways from prescriptive model of rationality. Groups of rationally seeking individuals might fail to act as rationally self-seeking groups. Consideration of deviations between rational choices and actual behavior in public policies. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Imperfect Rationality", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 103": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, four hours; outside study, eight hours. Study of ethical and moral questions that arise in public life. Goal is not to imbue students with a given body of factual knowledge or to develop new quantitative or social science methodologies to analyze such questions, but to enhance their critical thinking skills. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Ethics, Morality, and Public Life: Contemporary Controversies", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 104": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. Exploration of two pieces of the puzzle in modern urban life: the different communities that live here (and in most other major cities) and political structure that binds us all together. Who are the communities living here? How do they organize themselves and develop leaders? How does integration into mainstream take place? What is \"mainstream\" today? How does political structure help or impede the notion of a united city? Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Culture and Political Structure of Los Angeles", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 105": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours. Examination of prevailing models, theories, and practices of leadership in public settings and application of them through case studies, films, and situational articles. Participation in group projects and discussions designed to improve understanding of role of leadership in mobilizing people groups to do difficult work. Introduction to literature and theory on leadership, examination of leadership and group dynamics, and challenge of leadership in times of stress and change. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Leadership in Public Interest", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 10A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; workshops and outside study, three hours. Overview of principal topics of contemporary policy analysis, developing their applications with examples from instructor's own research, visitors, small student projects, or field trips. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Public Policy", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 10B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. Application of policy analysis to California issues. Guest lectures from practitioners and academics along with readings and videos. Student written reports and oral presentations required. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "California Policy Issues", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 10C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, twelve hours. Application of policy analysis, including critical analysis, problem solving, and substantive policy research, to develop knowledge and understanding about drug and crime policy, with focus on cannabis. Guest lectures by instructors and guest academics and practitioners, with readings from academic literature and policy reports. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Public Policy for Crime, Cannabis, and Other Drugs", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 10D": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, film review, and field/volunteer work, nine hours. Application of policy analysis to issues and solutions concerning homelessness. Guest lectures from local policymakers. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Public Policy and Urban Homelessness", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 112": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. Focus on several controversial topics in contemporary education. Topics vary each year and include multiculturalism, affirmative action, test score gap, bilingual education, and school choice. Introduction to major arguments for and against several important education policies and to encourage students to critically evaluate logic and evidence behind these policies. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Controversies in Education Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 113": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours. Every modern nation faces similar health system challenges, such as promoting health and longevity, providing effective treatments, balancing benefits and burdens of medical technology, and controlling healthcare costs that grow faster than national income. U.S. seems uniquely disadvantaged with lower life expectancy, problematic quality of medical services, lack of insurance for millions, and highest costs in world, hampering families, businesses, and government. What political dynamics produced this result and influence possibility and direction of ongoing policy change? Examination of meaning of health and healthcare; international experience; current status, organization, and financing of U.S. healthcare system; and factors that affect national health policymaking, including comprehensive healthcare reform: framing of problems, role of public opinion, influence of interest groups, composition and organization of Congress, and opportunities for and applications of presidential leadership. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Politics of U.S", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 125": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; discussion, one hour. Exploration of race-based affirmative action from moral, political, and social philosophy standpoint. Topics include defining discrimination, individual and group equality; different meanings of \"diversity\"; meritocracy and its critics; historical and future-based arguments; sociology of values; possibilities for moral compromise. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Rights and Wrongs of Affirmative Action", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 141": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. Requisite: course 10A. Introduction to current public policy issues in employment, labor relations, and labor markets. Historical context for current employment and labor policies in the U.S. Pro and con philosophical analysis of reasons for government regulation. Analysis of current data on labor unions, the workplace, and labor-market trends. Workforce diversity, education and training, social welfare policy, and global issues (immigration, trade, and global economy as it affects the workforce). Future trends and issues on policy horizon. Letter grading.", 
        "prerequisiteDescription": "course 10A", 
        "prerequisites": [
            [
                "PUB PLC 10A"
            ]
        ], 
        "title": "Employment and Labor Policy: Survey", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 145": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. Requisite: course 10A. Insight into evolution of labor policies in the U.S. from 19th century to the present. Exploration of important policy areas such as child labor, labor standards, protective legislation for women workers, industrial relations, civil rights, occupational safety and health, and international labor standards in (1) historical context (economic, political, and social factors that shaped the debate), (2) motivation and action of major players (business, labor, government), and (3) changing patterns of government involvement in public policy. Letter grading.", 
        "prerequisiteDescription": "course 10A", 
        "prerequisites": [
            [
                "PUB PLC 10A"
            ]
        ], 
        "title": "Labor Policies in the U.S.: Historical Perspective", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 146": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. Requisite: Philosophy 6 or Political Science 10. Theories of political and legal obligation and their critics; justified disobedience in response to inequality, injustice, and social exclusion; moral and religious pluralism as argument for both obedience and dissent. Letter grading.", 
        "prerequisiteDescription": "Philosophy 6 or Political Science 10", 
        "prerequisites": [], 
        "title": "Democracy, Disobedience, and Dissent", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 148": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. Requisite: course 10A. Introduction to key issues arising at interface between business and government policy. Discussion of why government focuses so intensively on regulating economic outcomes, nature of business/government relationship, business political activity, and major government policies. Topics include economic regulation (industrial policy, antitrust, technology policy); social regulation of business (energy, environment, risk, liability, corporate governance); and corporate social responsibility, business ethics, and green business. Discussion of topics in their historical and political context, with comparison between economic regulation in the U.S. and other countries. Letter grading.", 
        "prerequisiteDescription": "course 10A", 
        "prerequisites": [
            [
                "PUB PLC 10A"
            ]
        ], 
        "title": "Business and Public Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 187": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Seminar, three hours; outside study, nine hours. Requisite: course 10A. Limited to and required of seniors in Public Affairs minor. Production of research project that examines in depth one particular policy issue in its social context, including political pressures involved and problems of implementation. Emphasis on skills of data acquisition and analysis, conceptualization, and written analysis and presentation. Letter grading.", 
        "prerequisiteDescription": "course 10A", 
        "prerequisites": [
            [
                "PUB PLC 10A"
            ]
        ], 
        "title": "Research Seminar: Public Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 188SA": {
        "corequisiteDescription": "HNRS 101E", 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Individual Studies for USIE Facilitators", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 188SB": {
        "corequisiteDescription": "HNRS 101E", 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.", 
        "prerequisiteDescription": "course 188SA", 
        "prerequisites": [
            [
                "PUB PLC 188SA"
            ]
        ], 
        "title": "Individual Studies for USIE Facilitators", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 188SC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.", 
        "prerequisiteDescription": "course 188SB", 
        "prerequisites": [
            [
                "PUB PLC 188SB"
            ]
        ], 
        "title": "Individual Studies for USIE Facilitators", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 189": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 189HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Tutorial, three hours. Limited to students in College Honors and departmental honors programs. Designed as adjunct to upper division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Contracts", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 19": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Fiat Lux Freshman Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 191A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Seminar, three hours; outside study, nine hours. Examination of particular subfields of policy studies (e.g., international policy, crime policy, policy history) in depth, with specific topics to be identified by instructor. Reading, discussion, and development of culminating project. Must be taken for credit if applied toward Public Affairs minor. May be repeated for credit with topic change. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Variable Topics Research Seminars: Public Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 191B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Seminar, three hours; outside study, six hours. Examination of particular subfields of policy studies (e.g., international policy, crime policy, policy history) in depth, with specific topics to be identified by instructor. Reading, discussion, and development of culminating project. Must be taken for credit if applied toward Public Affairs minor. May be repeated for credit with topic change. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Variable Topics Research Seminars: Public Policy", 
        "unit": 3, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 191C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Seminar, two hours; outside study, four hours. Examination of particular subfields of policy studies (e.g., international policy, crime policy, policy history) in depth, with specific topics to be identified by instructor. Reading, discussion, and development of culminating project. Must be taken for credit if applied toward Public Affairs minor. May be repeated for credit with topic change. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Variable Topics Research Seminars: Public Policy", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 191D": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Seminar, one hour; outside study, two hours. Examination of particular subfields of policy studies (e.g., international policy, crime policy, policy history) in depth, with specific topics to be identified by instructor. Reading, discussion, and development of culminating project. Must be taken for credit if applied toward Public Affairs minor. May be repeated for credit with topic change. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Variable Topics Research Seminars: Public Policy", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 193A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Seminar, two hours. Limited to undergraduate students. Attendance at biweekly Marschak Colloquium presentations, highly regarded and long-standing interdisciplinary lecture series given by leading social science experts, required. Discussion of lecture topics and research models in behavioral sciences. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Marschak Colloquium: Social Sciences", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 197": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Tutorial, four hours. Preparation: 3.0 grade-point average. Limited to juniors/seniors. Individual intensive study, with scheduled meetings to be arranged between faculty member and student. Assigned reading and tangible evidence of mastery of subject matter required. May be repeated for credit. Individual contract required. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Individual Studies in Public Policy", 
        "unit": "2 or 4", 
        "unitType": "RANGE"
    }, 
    "PUB PLC 201": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. First course in two-term sequence (see course 204) to prepare students for economic analysis of public policy, with review of economic principles and basic microeconomic theory and policy applications. Consumer theory and demand, producer theory and supply, equilibrium of product and factor markets. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Principles of Microeconomic Theory I", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 202": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. Designed to provide background necessary to develop strategies for dealing effectively with political environment of policy and administration. Discussion of U.S. constitutional arrangements, followed by instrumental and integrative examination of primary institutions of politics and governance from organized interests to legislatures, bureaucracies, and courts. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "American Political Institutions and Processes", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 203": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. First course in two-term sequence (see course 208). Review of statistical principles useful to policy research and analysis. Topics include descriptive statistics, expectations, univariate distribution, probability, covariance and correlations, statistical independence, random sampling, estimators, unbiasedness and efficiency, statistical inference, confidence intervals, and hypothesis testing. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Statistical Methods of Policy Analysis I", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 204": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. Requisite: course 201. Second course in two-term sequence (see course 201) covering both theory and policy applications. Topics include monopoly, factor markets, general equilibrium, welfare economics, externalities, public goods, uncertainty, and intertemporal optimization. Letter grading.", 
        "prerequisiteDescription": "course 201", 
        "prerequisites": [
            [
                "PUB PLC 201"
            ]
        ], 
        "title": "Principles of Microeconomic Theory II", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 205": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. Examination of leadership role of executives in public service as they lead and manage in tough day-to-day world of politics and intensive public scrutiny. Heavy emphasis on case studies that focus on what public managers do, political and organizational environment in which they find themselves, and skills they need both inside and outside their organization to get things done with high degree of competence and integrity. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Institutional Leadership and Public Manager", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 206": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. Analysis of how policy is formed, adopted, and implemented. How policies are formulated, by whom, how policy agendas are set, how to define relationships between politicians, bureaucrats, lobbyists, and media experts. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Political Economy of Policy Adoption and Implementation", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 207": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. Examination of political, legal, and social institutions to show where the U.S. fits in among varieties of modern capitalism and business/government relations. Analysis of domestic policy options nations are pursuing in response to economic globalization, such as protectionism, mercantilism, and deregulation. Introduction to international coalitions being formed, including NAFTA, and to nongovernmental organizations created to deal with special problems such as global environmental crisis. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "International Political Economy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 208": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. Requisite: course 203. Second core course in statistics and quantitative methods for M.P.P. degree. Quantitative studies of public policy, covering regression analysis and its application to public policy questions. Letter grading.", 
        "prerequisiteDescription": "course 203", 
        "prerequisites": [
            [
                "PUB PLC 203"
            ]
        ], 
        "title": "Statistical Methods of Policy Analysis II", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 209": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. Focus on practical management skills to prepare students for workplace. Examination of design, management, and leadership of teams in organizational settings, decision-making strategies in face of challenges, and negotiation as invaluable skill. Examples from public and private sectors, as well as experiential learning through exercises, cases, and simulations. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Management in the 21st Century", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 210": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. Preparatory course that precedes three-term 298A, 298B, 298C sequence in which students prepare major public policy projects and papers that are case studies of policy evaluation and implementation and are equivalent to professional master's theses. Papers build on prior core courses, internship experience, and policy cluster courses. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Methods of Policy Analysis", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 211": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; discussion, one hour. Limited to graduate students. Introduction to some basic normative categories, arguments, and tools essential for addressing questions of public policy. Normative questions are those that concern whether actions, characters, or states of world are right or wrong -- or, in less absolute cases, better or worse than possible alternatives. Allegedly value-free methods of analysis do not help decide policy questions. Certain policy questions raise normative concerns sooner or more urgently than others: those that go beyond matters of economic efficiency and touch on questions of human dignity, equality, justice, or national or cultural traditions. Some questions that seem to be subject to efficiency analysis raise some strong ethical concerns distinct from those of efficiency. Discussion of disagreement that exists over both what efficiency is and in what cases or across what dimensions it ought to govern. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Normative Issues in Policy Analysis", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 225": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Seminar, three hours; outside study, nine hours. Limited to graduate students. Examination of policies that may reduce socioeconomic and ethnic disparities in educational success. Topics include international and national comparisons of educational outcomes, private and public school choice, school accountability policies, interventions to improve school or teacher quality, parenting and preschool interventions, and supplemental educational services. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Education Policy and Education Inequality", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 233": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. Designed for graduate students. Drawing on resources of UCLA Business Forecasting Project, introduction to general features of California labor market, analysis of employment fluctuations and forecasting techniques including linkages between employment fluctuations in California and elsewhere in the country, and social issues related to labor market. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Employment Issues in California", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 234": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. Examination of analytical tools and conceptual models needed to understand policies directed toward people in lower tail of income distribution. Concepts include static and dynamic labor supply, labor demand, compensating differentials, human capital, and economic models of immigration and crime. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Labor Markets and Social Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 237": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. Introduction to moral issues that commonly arise in public life. Ethics of political roles, compromise and moral integrity, lying and deception, place of rhetoric in defending stand on issues, politics and violence. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Ethical Questions in Public Life", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 238": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Seminar, three hours; outside study, nine hours. Designed for graduate students. Survey of role of policy in shaping forms and meanings of culture and cultural activities in contemporary society. Overview of relevant theories of culture and their ramifications in such phenomena as consciousness, ideology, and identity. Empirical examination of what policymakers have said and done about promotion of culture in interests of various social goals. Contemporary trend of economic and cultural intersecting to be subject for trend analysis. Examination of globalization and national cultural interests in depth. General debate about logic and meaning of cultural politics in contemporary society and their consequences for trajectories of cultural policy at local, national, and international levels. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Issues in Cultural Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 242": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. Survey of regional development, with special reference to \"new economic geography\" and its relevance for formulation of local economic development policies. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Regional Development, Urbanization, and Industrial Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 251": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. Limited to graduate students. How financial resources are allocated through budget processes at federal, state, and local levels of government in the U.S. and how each level of government finances its operations and capital investment programs, with particular attention to California. Students are organized into small groups to facilitate review of assigned readings and to report key information to class. Based on assigned readings, development of budget strategy matrix outlining best practices budget strategies to use in various resources availability contexts. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Public Budgeting and Finance", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 271": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. Limited to graduate students. Examination of how urban labor markets function, particularly low-skill labor markets, and exploration of how public and private interventions affect outcomes for disadvantaged populations. In first half of course, major theories of low-skill workers' labor market problems in employment and wages; in second half, employment and training programs, policy initiatives and implementation, and new directions in workforce development. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Urban Poverty, Workforce Development, and Public Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 290": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Discussion, three hours. Advanced seminar on emerging issues in public policy. May be repeated for credit. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Topics in Public Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 294": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours. Designed for graduate students. Provides set of tools that can be used to analyze pressing policy questions in field of education and some substantive background in policy issues of the day. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Education Markets and Education Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 297A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Seminar, two hours. Limited to graduate students. Students attend biweekly Marschak Colloquium presentations given by leading social science experts. Analysis and discussion of lecture topics and research models in behavioral sciences in this highly regarded and long-standing interdisciplinary lecture series that meets separately from colloquium presentations. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Marschak Colloquium: Policy Implications in Behavioral Sciences", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 297B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; discussion, one hour. Designed for graduate students. Introduction to purposes and methods of public policy analysis. Exposure to key concepts and tools, such as market failures, decision analysis, cost/benefit analysis, group behavior, and implementation. Case studies supplement lectures and texts. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Public Policy", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 297C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Activity, two hours. Limited to second-year M.P.P. students. Venue for policymakers, practitioners, and academics to present, discuss, and analyze current policy questions. Attending, formally analyzing, and engaging with policy professionals at these extra-curricular programs adds to pedagogical and intellectual maturity of students as they gain greater understanding of complexity of public policy issues by hearing wide variety of voices. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Public Policy Analysis Lectures", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 297D": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Seminar, two hours; discussion, one hour. Weekly social science research lectures covering range of policy-relevant topics and discussion of research findings with professor. Examination of quality and relevance of research findings and connections between research, public policy curriculum, and real-world policy problems. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Public Policy Seminar Series", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 298A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Seminar, 90 minutes; outside study, four and one half hours. Requisite: course 210. Limited to M.P.P. students. First course of year-long sequence designed to ensure that students and their teams are fully prepared to launch their projects at start of Winter Quarter. Students form teams that are assigned to seminars and instructors, identify clients, select and refine policy questions motivating their projects, develop and refine basic work plans, learn about various methods of data collection, and complete and submit all necessary forms required for human subjects research. S/U grading.", 
        "prerequisiteDescription": "course 210", 
        "prerequisites": [
            [
                "PUB PLC 210"
            ]
        ], 
        "title": "Applied Policy Project I", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 298B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Seminar, three hours; outside study, 15 hours. Preparation: completion of M.P.P. core curriculum, two policy cluster courses, and internship (unless waived). Requisite: course 298A. Second course in three-term sequence in which students prepare major public policy projects and papers that are case studies of policy evaluation and implementation and are equivalent to professional master's theses. Papers build on prior core courses, internship experience, and policy cluster courses. Letter grading.", 
        "prerequisiteDescription": "course 298A", 
        "prerequisites": [
            [
                "PUB PLC 298A"
            ]
        ], 
        "title": "Applied Policy Project II", 
        "unit": 6, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 298C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Seminar, two hours. Preparation: completion of M.P.P. core curriculum, two policy cluster courses, and internship (unless waived). Requisite: course 298B. Third course in three-term sequence in which students complete research and report writing for their year-long projects, conduct oral presentations of their applied policy projects, and give written feedback on other student presentations. Letter grading.", 
        "prerequisiteDescription": "course 298B", 
        "prerequisites": [
            [
                "PUB PLC 298B"
            ]
        ], 
        "title": "Applied Policy Project III", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 375": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Seminar, to be arranged. Preparation: apprentice personnel employment as teaching assistant, associate, or fellow. Teaching apprenticeship under active guidance and supervision of regular faculty member responsible for curriculum and instruction at UCLA. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Teaching Apprentice Practicum", 
        "unit": "1 to 4", 
        "unitType": "RANGE"
    }, 
    "PUB PLC 496": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Fieldwork, four hours. Public policy internships for Master of Public Policy (M.P.P.) and M.P.P./dual degree students. May not be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Public Policy Internships", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 501": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Preparation: consent of UCLA department chair and graduate dean, and host campus instructor, department chair, and graduate dean. Used to record enrollment of UCLA students in courses taken under cooperative arrangements with USC. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Cooperative Program", 
        "unit": "2 to 8", 
        "unitType": "RANGE"
    }, 
    "PUB PLC 596": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Tutorial, to be arranged. Limited to graduate students. Individual programming for selected students to permit pursuit of a subject in greater depth. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Directed Studies", 
        "unit": "2 to 8", 
        "unitType": "RANGE"
    }, 
    "PUB PLC 89": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 89HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Tutorial, three hours. Limited to students in College Honors and departmental honors programs. Designed as adjunct to lower division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Contracts", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC 99": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Student Research Program", 
        "unit": "1 to 2", 
        "unitType": "RANGE"
    }, 
    "PUB PLC C101": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. Introduction to drug abuse as social problem and to drug abuse control as policy issue, with examination of both necessity and difficulty of making and executing wise policies around psychoactive substances. Concurrently scheduled with course C235. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Drug Abuse Control Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC C115": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours. Requisites: Economics 11, 143. Survey of ways economics is used to define, analyze, and resolve problems of environmental management. Overview of analytical questions addressed by environmental economists that bear on public policies. Concurrently scheduled with course CM250. Letter grading.", 
        "prerequisiteDescription": "Economics 11, 143", 
        "prerequisites": [], 
        "title": "Environmental and Resource Economics and Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC C119": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. Design, implementation, and evaluation of policies to control crime. Operations of major institutions within criminal justice system. Theories of crime causation and prevention and their relationship to impacts of alternative policies. Concurrently scheduled with course C219. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Crime Control Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC C124": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. Examination of politics of public budgeting in the U.S., with emphasis on financing of social safety net. Exploitation of budgetary process as setting both for gaining substantive knowledge about how government really works and for developing political skills required to influence resource allocation decisions. Concurrently scheduled with course C239. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Budget Politics, Social Policy, and Entitlement Reform", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC C147": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. To enable students to (1) think of world in dynamic terms, (2) be able to map, divide, and assemble world in many different ways, and (3) be able to articulate patterns of flux, change, and movement in world space and history. Concurrently scheduled with course C245. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Critical Policy Issues and Problems in Globalizing World", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC C219": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. Design, implementation, and evaluation of policies to control crime. Operations of major institutions within criminal justice system. Theories of crime causation and prevention and their relationship to impacts of alternative policies. Concurrently scheduled with course C119. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Crime Control Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC C235": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. Introduction to drug abuse as social problem and to drug abuse control as policy issue, with examination of both necessity and difficulty of making and executing wise policies around psychoactive substances. Concurrently scheduled with course C101. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Drug Abuse Control Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC C239": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. Examination of politics of public budgeting in the U.S., with emphasis on financing of social safety net. Exploitation of budgetary process as setting both for gaining substantive knowledge about how government really works and for developing political skills required to influence resource allocation decisions. Concurrently scheduled with course C124. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Budget Politics, Social Policy, and Entitlement Reform", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC C245": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "Lecture, three hours; outside study, nine hours. To enable students to (1) think of world in dynamic terms, (2) be able to map, divide, and assemble world in many different ways, and (3) be able to articulate patterns of flux, change, and movement in world space and history. Concurrently scheduled with course C147. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Critical Policy Issues and Problems in Globalizing World", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC CM182": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Formerly numbered C182.) (Same as Electrical and Computer Engineering CM182.) Lecture, three hours. Recent and continuing advances in science and technology are raising profoundly important public policy issues. Consideration of selection of critical policy issues, each of which has substantial ethical, social, economic, political, scientific, and technological aspects. Concurrently scheduled with course CM282. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Science, Technology, and Public Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC CM250": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Urban Planning M267.) Lecture, three hours. Requisites: courses 204 and 208, or Urban Planning 207 and 220B. Survey of ways economics is used to define, analyze, and resolve problems of environmental management. Overview of analytical questions addressed by environmental economists that bear on public policies. Concurrently scheduled with course C115. Letter grading.", 
        "prerequisiteDescription": "courses 204 and 208, or Urban Planning 207 and 220B", 
        "prerequisites": [], 
        "title": "Environmental and Resource Economics and Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC CM282": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Formerly numbered C282.) (Same as Electrical Engineering CM282.) Lecture, three hours. Recent and continuing advances in science and technology are raising profoundly important public policy issues. Consideration of selection of critical policy issues, each of which has substantial ethical, social, economic, political, scientific, and technological aspects. Concurrently scheduled with course CM182. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Science, Technology, and Public Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M120": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as African American Studies M120.) Lecture, three hours; discussion, one hour. Background in economics, sociology, or urban studies preferred but not required. Survey course to examine major debates and current controversies concerning public policy responses to social problems in urban America. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Race, Inequality, and Public Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M127": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Political Science M142D.) Lecture, three or four hours; discussion, one hour (when scheduled). Recommended preparation: Political Science 10, 40, and one course from Economics 1, 2, 5, 11, or 101. Examination of how public issue life cycle is shaped by (1) economic and political incentives of various actors -- business, news media, mass public, organized interests, Congress, the president, regulatory agencies, and courts and (2) ideology, cognitive biases, and ethical reasoning. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Understanding Public Issue Life Cycle", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M149": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Environment M135 and Urban Planning M163.) Lecture, three hours. Examination of specific environmental challenges that California faces. Microeconomic perspective used, with special emphasis on incentives of polluters to reduce their pollution and incentives of local, federal, and state government to address these issues. Focus on measurement and empirical hypothesis testing. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "California Sustainable Development: Economic Perspective", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M212": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Social Welfare M290J.) Lecture, three hours. Development of social policy as it affects families and children from different cultural backgrounds and as it is given form in public child welfare system. Examination of development of infrastructure to support needs of children and families. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Child Welfare Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M213": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Social Welfare M290K.) Lecture, three hours. Examination of evolution of social policy and services for mentally ill, with emphasis on political, economic, ideological, and sociological factors that affect views of mentally ill and services they are provided. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Mental Health Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M214": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Social Welfare M290L and Urban Planning M246.) Lecture, three hours. Major policy and research issues concerning poverty and social welfare policy directed toward poor in U.S. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Poverty, Poor, and Welfare Reform", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M215": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Social Welfare M290M.) Lecture, three hours. Introduction to contemporary issues in healthcare financing and delivery, providing historical perspective on emergence of these issues. Examination of major public programs and their relationship to issues of access and cost. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Health Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M216": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Social Welfare M290N.) Lecture, three hours. Policy issues that affect children and adolescents in relation to their interaction with schools and community, with emphasis on impact of policy across federal, state, and local levels. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Public Policy for Children and Youth", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M218": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Urban Planning M204.) Lecture, three hours; outside study, nine hours. Limited to graduate students. How to become more sophisticated consumers and producers of qualitative and quantitative policy research. In first half of course, formal principles of research design; in second half, various data collection methods, including ethnography, interviewing, and survey design. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Research Design and Methods for Social Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M220": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Urban Planning M250.) Lecture, three hours. Historical evolution of urban form and transportation systems, intrametropolitan location theory, recent trends in urban form, spatial mismatch hypothesis, jobs/housing balance, transportation in strong central city and polycentric city, neotraditional town planning debate, rail transit and urban form. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Transportation and Land Use: Urban Form", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M221": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Urban Planning M253.) Lecture, three hours. Requisites: courses 201 and 203, or Urban Planning 207 and 220B. Descriptions of travel patterns in metropolitan areas, recent trends and projections into future, overview of travel forecasting methods, trip generation, trip distribution, mode split traffic assignment, critique of traditional travel forecasting methods and new approaches to travel behavior analysis. Letter grading.", 
        "prerequisiteDescription": "courses 201 and 203, or Urban Planning 207 and 220B", 
        "prerequisites": [], 
        "title": "Travel Behavior Analysis", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M222": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Urban Planning M256.) Lecture, three hours. Overview of transportation finance and economics; concepts of efficiency and equity in transportation finance; historical evolution of highway and transit finance; current issues in highway finance; private participation in road finance, toll roads, road costs and cost allocation, truck charges, congestion pricing; current issues in transit finance; transit fare and subsidy policies, contracting and privatization of transit services. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Transportation Economics, Finance, and Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M223": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Urban Planning M258.) Lecture, three hours. Regulatory structure linking transportation, air quality, and energy issues, chemistry of air pollution, overview of transportation-related approaches to air quality enhancement; new car tailpipe standards; vehicle inspection and maintenance issues; transportation demand management and transportation control measures; alternative fuels and electric vehicles; corporate average fuel economy and global warming issues; growth of automobile worldwide fleet; automobile in sustainability debate. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Transportation and Environmental Issues", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M224A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Urban Planning M206A.) Lecture, three hours; laboratory, one hour. Preparation: one graduate-level statistics course, familiarity with one packaged statistics program. Principles of Geographic Information Systems (GIS) and applied techniques of using spatial data for mapping and analysis. Topics include data quality, data manipulation, spatial analysis, and information systems. Use of mapping and spatial analysis to address planning problem. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Geographic Information Systems", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M224B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Urban Planning M206B.) Studio, three hours. Requisite: course M224A or Urban Planning M206A. Advanced topics in geographic information systems (GIS) utilizing geoprocessing tools in ArcMap, map design, and spatial analysis. Letter grading.", 
        "prerequisiteDescription": "course M224A or Urban Planning M206A", 
        "prerequisites": [], 
        "title": "Advanced Geographic Information Systems", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M226": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Social Welfare M290V and Urban Planning M286.) Lecture, three hours; outside study, nine hours. Designed for graduate students. Fundamental building blocks for successful management in nonprofit sector. Students develop management skills in strategic thinking/problem solving, project management, team building, and negotiation. Use of case studies to troubleshoot critical challenges, from finance to crisis management to marketing, that nonprofit managers typically face. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Management Challenges and Tools for Nonprofit Sector", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M227": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Social Welfare M290S and Urban Planning M287.) Lecture, three hours; outside study, nine hours. Use of political economy perspective to analyze forces that have shaped rise and characteristics of nonprofit sector and its constituent elements. Examination of social history of nonprofit sector in U.S. Exploration of legal and policy environments and distinct organizational forms. Comparative perspective between U.S. and other countries. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Politics, Power, and Philanthropy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M228": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Social Welfare M241E and Urban Planning M288.) Lecture, three hours; outside study, nine hours. Designed for graduate students. Various patterns of community action for attaining social welfare objectives; research and field experience directed toward study of social problems within context of community planning; emerging patterns of physical, economic, and social planning within framework of social change theory. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Leadership, Development, and Governance of Nonprofit Organizations", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M229": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Management M225.) Lecture, three hours. Introduction to important legal, financial, and management issues confronting nonprofit organizations. Topics include how to start nonprofit tax-exempt organizations, qualifying and maintaining tax-exempt status under IRC Code Section 501(c)(3), corporate governance, political and legislative activity restrictions, and strategic planning, fundraising, nonprofit accounting, and employment law. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Law and Management of Nonprofit Organizations", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M240": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Geography M230A and Urban Planning M236A.) Lecture, three hours; discussion, one hour. Introduction to theories of location of economic activity, trade, and other forms of contact between regions, process of regional growth and decline, reasons for different levels of economic development, relations between more and less developed regions. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Theories of Regional Economic Development I", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M241": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Urban Planning M230.) Lecture, three hours. Critical and historical survey of evolution of regional planning theory and practice, with particular emphasis on relations between regional planning and developments within Western social and political philosophy. Major concepts include regions and regionalism, territorial community, and social production of space. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Regional Planning", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M243": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Social Welfare M290U and Urban Planning M275.) Lecture, three hours; outside study, nine hours. Designed for graduate students. Examination of role of U.S. housing policy and role of government agencies and community organizations. Is problem housing or economic development? Should interventions be directed toward inner city housing markets or through neighborhood strategies? What lessons can be learned from experiences of other countries? Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Community Development and Housing Policies: Roles of State, Civil Society, and Nonprofits", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M244": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Urban Planning M255.) Lecture, three hours. Introduction to analysis, management, and operation of transportation systems. Topics include evaluating transportation system performance, causes and management of traffic congestion, transportation systems and demand management, complete streets, goods movement, shipping, aviation, and high-speed rail policy and planning, public transportation planning, transportation services for elderly and disabled, and intelligent transportation systems. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Transportation Policy and Planning", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M246": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Political Science M268B.) Seminar, three hours. Examination of both empirical and normative questions from rich variety of perspectives for scholars in all subfields of political science as well as policy students and others interested in these issues. Consideration of topics fundamental to both democratic theory and study of American politics -- public opinion; nature and purpose of elections; representation; parties; and purpose of democracy as whole -- through both classic political theory treatments and modern research in American political behavior. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Electoral Democracy: Theory and Behavior", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M247": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Social Welfare M241F and Urban Planning M290.) Lecture, three hours; outside study, nine hours. Designed for graduate students. Technical processes of problem solving regarding substantive social welfare problems at community level. This form of community practice fills niche between professional and knowledge and skill set possessed by agency and program administrators on one hand and by policy analysts and policymakers on other. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Strategic Planning for Public and Nonprofit Organizations", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M248": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Political Science M216.) Seminar, three hours. Prior experience in political or legal theory helpful. Exploration of both abstract concepts of toleration and contemporary disputes. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Toleration, Pluralism, and Diversity", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M252": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Urban Planning M263.) Lecture, three hours. Introduction to basic concepts and methods of environmental analysis covering variety of topics with cross-disciplinary perspectives. Development of ability to analyze major environmental and resource issues as well as to read, discuss, and write critically about environmental policy. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Environmental Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M253": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Law M675.) Lecture, three hours. Exploration of relevance of public policy research to lesbian, gay, bisexual, and transgender (LGBT) legal issues. Topics include LGBT identity and demographics, legal recognition of same-sex couples, parenting, workplace discrimination, transgender rights, intersections of race and sexuality, LGBT youth and safe schools, LGBT health disparities, and Don't Ask, Don't Tell. Discussion of social science research that has informed various areas of LGBT law. Themes include doctrinal and other reasons why research has become more central to LGBT legal advancements in past decade, different types of public policy research, limitations of current data and research on LGBT issues, difficulties in translating social science research into evidence in courtroom, impact that dominant LGBT rights frame of equality has on social science research, challenges in conducting objective research, and effective presentation of social science research before legislators, judges, juries, media, and other audiences. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Lesbian, Gay, Bisexual, and Transgender Law and Public Policy Research", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M260": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Social Welfare M221A and Urban Planning M241.) Lecture, two hours; discussion, one hour; outside study, nine hours. Nature, roles, and history of welfare institutions in different societies; applicable social system theory of different components of welfare system; theory and research about welfare policies and organizational forms. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Foundations of Social Welfare Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M261": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Social Welfare M290P.) Lecture, three hours; outside study, nine hours. Designed for graduate students. Examination of theoretical models and concepts of policy process and application to aging policy. Analysis of decision-making processes that affect social policies. Description of historical development of contemporary policy. Exploration of current proposals and issues. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Aging Policy, Elderly and Families", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M266": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Health Policy M249E.) Seminar, four hours. Requisites: Health Policy 200A, 200B, M236. Advanced treatment of number of topics in health economics, including mental health economics, pharmaceutical economics, and relationship between labor supply, welfare, and health. Letter grading.", 
        "prerequisiteDescription": "Health Policy 200A, 200B, M236", 
        "prerequisites": [], 
        "title": "Advanced Topics in Health Economics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M267": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Health Policy M252.) Lecture, three hours; outside study, nine hours. Designed for graduate students. Analytical and managerial skills learned earlier to be used to analyze problems with existing Medicare program and to develop specific options for reforming features of program to accommodate coming pressures generated by retirement of baby-boom generation. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Medicare Reform", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M268": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Health Policy M236.) Lecture, four hours; discussion, two hours. Preparation: intermediate microeconomics. Requisite: Biostatistics 100A. Microeconomic aspects of healthcare system, including health manpower substitution, choice of efficient modes of treatment, market efficiency, and competition. Letter grading.", 
        "prerequisiteDescription": "BIOSTAT 100A", 
        "prerequisites": [], 
        "title": "Microeconomic Theory of Health Sector", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M269": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Health Policy M269.) Seminar, three hours; outside study, nine hours. Exploration of demand for health insurance, policies for public insurance (Medicaid and Medicare), uninsured, and health insurance reform. Examination of effects of managed care on health and costs, consumer protection movement, and rise of competitive healthcare markets. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Healthcare Policy and Finance", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M270": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as American Indian Studies M200D.) Seminar, two hours; discussion, one hour. Limited to graduate students. Introduction to basic economic concepts and their application to issues of economic development in indigenous communities. Coverage of microeconomic and macroeconomic aspects of economic development using current and existing research. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Economic Principles and Economic Development in Indigenous Communities", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M280A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Management-PhD M251.) Lecture, three hours. Examination of research and development as process and as element of goal-oriented organization. Factors affecting invention and innovation; transfer of technology; organizational and behavioral considerations; coupling of science, technology, and organizational goals; assessing of and forecasting technological futures. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Research and Development Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M280B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Management M292B.) Lecture, three hours. Economic growth and change. Role of advances in science and technology, and actions of maximizing innovators and factors impinging on their behavior. How technological breakthroughs (or discontinuities) can form new industries or transform nature of and population of firms in existing industries. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Growth, Science, and Technology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M281": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Management M293A.) Lecture, three hours. Evaluation of certain criticisms made by business of American political system. Designed to provide clearer understanding of principal features of American politics, especially as they influence business enterprise. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Political Environment of American Business", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M286": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Urban Planning M268.) Lecture, three hours. Acquisition and utilization of economic, finance, planning, and policy analytic tools needed to evaluate factors that drive market adoption from early to middle market phases. Rooftop solar, electric vehicle, and energy efficiency as focal examples, with emphasis on role of policy and planning incentives intended to spur adoption. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Policy Analysis of Emerging Environmental Technologies", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M289A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Education M289A, Political Science M287A, and Sociology M290A.) Seminar, four hours. Examination of metropolitan American society and institutions at beginning of 21st century. Consideration of best available information on patterns of settlement, changing functions of urban space and institutions, and issues of opportunity linked to urban structure in society facing unprecedented demographic change that will end primarily European domination of our society by mid-century, creating democracy with no racial or ethnic majority. How this demographic transition and postindustrial transformation of urban functions and space interact to shape opportunity and inequality. Vast economic transformations, brought about by globalization of workplace and dramatic decline of industrial employment in advanced nations, not only greatly raise stakes on creating equal opportunity but also cut off what were previously extremely important parts of intergenerational mobility. In Progress grading (credit to be given only on completion of course M289B).", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Immigration, Racial Change, and Education in 21st-Century Metropolis", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M289B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Education M289B, Political Science M287B, and Sociology M290B.) Seminar, four hours. Examination of metropolitan American society and institutions at beginning of 21st century. Consideration of best available information on patterns of settlement, changing functions of urban space and institutions, and issues of opportunity linked to urban structure in society facing unprecedented demographic change that will end primarily European domination of our society by mid-century, creating democracy with no racial or ethnic majority. How this demographic transition and postindustrial transformation of urban functions and space interact to shape opportunity and inequality. Vast economic transformations, brought about by globalization of workplace and dramatic decline of industrial employment in advanced nations, not only greatly raise stakes on creating equal opportunity but also cut off what were previously extremely important parts of intergenerational mobility. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Immigration, Racial Change, and Education in 21st-Century Metropolis", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M293": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Urban Planning M243.) Lecture, three hours; outside study, nine hours. Requisite: course 201. Evaluation of economic and political determinants of trend toward privatizing public services, and equity and efficiency outcomes of this trend as expressed through new pricing, financing, and service-level policies. Exploration of new regulatory role this trend implies for state and local governments. Letter grading.", 
        "prerequisiteDescription": "course 201", 
        "prerequisites": [
            [
                "PUB PLC 201"
            ]
        ], 
        "title": "Privatization, Regulation, and Public Finance", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "PUB PLC M295": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "PUB PLC", 
        "departmentFullName": "Public Policy", 
        "description": "(Same as Social Welfare M290R and Urban Planning M248.) Lecture, three hours. Designed for graduate students. Study of major income-maintenance programs in U.S., with emphasis on interaction of moral attitudes toward poor and structure and implementation of law, policy, and administration. Current reform consensus and major reforms. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Law and Poor", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }
}