{
    "SOC WLF 100A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, four hours. Origin and development of major U.S. social welfare programs and policies guiding them, with emphasis on analysis of policy developments/issues related to provision of social welfare services. Study of historical and current responses of profession to major social problems. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Social Welfare: Policies and Programs", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 100B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, four hours. Requisite: course 100A. Review of existing policy regarding major social issues in field of social welfare. Examination of discrepancy between need and capacity of social agencies to address need. Exploration of differential impact of policy on various populations. P/NP or letter grading.", 
        "prerequisiteDescription": "course 100A", 
        "prerequisites": [
            [
                "SOC WLF 100A"
            ]
        ], 
        "title": "Social Welfare Policy: Overview", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 101": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, four hours. Social policy viewed from perspective of various cultural groups. Students to become aware of their own cultural perspective and learn to recognize similarities and differences in values, perspectives, and beliefs across cultural groups. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Social Welfare in Multicultural Society", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 102": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, four hours. Recommended requisites: courses 100A, 100B. Detailed demonstration of implementation of policy via functioning of human service organizations. Examination of organizational structures/functions. Exploration of characteristics and organization of community and forces that influence its development and change. P/NP or letter grading.", 
        "prerequisiteDescription": "courses 100A, 100B", 
        "prerequisites": [], 
        "title": "Social Welfare Organizations and Community Systems", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 103": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, four hours. Requisites: courses 100A, 100B, 101. Description and demonstration of basic skills employed in direct social work practice via casework process. Students practice these skills in written, role-play, small group, and video or audio exercises. P/NP or letter grading.", 
        "prerequisiteDescription": "courses 100A, 100B, 101", 
        "prerequisites": [], 
        "title": "Introduction to Direct Practice with Individuals, Families, and Groups", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 105": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours; outside study, nine hours. Historical overview of American social policy dealing with three core societal problems: poverty, sickness, and joblessness. Programs developed by governments to ameliorate these problems have typically been public insurance programs or cash transfers such as unemployment insurance, welfare, and Social Security. Collectively these programs are known as \"the welfare state\"; examination of origins of the U.S. welfare state, its development over time, and features that make it distinctive as compared to welfare states in other nations. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Social Welfare Policy in Modern America: Historical Perspectives", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 106": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours; discussion, one hour; outside study, eight hours. Didactic component with focus on development of basic skills in the areas of research. Students select one field of observation experience (module) from a number of field settings. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Research Seminar and Field Observation: Social Welfare", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 107": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours; discussion, one hour; outside study, eight hours. Requisite: course 106. In field practicum students are placed in a specific agency where they combine observation of agency functions with participation in specific agency tasks and roles under instructional supervision of an agency mentor and a UCLA faculty member. P/NP or letter grading.", 
        "prerequisiteDescription": "course 106", 
        "prerequisites": [
            [
                "SOC WLF 106"
            ]
        ], 
        "title": "Field Practicum: Social Welfare", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 130A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Seminar, three hours; service learning, four hours; outside study, five hours. Course 130A is requisite to 130B. Limited to juniors/seniors. History and roles of social welfare policy within government, organizations, and communities. Reflections about service-learning site experiences, with application of issues related to lecture and seminar readings. Students to be assigned to two-term tutoring/mentoring site where they apply tutoring techniques as they assist middle school children living in impoverished areas of Los Angeles County. In Progress grading (credit to be given only on completion of course 130B).", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Community Research and Services Seminar", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 130B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Seminar, three hours; service learning, four hours; outside study, five hours. Requisite: course 130A. Limited to juniors/seniors. History and roles of social welfare policy within government, organizations, and communities. Reflections about service-learning site experiences, with application of issues related to lecture and seminar readings. Students to be assigned to two-term tutoring/mentoring site where they apply tutoring techniques as they assist middle school children living in impoverished areas of Los Angeles County. P/NP or letter grading.", 
        "prerequisiteDescription": "course 130A", 
        "prerequisites": [
            [
                "SOC WLF 130A"
            ]
        ], 
        "title": "Community Research and Services Seminar", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 131": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Seminar, three hours. Limited to juniors/seniors. Current research and policy issues concerning poverty in the U.S., with specific emphasis on single-parent households. Overview of measurements and characteristics of poor people; alternative theoretical explanations of poverty; historical overview of major social welfare policies to combat poverty, particularly Aid to Families with Dependent Children (AFDC) and Personal Responsibility and Work Opportunity Reconciliation Act (PROWA); and critical appraisal of recently enacted state welfare reform policies. Relationship between research knowledge about poverty and current policies, and effects of gender, ethnicity, and class on patterns of poverty and policy responses. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Poverty, Poor, and Welfare Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 132": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours. Limited to juniors/seniors. Theoretical and practical foundation for understanding and depicting demographic composition of communities and for determining community needs. Use of systems theory as organizing framework. Community-level interventions are affected by community's social ecology, culture, economic system, political system, ethnic composition, and class structure. Agencies often seek to define community needs and develop interventions to respond to those needs. Knowledge of community infrastructure necessary for ascertaining its strengths and resources that can be mobilized for addressing and responding to community needs, issues, and concerns. Social service agencies and communities can work together in partnership to enhance quality of community life. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Community Analysis and Community Needs", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 151": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours. Limited to juniors/seniors. Examination of public child welfare system in the U.S. Review of social policies and programs that impact children. History of social policies and programs for children, including discussion of orphanages, foster care, and adoptions. Transformation of public child welfare system into child protection system. Impact of welfare reform on child policies and programs in the U.S. Major programs designed to provide safety net for disadvantaged children, including welfare, food stamps, child care, child support, and children's allowance programs. Review of research and analysis in this area. Overview of social policies and programs that impact children in the U.S. Examination of comparative policies in other countries. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Child Welfare Policy in America", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 162": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Seminar, three hours. Limited to juniors/seniors. Contemporary issues in healthcare financing and delivery and historical perspective on these issues. Role of government in healthcare and ways controversy about this role continues to shape and constrain public policy in health. Major public programs, notably Medicare and Medicaid, and their relationship to issues of access and cost for diverse vulnerable populations. Various public and private approaches to healthcare reform and ways of thinking about their predicted impact, cost, and political feasibility. Issues in care of persons with chronic illness and debate about public and private approaches to long-term care reform. Social work roles in healthcare policy and practice. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Health Policy and Services", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 163": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, four hours. Limited to juniors/seniors. Prevention of substance use and related harms from legal and illegal substances is major concern to parents, communities, and nations. Examination of research related to patterns of drug use and related harm (such as crime and mental health disorders) and effectiveness of interventions to reduce these problems. Through review of science-based programs and policies, evaluation of effectiveness of evidence-based interventions to increase student knowledge, skills, and expertise in determining effective interventions to reduce drug-related harm, using most up-to-date information. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Prevention of Risky Substance Use and Related Problems", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 164": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours. Limited to juniors/seniors. Examination of various approaches to HIV prevention, drawing on infectious disease paradigms from public health and theories of behavior change from fields of psychology, sociology, and communications. Sexual behavior and injection drug use, existing and promising technologies to reduce HIV transmission, and fiscal, cultural, ethical, and moral dilemmas in allocation of prevention resources. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "HIV Prevention in U.S", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 181": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Formerly numbered C181.) Lecture, three hours; outside study, nine hours. Use of political economy perspective to analyze forces that have shaped rise and characteristics of nonprofit sector and its constituent elements. Examination of social history of nonprofit sector in U.S. Exploration of legal and policy environments and distinct organizational forms. Comparative perspective between U.S. and other countries. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Nonprofit Sector, State and Civil Society", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 188SA": {
        "corequisiteDescription": "HNRS 101E", 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Individual Studies for USIE Facilitators", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 188SB": {
        "corequisiteDescription": "HNRS 101E", 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.", 
        "prerequisiteDescription": "course 188SA", 
        "prerequisites": [
            [
                "SOC WLF 188SA"
            ]
        ], 
        "title": "Individual Studies for USIE Facilitators", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 188SC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.", 
        "prerequisiteDescription": "course 188SB", 
        "prerequisites": [
            [
                "SOC WLF 188SB"
            ]
        ], 
        "title": "Individual Studies for USIE Facilitators", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 189": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 189HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Tutorial, three hours. Limited to students in College Honors and departmental honors programs. Designed as adjunct to upper division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Contracts", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 19": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Fiat Lux Freshman Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 191": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Seminar, three hours; outside study, nine hours. Examination in depth of particular subfield of social welfare (e.g., child welfare, children and youth, nonprofit, health, mental health). Limits of investigation set by individual instructor. May be repeated for credit with topic change. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Variable Topics Research Seminars: Social Welfare", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 194": {
        "corequisiteDescription": "course 195", 
        "corequisites": [
            [
                "SOC WLF 195"
            ]
        ], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Seminar, one hour; outside study, three hours. Corequisite: course 195. Not open to freshmen. Introduction to topics relevant to psychosocial determinants of children's health and community resources for children and families, with opportunity to gain breadth and depth of knowledge in seminar setting. May be repeated for credit. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Internship Seminars: Social Welfare", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 195": {
        "corequisiteDescription": "course 194", 
        "corequisites": [
            [
                "SOC WLF 194"
            ]
        ], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Tutorial, four hours. Corequisite: course 194. Not open to freshmen. Introductory course in community-based child health and advocacy. Students learn about community resources for children and families through service learning experience and work with pediatric patients and families in UCLA pediatric unit. Students meet on regular basis with instructor and provide periodic reports of their experience. May be repeated for credit. Individual contract with supervising faculty member required. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Community Internships in Social Welfare", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 199": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Tutorial, two hours. Limited to juniors/seniors. Supervised individual research or investigation under guidance of faculty mentor. Culminating paper required. May be repeated for credit. Individual contract required. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Directed Research in Social Welfare", 
        "unit": "2 or 4", 
        "unitType": "RANGE"
    }, 
    "SOC WLF 201A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours. Biopsychosocial factors associated with individual and group behavior and development as applicable in social functioning of individuals and groups. Emphasis on theoretical issues and research evidence that contribute to unified theory of human development. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Dynamics of Human Behavior", 
        "unit": 3, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 201B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours. Biopsychosocial factors associated with individual and group behavior and development as applicable in social functioning of individuals and groups. Emphasis on theoretical issues and research evidence that contribute to unified theory of human development. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Dynamics of Human Behavior", 
        "unit": 3, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 201C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours. Biopsychosocial factors associated with individual and group behavior and development as applicable in social functioning of individuals and groups. Emphasis on theoretical issues and research evidence that contribute to unified theory of human development. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Dynamics of Human Behavior", 
        "unit": 3, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 202A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, two and one half hours. Requisites: courses 201A, 201B. Deviations and pathologies or stresses in physical, emotional, and social areas of human functioning as those problems relate to role and function of social workers. S/U or letter grading.", 
        "prerequisiteDescription": "courses 201A, 201B", 
        "prerequisites": [], 
        "title": "Dynamics of Human Behavior", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 202B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, two and one half hours. Requisites: courses 201A, 201B. Deviations and pathologies or stresses in physical, emotional, and social areas of human functioning as those problems relate to role and function of social workers. S/U or letter grading.", 
        "prerequisiteDescription": "courses 201A, 201B", 
        "prerequisites": [], 
        "title": "Dynamics of Human Behavior", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 203A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Seminar, two and one half hours. Integrative courses that bring together theory and practice of social work in variety of topic areas relevant to profession. Includes identification of problem areas and populations-at-risk requiring further examination. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Integrative Seminar", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 203B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Seminar, two and one half hours. Integrative courses that bring together theory and practice of social work in variety of topic areas relevant to profession. Includes identification of problem areas and populations-at-risk requiring further examination. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Integrative Seminar", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 203C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Seminar, two and one half hours. Integrative course that brings together theory and practice of social work in variety of topic areas relevant to profession. Includes identification of problem areas and populations-at-risk requiring further examination. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Integrative Seminar", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 205": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, two hours; discussion, two hours. Designed to aid students in development of professional perspectives that will allow them to work effectively with members of myriad cultural groups, to discuss with clarity alternative concepts of culture in determination of individual behavior responses, and to identify their own personal cultural values and assumptions. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Cross-Cultural Awareness", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 210A": {
        "corequisiteDescription": "course 401A", 
        "corequisites": [
            [
                "SOC WLF 401A"
            ]
        ], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, two and one half hours. Corequisite: course 401A. Framework for all social work practice--purpose, values, knowledge, and skills--and core processes of preparation, engagement, problem or need definition, assessment, contracting, and beginning professional action with and on behalf of clients. Introduction to evaluation of outcomes. Letter grading.\n", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Foundations of Social Work Practice I", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 210B": {
        "corequisiteDescription": "course 401B", 
        "corequisites": [
            [
                "SOC WLF 401B"
            ]
        ], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, two and one half hours. Corequisite: course 401B. Weighing and carrying out evidence-supported practices based on differential assessment of people and their situations, with particular focus on following intervention approaches: case management, motivational interviewing, crisis intervention, cognitive, task-centered, and solution-focused therapies, as well as interventions appropriate for family functioning, small group processes, and environmental modification (advocacy and community organization). Continued evaluation of outcomes. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Foundations of Social Work Practice II", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 210C": {
        "corequisiteDescription": "course 401C", 
        "corequisites": [
            [
                "SOC WLF 401C"
            ]
        ], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, two and one half hours. Corequisite: course 401C. Core concepts of social work practice in organizational, community, and policy settings. Exploration of leadership style and development of personalized group work skills. Role of macro practice in agency-based social work in advancing strategies of organizational and social change. Interface and interaction among policy decisions, community needs, and program development. How societal values influence formation, implementation, and evaluation of social welfare policies, programs, and services. Analysis of social, economic, and political context of community practice in order to understand policy roots of economic and social injustices. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Foundations of Social Work Practice III", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 211A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, two and one half hours. Introduction to terminology and scope of systems framework that underlies social work practice interventions. Students learn how to identify and assess small- and large-scale forces that influence problems presented by clients. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Human Behavior in Social Environment: Theoretical Perspectives in Social Work and Social Welfare I", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 211B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, two and one half hours. Concerted study of racism, oppression, and social functioning covering various perspectives on roots and significance of racism and other forms of oppression in U.S. (and other societies) today. Forces contributing to initiation and maintenance of institutional oppression and inequality across social categories such as race, ethnicity, gender, sexuality, religion, ability, and age. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Human Behavior in Social Environment: Theoretical Perspectives in Social Work and Social Welfare II", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 212": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, two and one half hours per week for five weeks. Introduction to critical self-awareness and intergroup dialogue. Exploration and appreciation of worldviews and experiences of colleagues. Through self-awareness students learn to engage with diversity and difference in social work practice. Through intergroup dialogue, students learn to explore social group identity, conflict, community, and social justice. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Human Behavior in Social Environment: Critical Self-Awareness and Intergroup Dialogue", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 213A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, two and one half hours; discussion, one hour. Introduction to various research methodologies, including experimental and quasi-experimental designs, survey research methods, qualitative methods, and single subject and group-based research designs. Exploration of ethical issues pertaining to social welfare and social science research. Students learn and practice formulating research problems, research questions, and hypotheses and learn how to critically review theory and research. Measurement, sampling procedures, and basic descriptive statistics. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Social Welfare Research Methods", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 213B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, two and one half hours; discussion, one hour. Core statistics course builds on research methods taught in course 213A, and designed to help students develop basic understanding of descriptive and inferential statistical approaches. Introduction to statistical reasoning, with emphasis on how statistics can help us understand world. Topics include numerical and graphical summaries of data, data acquisition and experimental design, probability, hypothesis testing, confidence intervals, correlation, and regression. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Applied Statistics in Social Welfare", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 214A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, two and one half hours. Overview of key areas of social welfare policy. Roots of American social welfare policy and how they have given rise to today's social policy structure. Path of social welfare policy development, birth of profession of social work and how it has paralleled major social policy issues from early colonial settlements to present day. Specific events and important individuals that have influenced public policy affecting vulnerable populations, such as racial and ethnic minorities, women, children, the poor, and other diverse populations. Examination of role of social research in informing social welfare policy. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Foundations of Social Welfare Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 214B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, two and one half hours. Overview and understanding of leadership and social policy elements for effective social change in dynamic and diverse society. Builds on foundations of social welfare history and policy developments. Examination of elements of policy advocacy and competencies for effective social work leadership in organizational and community settings and integration of research and theory in addressing and resolving complex social problems. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Leadership for Social Change", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 220": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Discussion, two hours. History of social work as field: body of knowledge, method and process, and point of view analyzed within context of economic, political, social, philosophical, and scientific climate of period. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "History and Philosophy of Social Welfare", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 221B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours; outside study, nine hours. Understanding of significant theoretical constructs and relevant empirical evidence dealing with how organizations develop and maintain their internal functions. Development of beginning skill in organizational analysis. Special attention to organizational analysis of social welfare services. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Social Welfare Policy and Services II", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 222A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, two hours; discussion, one hour. Five weeks in Fall Quarter. Overview of history of social work profession and how social justice has shaped its underpinnings and influenced social policy that affects profession's primary fields of practice. How social work profession has addressed social service needs of racial and ethnic populations. In Progress grading (credit to be given only on completion of course 222B).", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Foundations of Social Welfare: History", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 222B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, two hours; discussion, one hour. Five weeks in Spring Quarter. Requisite: course 222A. Overview of history of social work profession and how social justice has shaped its underpinnings and influenced social policy that affects profession's primary fields of practice. How social work profession has addressed social service needs of racial and ethnic populations. S/U or letter grading.", 
        "prerequisiteDescription": "course 222A", 
        "prerequisites": [
            [
                "SOC WLF 222A"
            ]
        ], 
        "title": "Foundations of Social Welfare: Policy", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 223": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Seminar, two hours. Nature and role of social work in contemporary society; relationships with other professions; probable future trends in profession; social work ethics, professional organizations, certification licensing; professional responsibility for continued self-criticism and improvement of profession. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Seminar: Social Work Profession", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 225A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Seminar, three hours. Designed for Ph.D. students. Examination of principal issues in development, formulation, and adoption of U.S. social welfare policies, with particular focus on income distribution and redistribution. Emphasis on analysis of social policy issues and conceptual frameworks for analysis. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Social Welfare Policy: Formulation and Analysis", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 225B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Seminar, three hours. Designed for Ph.D. students. Examination of issues in implementation and evaluation of social welfare policies, particularly those pertaining to provision, organization, and delivery of social services, including auspices funding, distribution, criteria for effectiveness, and use of quantitative methods in policy analysis. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Social Welfare Policy: Implementation and Evaluation", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 229A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours; outside study, nine hours. Limited to Ph.D. students. Exploration of one problem for study -- its history, current state of knowledge about why problem exists, and what might be done about it. Survey of several problems and alternative ways in which problems have been conceptualized and studied to understand how scholars use theory and empirical evidence to advance what is known, what is yet unknown, where there are important gaps in understanding particular problems, and what might be done to solve them. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Craft of Social Welfare Scholarship I", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 229B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours; outside study, nine hours. Enforced requisite: course 229A. Limited to Ph.D. students. Continued narrowing of student focus on one social welfare research problem, moving from understanding of evolution and context of general problem to more detailed and intensive review of research literature on specific researchable question to deepen student understanding of existing knowledge on topic and begin to identify one or more critical gaps in knowledge to explore. Discussion of different methods of summarizing research literatures, identifying seminal studies, and interpreting contradictory findings. Regular meetings to discuss ongoing work and to encourage students to review their work with their faculty advisers and/or other mentors with expertise in their problem areas. Letter grading.", 
        "prerequisiteDescription": "course 229A", 
        "prerequisites": [
            [
                "SOC WLF 229A"
            ]
        ], 
        "title": "Craft of Social Welfare Scholarship II", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 229C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, 90 minutes; outside study, four and one half hours. Enforced requisite: course 229B. Limited to Ph.D. students. Focus on craft of scholarly writing for publication to help students develop effective narrative frame for presentation, make choices about extent of detail and shape of literature review, and achieve cogent presentation and conclusion. Consideration of elements of effective professional writing. Letter grading.", 
        "prerequisiteDescription": "course 229B", 
        "prerequisites": [
            [
                "SOC WLF 229B"
            ]
        ], 
        "title": "Craft of Social Welfare Scholarship III", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 230A": {
        "corequisiteDescription": "required social work practicum", 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours. Corequisite: required social work practicum. Introduction to theory of social work with individuals and small groups and to principles of practice that are derivative of this and related theory. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Theory of Social Welfare Practice with Individuals, Families, and Groups I", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 230B": {
        "corequisiteDescription": "required social work practicum", 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours. Corequisite: required social work practicum. Introduction to theory of social work with individuals and small groups and to principles of practice that are derivative of this and related theory. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Theory of Social Welfare Practice with Individuals, Families, and Groups II", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 230C": {
        "corequisiteDescription": "required social work practicum", 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours. Corequisite: required social work practicum. Introduction to theory of social work with individuals and small groups and to principles of practice that are derivative of this and related theory. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Theory of Social Welfare Practice with Individuals, Families, and Groups III", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 231A": {
        "corequisiteDescription": "required social work practicum", 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours; outside study, nine hours. Corequisite: required social work practicum. Advanced-level, critical analysis of theories, concepts, and principles underlying social casework practice. Specific attention to deviation and stress as conditions affecting functioning of individuals and groups and to diagnostic knowledge and competence required in rehabilitation and prevention. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Theory of Social Welfare Practice with Individuals, Families, and Groups IV", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 231B": {
        "corequisiteDescription": "required social work practicum", 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours; outside study, nine hours. Corequisite: required social work practicum. Advanced-level, critical analysis of theories, concepts, and principles underlying social casework practice. Specific attention to deviation and stress as conditions affecting functioning of individuals and groups and to diagnostic knowledge and competence required in rehabilitation and prevention. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Theory of Social Welfare Practice with Individuals, Families, and Groups V", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 231C": {
        "corequisiteDescription": "required social work practicum", 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours; outside study, nine hours. Corequisite: required social work practicum. Advanced-level, critical analysis of theories, concepts, and principles underlying social casework practice. Specific attention to deviation and stress as conditions affecting functioning of individuals and groups and to diagnostic knowledge and competence required in rehabilitation and prevention. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Theory of Social Welfare Practice with Individuals, Families, and Groups VI", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 231E": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours; outside study, nine hours. Integration of theory and practice as they pertain to role of social workers in school settings. Biopsychosocial/ecological assessment of students (including, but not limited to, differences due to ethnic and/or cultural diversity and to students who are learning handicapped), ecological intervention strategies, collaboration within multidisciplinary team, and role of liaison between pupils, family, school, and community. Use of discussion, videos, current literature, and case presentation to explore impact of school social workers as change agents. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Theory of Social Welfare Practice with Individuals, Families, and Groups: School Social Work", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 231F": {
        "corequisiteDescription": "required social work practicum", 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours; outside study, nine hours. Corequisite: required social work practicum. Advanced-level, critical analysis of key contributors, essential concepts, core theories, current controversies, and recent research findings in contemporary cognitive-behavioral therapy; case conceptualization from cognitive-behavioral perspective; specific cognitive and behavioral assessment methods and intervention techniques and their typical applications; contextual considerations, including human diversity and other sociocultural and developmental factors, in arriving at case conceptualizations and treatment plans. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Theory of Social Welfare Practice with Individuals, Families, and Groups: Cognitive-Behavioral Theories and Methods", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 231G": {
        "corequisiteDescription": "required social work practicum", 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours; outside study, nine hours. Corequisite: required social work practicum. Advanced-level, critical analysis of major intervention approaches -- individual, family, group, and environmental -- to treating substance abuse and dependency. Specific attention to skills and self-awareness to integrate biological, psychological, and social factors in assessing and intervening with substance-using clients and target populations. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Theory of Social Work Practice with Individuals, Families, and Groups: Substance Abuse Intervention", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 231J": {
        "corequisiteDescription": "required social work practicum", 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours; outside study, nine hours. Corequisite: required social work practicum. Advanced-level, critical analysis of role of public child welfare worker in relationship to consumer, agency, and community. Further development of social work and case management skills in context of public child welfare practice. Clinical case management explored as intervention in its own right in addition to its use as mechanism for linking children and families to other social systems, professions, and forms of intervention. Interpretation of current public child welfare events, trends, terms, and laws and their relationship to direct practice issues. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Theory of Social Work Practice with Individuals, Families, and Groups: Child Welfare", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 231K": {
        "corequisiteDescription": "required social work practicum", 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours; outside study, nine hours. Corequisite: required social work practicum. Designed to provide students with grounding in social work practice with adults in mental health settings. Emphasis on evidence-based approaches to providing services to pervasive and persistent mentally ill. Exploration of strengths-based recovery-oriented approaches that are consistent with knowledge and values of social work practice. Exposure to range of interventions applicable to most common mental health problems and barriers to service delivery for this vulnerable population, such as stigma, criminalization, cultural bias, and gaps in knowledge. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Theory of Social Work Practice with Individuals, Families, and Groups: Mental Health", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 231M": {
        "corequisiteDescription": "required social work practicum", 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours; outside study, nine hours. Corequisite: required social work practicum. Advanced-level, critical analysis of various roles that social workers occupy in health settings and strategies for working with healthcare teams. From case-based approach, examination of variety of clinical challenges, assessment techniques for use in multiple settings, and interventions to implement with individuals, families, groups, and multidisciplinary healthcare teams. Evaluation of policy implications that impact social work practice in health settings. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Theory of Social Work Practice with Individuals, Families, and Groups: Health", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 231N": {
        "corequisiteDescription": "required social work practicum", 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours; outside study, nine hours. Corequisite: required social work practicum. Advanced-level, critical analysis of advanced direct practice specializing in child, adolescent, and family practice cases encountered in variety of agency-based practice settings. Advanced theory, methods, and research in child, adolescent, and family clinical social work practice. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Theory of Social Work Practice with Individuals, Families, and Groups: Children, Adolescents, and Families", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 231P": {
        "corequisiteDescription": "required social work practicum", 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours; outside study, nine hours. Corequisite: required social work practicum. Advanced-level, critical analysis of theoretical models related directly to practice with diverse population of older adults. Presentation of comprehensive tools for multidimensional geriatric assessment. How to engage in collaborative treatment planning across range of late-life problems and address impediments to intervention process. Theoretical underpinnings and most effective practice models to enable students to serve needs of older clients and their families as they adjust to late-life transitions, as well as to health and mental health problems most prevalent for older adults. Client populations range from well elderly to physically frail and/or demented from diverse backgrounds. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Theory of Social Welfare Practice with Individuals, Families, and Groups: Gerontology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 232": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, two and one half hours. Core course for Health and Mental Health Across the Lifespan area of concentration. Introduction to social determinants/pathways of health, one of over-arching integrative and evidence-based frameworks accounting for upstream influences on health and mental health of populations. Review of different aspects of this approach and illustration of them with examples from efforts to prevent health and mental health problems and to promote positive health and mental health. Introduction to leading pscyhosocial theories that underpin social work practice in health promotion and disease prevention. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Prevention and Promotion in Health and Mental Health", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 240A": {
        "corequisiteDescription": "required social work practicum", 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours. Corequisite: required social work practicum. Historical and theoretical developments in administration, planning, and community organization; understanding the community as a social system; administration of organizations; role of the practitioner in identification, analysis, and evaluation of needs, existing programs, policies, structures, and strategies of intervention. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Theory of Social Welfare Practice in Organizations, Communities, and Policy Settings I", 
        "unit": 3, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 240B": {
        "corequisiteDescription": "required social work practicum", 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours. Corequisite: required social work practicum. Historical and theoretical developments in administration, planning, and community organization; understanding the community as a social system; administration of organizations; role of the practitioner in identification, analysis, and evaluation of needs, existing programs, policies, structures, and strategies of intervention. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Theory of Social Welfare Practice in Organizations, Communities, and Policy Settings II", 
        "unit": 3, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 241A": {
        "corequisiteDescription": "required social work practicum", 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours; outside study, nine hours. Corequisite: required social work practicum. Emphasis on various patterns of community action for attaining social welfare objectives; research and field experience directed toward study of social problems within context of community planning; emerging patterns of physical, economic, and social planning within framework of social change theory. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Theory of Social Welfare Practice in Organizations, Communities, and Policy Settings IV", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 241B": {
        "corequisiteDescription": "required social work practicum", 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours; outside study, nine hours. Corequisite: required social work practicum. Emphasis on various patterns of community action for attaining social welfare objectives; research and field experience directed toward study of social problems within context of community planning; emerging patterns of physical, economic, and social planning within framework of social change theory. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Theory of Social Welfare Practice in Organizations, Communities, and Policy Settings V", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 241C": {
        "corequisiteDescription": "required social work practicum", 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours; outside study, nine hours. Corequisite: required social work practicum. Emphasis on various patterns of community action for attaining social welfare objectives; research and field experience directed toward study of social problems within context of community planning; emerging patterns of physical, economic, and social planning within framework of social change theory. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Theory of Social Welfare Practice in Organizations, Communities, and Policy Settings VI", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 241G": {
        "corequisiteDescription": "required social work practicum", 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours; outside study, nine hours. Corequisite: required social work practicum. Designed to familiarize students with use of geographic data in community practice. Development of skill base for community practice that provides students with tools necessary to organize and plan effectively for political, economic, and social justice in communities. How to use geographic information systems (GIS) to inform community practice. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Theory of Social Welfare Practice in Organizations, Communities, and Policy Settings: Community Mapping", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 241H": {
        "corequisiteDescription": "required social work practicum", 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours; outside study, nine hours. Corequisite: required social work practicum. Conceptual framework and analytic tools provided to understand organizational features of human services. Human service organizations work on people to improve, sustain, or prevent decline of well-being. Because of their function these organizations have special attributes that distinguish them from other organizations. Examination of these attributes, theoretical perspective to study them, and analysis of factors that shape nature of work they do. Explanation of determinants of relations between workers and clients by looking at such variables as policy environment, values and mission, internal structure, service technology, reward structure, organizational responses to staff and client diversity, and power relations between workers and clients. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Theory of Social Welfare Practice in Organizations, Communities, and Policy Settings: Human Service Organizations", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 241I": {
        "corequisiteDescription": "required social work practicum", 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours; outside study, nine hours. Corequisite: required social work practicum. Process of grant writing, with emphasis on learning necessary skills to construct functional grant proposals. Application of problem-solving knowledge to development of human service grants. Various steps in writing grant proposals and opportunity to design/prepare grant proposals. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Theory of Social Welfare Practice in Organizations, Communities, and Policy Settings: Grant Writing", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 241J": {
        "corequisiteDescription": "required social work practicum", 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours; outside study, nine hours. Corequisite: required social work practicum. Designed to deepen student knowledge of community practice methods and empirical base that supports these methods in field of social welfare. Theory, practice, and research methods related to major community practice approaches in context of evidence-based philosophies and processes. Development of skills to address community problems using best available data by applying course concepts to student projects. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Theory of Social Welfare Practice in Organizations, Communities, and Policy Settings: Community Practice", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 241K": {
        "corequisiteDescription": "required social work practicum", 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours; outside study, nine hours. Corequisite: required social work practicum. Methods of social work policy practice and policy advocacy as problem-solving process. Analysis of consequences of existing social policies, particularly for marginalized populations, development of alternative policies, and use of different advocacy tools/techniques to gain support for policy change. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Theory of Social Welfare Practice in Organizations, Communities, and Policy Settings: Policy Practice", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 242": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, two and one half hours. Core course for Child and Family Well-Being area of concentration. Introduction to advanced study of child and family well-being from social work perspective. Conveys seminal knowledge of key settings--and experiences within them--that impact children and family functioning. Drawing from resilience theory and empirical research, review of aspects of contexts such as parenting and family systems, schools, and neighborhoods--that serve as risk and protective factors for healthy child development. Emphasis on prevention efforts to ensure healthy development for all youth, stop family violence, and increase social connections. Prepares students for professional roles as social workers who serve, advocate for, and empower children and families around relevant social and economic justice issues. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Resilience, Risk, and Thriving among Children and Families", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 245A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Seminar, three hours. Designed for Ph.D. students. Guiding scientific models of practice theories; process of emergence, development, and change of practice theories; intellectual foundations of practice theories; how professionals learn, apply, accumulate, and modify their practice knowledge; science and practice interplay. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Development of Social Work Practice Theory: Epistemology of Practice", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 245B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Seminar, three hours. Designed for Ph.D. students. Research for practice, with major emphasis on methods of intervention research that seek to design, test, evaluate, and disseminate innovative intervention technologies. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Development of Social Work Practice Theory: Models of Social Work Practice Research", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 249A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Formerly numbered 249B.) Lecture, three hours; outside study, nine hours. Limited to Ph.D. students. Introduction to underlying logic(s) of scientific inquiry to provide students with building blocks for independent scholarship. Survey design, sampling strategies and external and construct validity, methods of data collection, and reliability as measurement issue. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Foundations of Scientific Inquiry I (Effective Fall 2018 )", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 249B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Formerly numbered 249C.) Lecture, three hours; outside study, nine hours. Requisite: course 249A. Limited to Ph.D. students. Introduction to underlying logic(s) of scientific inquiry to provide students with building blocks for independent scholarship. Introduction to array of qualitative research strategies. Letter grading.", 
        "prerequisiteDescription": "course 249A", 
        "prerequisites": [
            [
                "SOC WLF 249A"
            ]
        ], 
        "title": "Foundations of Scientific Inquiry II (Effective Fall 2018 )", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 249C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Formerly numbered 249A.) Lecture, three hours; outside study, nine hours. Requisites: courses 249A, 249B. Limited to Ph.D. students. Introduction to underlying logic(s) of scientific inquiry to provide students with building blocks for independent scholarship. Experimental and quasi-experimental approaches in intervention research, ways of enhancing internal, external, and statistical conclusion validity, and inferring causality. Letter grading.", 
        "prerequisiteDescription": "courses 249A, 249B", 
        "prerequisites": [], 
        "title": "Foundations of Scientific Inquiry III (Effective Fall 2018 )", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 251A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours. Designed for second-year M.S.W. students in macro and clinical social work. One most pervasive aspect of women's existence has been violence against them as consequence of their gender. Factual information and critical examination of theories, research, and clinical and policy practices in social work regarding various forms of violence against women and girls in their homes, workplaces, and communities provided. Exploration of macro- and micro-level interventions in social work practice to address impact of violence on communities and individuals. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Theory of Social Welfare Practice: Domestic and Sexual Violence", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 251B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, two and one half hours. Designed for second-year M.S.W. students. Foundational understanding of contemporary issues being experienced by U.S. service members, veterans, and their families, following longest wars in U.S. history. Exploration of different modes of military service and identities (i.e., active duty, National Guard, Reserve, and veteran) along with correlative issues for family members. Examination of family life cycles and military policies and approach to families. Use of trauma-informed practice lens to focus on working with veteran community of all campaigns, as well as current military members and their families. Discussion of military and veteran policies, programs, and practices in context of both social work theory and research, as basis for military social work practice at direct service and policy practice levels. Vicarious trauma, care for caregivers, and provider self-care also addressed. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Theory of Social Welfare Practice: Military Social Work", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 252": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, two and one half hours. Core course for Social and Economic Justice area of concentration. Trains students to understand philosophies of social justice, history of ideas, and key ethical frameworks underpinning social work. Connects theory and practice through focus on poverty interventions, welfare policy, mass incarceration, community organizing, homelessness, and displacement. Focus on U.S. with emphasis on global and comparative approach to social welfare. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Theories and Practices of Social Justice", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 258": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Discussion, two hours. Designed for Ph.D. students. Current problems in field of social welfare. Specific topics vary depending on research and educational interests and needs of class. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Critical Problems in Social Welfare", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 259": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours. Limited to graduate students. Designed to provide in-depth understanding of particular topics in area of applied statistics/measurement to graduate students engaged in conducting research in broad array of fields that comprise social sciences. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Variable Topics in Statistics in Social Sciences", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 280": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Formerly numbered 280A-280B.) Lecture, two and one half hours. Limited to first-year M.S.W. students. Designed to stimulate student thinking around importance and relevance of evidence in social work practice. Introduction to foundations of critical thinking to develop student capacity to examine ideas, beliefs, and knowledge. Examination of variable meanings of research and introduction to some basic components of scientific method. Critical examination of utility and role systematic literature review plays in building knowledge/evidence. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Knowledge Acquisition, Evidence-Based Practice, and Research in Social Welfare", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 281A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Discussion, two hours. Individual or group research projects requiring intensive examination and analysis of social problem area, directed toward development of research knowledge and techniques for social work practice. In Progress grading (credit to be given only on completion of courses 281B and 281C).", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Social Welfare Research", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 281B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Discussion, two hours. Individual or group research projects requiring intensive examination and analysis of social problem area, directed toward development of research knowledge and techniques for social work practice. In Progress grading (credit to be given only on completion of course 281C).", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Social Welfare Research", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 281C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Discussion, two hours. Individual or group research projects requiring intensive examination and analysis of social problem area, directed toward development of research knowledge and techniques for social work practice. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Social Welfare Research", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 285A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Discussion, three hours. Review of areas of research of concern to social workers, with special attention to design, instrument construction, data collection, data processing, data reduction, analysis, and interpretation. Designs studied include survey, panel, experimental observation, and theory development research. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Research in Social Welfare", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 285B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Discussion, three hours. Review of areas of research of concern to social workers, with special attention to design, instrument construction, data collection, data processing, data reduction, analysis, and interpretation. Designs studied include survey, panel, experimental observation, and theory development research. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Research in Social Welfare", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 285C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Discussion, three hours. Review of areas of research of concern to social workers, with special attention to design, instrument construction, data collection, data processing, data reduction, analysis, and interpretation. Designs studied include survey, panel, experimental observation, and theory development research. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Research in Social Welfare", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 285D": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours. Integrated examination of development of empirical research in child welfare field. Critical assessment of current approaches to meet needs of children who come to attention of child welfare agencies. Examination of research and theory in child welfare field. Review of student knowledge of research methods and statistics. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Research in Child Welfare", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 285E": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours. Overview of research in aging. Development of research questions, selecting appropriate theoretical frameworks, conducting literature reviews, selecting appropriate research design, identifying sampling methods. Special considerations in aging research, including sampling, questionnaire design, and recruitment issues. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Research in Gerontology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 285F": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours. Research in area of health policy and services. Discussions of readings about range of research from field of health services. Identification of research design issues, design of research instruments, analysis of strengths and limitations of current approaches to health services research, consideration of alternative roles for social work practitioners in arena of health services. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Research in Health", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 285G": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours. Research methods in mental health. Application of experimental designs, survey research methods, ethnographic methods, single-subject designs, and observational methods. Operational definition of variables and selection and design of appropriate measures for research in mental health. Practice in critiquing published research related to mental health issues. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Research in Mental Health", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 285H": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours. Discussion of differences and similarities between evaluation and other research, alternative program evaluation methods, roles and limitations of evaluation research in real world, development of proposals for feasible program evaluation research. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Program Evaluation Research", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 285I": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours. Research methods as applied to problems, issues, and interventions pertaining to youth populations. Instruction and experience in applying experimental and quasi-experimental designs, survey research methods, ethnographic methods, single-subject designs, and observational methods. Operational definition of variables and selection and design of appropriate measures for research with children and adolescents. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Research in Youth Populations", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 286A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Seminar, three hours. Basic concepts underlying research methods. Content includes theoretical and conceptual approaches to research problem formulation; research design, including experimental, comparative, and survey; sampling; statistical methods; methods of observation and techniques of data analysis. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Survey of Research Methods", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 286B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Seminar, three hours. Advanced concepts underlying research methods. Continuing study of theoretical and conceptual approaches to research problem formulation; research design, including experimental, comparative, and survey; sampling; statistical methods; methods of observation and techniques of data analysis. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Research Methods", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 286C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Fieldwork, four hours. Supervised study and training through participation in on-going research project or one initiated by students and carried out under faculty supervision, enabling students to apply research skills developed in prior courses. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Research Internship", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 290A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Seminar, three hours; outside study, nine hours. Series of seminars dealing with trends in social work and social welfare, with focus on current social problems affecting individuals, groups, and communities and new patterns of intervention based on recent demonstrations and research. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Seminar: Social Work", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 290B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Seminar, three hours; outside study, nine hours. Series of seminars dealing with trends in social work and social welfare, with focus on current social problems affecting individuals, groups, and communities and new patterns of intervention based on recent demonstrations and research. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Seminar: Social Work", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 290C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Seminar, three hours; outside study, nine hours. Series of seminars dealing with trends in social work and social welfare, with focus on current social problems affecting individuals, groups, and communities and new patterns of intervention based on recent demonstrations and research. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Seminar: Social Work", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 290F": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, two and one half hours. Introduction to upstream way of thinking about firearm-related violence. Examination of range of topics connected to contemporary debates about firearm violence in U.S. using collection of philosophical, social, and epidemiological literature. Ways of thinking theoretically and scientifically about causes and consequences of firearm violence in different contexts, from mass shootings to firearm suicides. Major theories advanced to explain firearm violence, methods used in scientific study of firearm violence, and important research findings about correlates, patterns, processes, and trends related to firearm violence. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Firearm Violence Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 290T": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours; outside study, nine hours. Designed for graduate students. Exploration of evolution of juvenile justice system in the U.S. and issues that have shaped current-day practice. Role of social workers in system to be theme throughout course. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Social Work and Juvenile Justice System", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 290W": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, three hours; outside study, nine hours. Intended for graduate students interested in pursuing analysis of key international social welfare issues. Topics approached from perspective of globalization of social, economic, and political activities. Problems of global poverty, social injustice and inequality, and issues of racial, ethnic, and cultural diversity, with emphasis on multifaceted contributions of social work, social services, and social welfare and international social development within rich and poor countries. Acquisition of knowledge of international social welfare activities, as well as analytical skills to address and debate complex international issues. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "International Social Welfare", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 375": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Seminar, to be arranged. Preparation: apprentice personnel employment as teaching assistant, associate, or fellow. Teaching apprenticeship under active guidance and supervision of regular faculty member responsible for curriculum and instruction at UCLA. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Teaching Apprentice Practicum", 
        "unit": "1 to 4", 
        "unitType": "RANGE"
    }, 
    "SOC WLF 401A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Laboratory, 16 hours. Educationally directed practicum conducted in selected health, welfare, and educational facilities. Provides opportunities for students to test their theoretical knowledge and to acquire disciplined practice foundation in profession. In Progress grading (credit to be given only on completion of courses 401B and 401C).", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Practicum: Social Work", 
        "unit": 3, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 401B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Laboratory, 16 hours. Educationally directed practicum conducted in selected health, welfare, and educational facilities. Provides opportunities for students to test their theoretical knowledge and to acquire disciplined practice foundation in profession. In Progress grading (credit to be given only on completion of course 401C).", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Practicum: Social Work", 
        "unit": 3, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 401C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Laboratory, 16 hours. Educationally directed practicum conducted in selected health, welfare, and educational facilities. Provides opportunities for students to test their theoretical knowledge and to acquire disciplined practice foundation in profession. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Practicum: Social Work", 
        "unit": 3, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 402A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Laboratory, 20 hours. Requisites: courses 401A, 401B, 401C. Practicum in social work, arranged for students in keeping with their major field of study. In Progress grading (credit to be given only on completion of courses 402B and 402C).", 
        "prerequisiteDescription": "courses 401A, 401B, 401C", 
        "prerequisites": [], 
        "title": "Advanced Practicum: Social Work", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 402B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Laboratory, 20 hours. Requisites: courses 401A, 401B, 401C. Practicum in social work, arranged for students in keeping with their major field of study. In Progress grading (credit to be given only on completion of course 402C).", 
        "prerequisiteDescription": "courses 401A, 401B, 401C", 
        "prerequisites": [], 
        "title": "Advanced Practicum: Social Work", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 402C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Laboratory, 20 hours. Requisites: courses 401A, 401B, 401C. Practicum in social work, arranged for students in keeping with their major field of study. Letter grading.", 
        "prerequisiteDescription": "courses 401A, 401B, 401C", 
        "prerequisites": [], 
        "title": "Advanced Practicum: Social Work", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 490": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Lecture, two hours. Writing workshop on students' papers in progress, with eye toward scholarly publication. Analysis and group discussion of rhetorical and stylistic principles. May be repeated once. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Professional Communication for Social Welfare", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 501": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Tutorial, to be arranged. Preparation: consent of UCLA graduate adviser and graduate dean, and host campus instructor, department chair, and graduate dean. Used to record enrollment of UCLA students in courses taken under cooperative arrangements with USC. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Cooperative Program", 
        "unit": "2 to 8", 
        "unitType": "RANGE"
    }, 
    "SOC WLF 596A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Tutorial, to be arranged. Individual programming for selected students to permit pursuit of subject in greater depth. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Study and Research in Social Welfare", 
        "unit": "2 to 8", 
        "unitType": "RANGE"
    }, 
    "SOC WLF 596B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Tutorial, to be arranged. Limited to Ph.D. students. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Study and Research for Ph.D", 
        "unit": "2 to 12", 
        "unitType": "RANGE"
    }, 
    "SOC WLF 597A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Tutorial, to be arranged. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Preparation for M.S.W", 
        "unit": "2 to 8", 
        "unitType": "RANGE"
    }, 
    "SOC WLF 597B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Tutorial, to be arranged. Limited to Ph.D. students. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Preparation for Ph.D", 
        "unit": "2 to 12", 
        "unitType": "RANGE"
    }, 
    "SOC WLF 599": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Tutorial, to be arranged. Limited to Ph.D. students. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Ph.D", 
        "unit": "2 to 12", 
        "unitType": "RANGE"
    }, 
    "SOC WLF 89": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF 99": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Student Research Program", 
        "unit": "1 to 2", 
        "unitType": "RANGE"
    }, 
    "SOC WLF M104C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Same as Chicana and Chicano Studies M106B, Gender Studies M104C, and Gerontology M104C.) Lecture, four hours. Exploration of complexity of variables related to diversity of aging population and variability in aging process. Examination of gender and ethnicity within context of both physical and social aging, in multidisciplinary perspective utilizing faculty from variety of fields to address issues of diversity. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Diversity in Aging: Roles of Gender and Ethnicity", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF M104D": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Same as Gerontology M104D.) Lecture, four hours. Examination of theoretical models and concepts of policy process, with application to aging policy. Analysis of decision-making processes that affect aging policy. Description of history of contemporary aging policy. Exploration of current policy issues affecting elderly. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Public Policy and Aging", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF M104E": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Same as Gerontology M104E.) Lecture, four hours. Topics include theories of aging, economic factors, changing roles, social relationships, and special populations. Weekly seminars organized around key aspect of social gerontology. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Social Aspects of Aging", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF M108": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Same as Gerontology M108.) Lecture, four hours. Limited to juniors/seniors. Course of human aging charted in ways that are based on variety of recent research frontiers. Use of conceptual frameworks to increase relevance of aging to students' lives and enhance their critical thinking -- biopsychosocial approach that is based on recognition that aging is inherently interdisciplinary phenomenon, and life course perspective that is distinguished by analytical framework it provides for understanding interplay between human lives and changing social structures, and allows students to understand how events, successes, and losses at one stage of life can have important effects later in life. Focus on individuals as they age within one particular sociohistorical context. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Biomedical, Social, and Policy Frontiers in Human Aging", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF M110": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Same as Urban Planning M110.) Lecture, three hours; discussion, one hour. Analysis and praxis of public problems. Taking up case of persistent inequality in liberal democracies, coverage of key frameworks and methodologies for understanding and analyzing poverty and inequality and examination of forms of action, from role of government to social movements, that seek to intervene in such problems. Study of problems, programs, policies, and politics in globally interconnected, transnational world, while avoiding analytical divide between global north and global south. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Inequality and Democracy: Analysis and Praxis of Public Problems", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF M140": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Same as Psychology M140.) Lecture, three hours. Designed for juniors/seniors. Perspectives on major features of human aging -- biological, social, psychological, and humanistic. Introduction to information on range of influences on aging to prepare students for subsequent specialization. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Study of Aging", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF M142SL": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Same as Gerontology M142SL.) Lecture, three hours; fieldwork, one hour. Limited to juniors/seniors. What do you say to your parents in conversation? How do you talk to your grandparents? Does your family talk well to one another as group? How do you communicate well with boss who is 30 years older than you? Individuals of all ages interact with one another, and their interactions have significance throughout their lives. Introduction to psychological, interpersonal, and societal issues related to intergenerational communication across lifespan. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Intergenerational Communication across Lifespan", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF M165": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Same as Disability Studies M130 and Gerontology M165.) Lecture, three hours. Limited to juniors/seniors. Growing numbers of people of all ages with disabilities are leading active and productive lives in American communities. Many others are struggling to lead such lives. Who are people with disabilities in contemporary America? How has U.S. responded over time to various needs and aspirations of people with disabilities, young and old? What demands have been made over time by disability advocates? How has government addressed demands of advocates for various disability populations? What do we know about extent to which public policies and programs are responsive to people in need? How do demographics, economics, and politics continue to influence evolving public policy responses? P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Disability Policy and Services in Contemporary America", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF M203F": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Same as Community Health Sciences M245A, Dentistry M300A, Education M217G, Law M281A, Medicine M290A, and Nursing M290A.) Lecture, two hours. Course M203F is requisite to M203G, which is requisite to M203H. Intensive interdisciplinary study of child physical and sexual abuse and neglect, with lectures by faculty members of Schools of Dentistry, Law, Medicine, Nursing, and Public Health and Departments of Education and Psychology, as well as by relevant public agencies. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Child Abuse and Neglect", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF M203G": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Same as Community Health Sciences M245B, Dentistry M300B, Education M217H, Law M281A-M281B, Medicine M290A-M290B, and Nursing M290B.) Lecture, two hours. Requisite: course M203F. Intensive interdisciplinary study of child physical and sexual abuse and neglect, with lectures by faculty members of Schools of Dentistry, Law, Medicine, Nursing, and Public Health and Departments of Education and Psychology, as well as by relevant public agencies. Letter grading.", 
        "prerequisiteDescription": "course M203F", 
        "prerequisites": [
            [
                "SOC WLF M203F"
            ]
        ], 
        "title": "Child Abuse and Neglect", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF M203H": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Same as Community Health Sciences M245C, Dentistry M300C, Education M217I, Law M281B, Medicine M290B, and Nursing M290C.) Lecture, two hours. Requisite: course M203G. Intensive interdisciplinary study of child physical and sexual abuse and neglect, with lectures by faculty members of Schools of Dentistry, Law, Medicine, Nursing, and Public Health and Departments of Education and Psychology, as well as by relevant public agencies. Letter grading.", 
        "prerequisiteDescription": "course M203G", 
        "prerequisites": [
            [
                "SOC WLF M203G"
            ]
        ], 
        "title": "Child Abuse and Neglect", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF M206A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Same as Urban Planning M270.) Lecture, 90 minutes; discussion, 90 minutes; one field trip. Review of current status of homelessness: who homeless are, what social services and housing are available, existing and proposed programs -- appropriate architecture, management, and sources of funding. Outside speakers include providers of services to homeless. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Homelessness: Housing and Social Service Issues", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF M221A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Same as Public Policy M260 and Urban Planning M241.) Lecture, two hours; discussion, one hour. Nature, roles, and history of welfare institutions in different societies; applicable social system theory of different components of welfare system; theory and research about welfare policies and organizational forms. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Foundations of Social Welfare Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF M241E": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Same as Public Policy M228 and Urban Planning M288.) Lecture, three hours; outside study, nine hours. Designed for graduate students. Various patterns of community action for attaining social welfare objectives; research and field experience directed toward study of social problems within context of community planning; emerging patterns of physical, economic, and social planning within framework of social change theory. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Leadership, Development, and Governance of Nonprofit Organizations", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF M241F": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Same as Public Policy M247 and Urban Planning M290.) Lecture, three hours; outside study, nine hours. Designed for graduate students. Technical processes of problem solving regarding substantive social welfare problems at community level. This form of community practice fills niche between professional and knowledge and skill set possessed by agency and program administrators on one hand and by policy analysts and policymakers on other. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Strategic Planning for Public and Nonprofit Organizations", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF M290I": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Same as Community Health Sciences M420 and Health Policy M420.) Lecture, three hours; fieldwork, one hour. Examination and evaluation of principles, policies, programs, and practices that have evolved to identify, assess, and meet special needs of infants, children, and adolescents with developmental disabilities or chronic illness and their families. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Children with Special Healthcare Needs: Systems Perspective", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF M290J": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Same as Public Policy M212.) Lecture, three hours. Development of social policy as it affects families and children from different cultural backgrounds and as it is given form in public child welfare system. Examination of development of infrastructure to support needs of children and families. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Child Welfare Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF M290K": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Same as Public Policy M213.) Lecture, three hours. Examination of evolution of social policy and services for mentally ill, with emphasis on political, economic, ideological, and sociological factors that affect views of mentally ill and services they are provided. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Mental Health Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF M290L": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Same as Public Policy M214 and Urban Planning M246.) Lecture, three hours. Major policy and research issues concerning poverty and social welfare policy directed toward poor in U.S. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Poverty, Poor, and Welfare Reform", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF M290M": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Same as Public Policy M215.) Lecture, three hours. Introduction to contemporary issues in healthcare financing and delivery, providing historical perspective on emergence of these issues. Examination of major public programs and their relationship to issues of access and cost. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Health Policy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF M290N": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Same as Public Policy M216.) Lecture, three hours. Policy issues that affect children and adolescents in relation to their interaction with schools and community, with emphasis on impact of policy across federal, state, and local levels. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Public Policy for Children and Youth", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF M290P": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Same as Public Policy M261.) Lecture, three hours; outside study, nine hours. Designed for graduate students. Examination of theoretical models and concepts of policy process and application to aging policy. Analysis of decision-making processes that affect social policies. Description of historical development of contemporary policy. Exploration of current proposals and issues. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Aging Policy, Elderly and Families", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF M290Q": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Same as Asian American Studies M290Q.) Seminar, three hours. Overview of social welfare policy in Asian American communities. Introduction to major social welfare policies and programs in the U.S. and impact on Asian American communities. Policy development, approaches, processes of implementation, evaluation, and strategies to effect policy. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Social Welfare Policy in Asian American Communities", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF M290R": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Same as Public Policy M295 and Urban Planning M248.) Lecture, three hours. Designed for graduate students. Study of major income-maintenance programs in U.S., with emphasis on interaction of moral attitudes toward poor and structure and implementation of law, policy, and administration. Current reform consensus and major reforms. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Law and Poor", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF M290S": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Same as Public Policy M227 and Urban Planning M287.) Lecture, three hours; outside study, nine hours. Use of political economy perspective to analyze forces that have shaped rise and characteristics of nonprofit sector and its constituent elements. Examination of social history of nonprofit sector in U.S. Exploration of legal and policy environments and distinct organizational forms. Comparative perspective between U.S. and other countries. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Politics, Power, and Philanthropy", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF M290U": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Same as Public Policy M243 and Urban Planning M275.) Lecture, three hours; outside study, nine hours. Designed for graduate students. Examination of role of U.S. housing policy and role of government agencies and community organizations. Is problem housing or economic development? Should interventions be directed toward inner city housing markets or through neighborhood strategies? What lessons can be learned from experiences of other countries? Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Community Development and Housing Policies: Roles of State, Civil Society, and Nonprofits", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC WLF M290V": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC WLF", 
        "departmentFullName": "Social Welfare", 
        "description": "(Same as Public Policy M226 and Urban Planning M286.) Lecture, three hours; outside study, nine hours. Designed for graduate students. Fundamental building blocks for successful management in nonprofit sector. Students develop management skills in strategic thinking/problem solving, project management, team building, and negotiation. Use of case studies to troubleshoot critical challenges, from finance to crisis management to marketing, that nonprofit managers typically face. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Management Challenges and Tools for Nonprofit Sector", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }
}