{
    "SOCIOL 1": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, four hours; discussion, one hour. Survey of characteristics of social life, processes of social interaction, and tools of sociological investigation. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introductory Sociology", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 10": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, two hours. Introduction to history of social thought, with special emphasis on theoretical precursors to development of discipline of sociology. Exposition and analysis of selected social theorists and concepts, especially from the 17th to 19th centuries. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Social Thought and Origins of Sociology", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 101": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Comparative survey of basic concepts and theories in sociology from 1850 to 1920. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Development of Sociological Theory", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 102": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Requisite: course 101. Critical examination of significant theoretical formulations from 1920 to present. P/NP or letter grading.", 
        "prerequisiteDescription": "course 101", 
        "prerequisites": [
            [
                "SOCIOL 101"
            ]
        ], 
        "title": "Contemporary Sociological Theory", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 106A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, two hours; discussion, two hours; fieldwork, eight to 10 hours. Research practicum in which students write field notes on their experiences in and observations of intensive internship field placement. Readings focus on fieldwork roles and relations, observing and describing, writing field notes, field interviewing, ethical issues, and preliminary data analysis. Fieldwork and extensive field notes required. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Field Research Methods I", 
        "unit": 6, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 106B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, two hours; discussion, two hours; fieldwork, 10 hours. Requisite: course 106A. Collection and analysis of both field notes and unstructured interview data from student field placement. Use of techniques of qualitative data analysis, including qualitative coding, analytic memoing, and grounded theory methods, to analyze these materials and to write ethnographic paper. Letter grading.", 
        "prerequisiteDescription": "course 106A", 
        "prerequisites": [
            [
                "SOCIOL 106A"
            ]
        ], 
        "title": "Field Research Methods II", 
        "unit": 6, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 110": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Designed for juniors/seniors. General problems of scientific abstraction, generalization, inference, and verification and particular problems of historical specification, comparison, and counterfactual reasoning in constructing and testing replicable explanation of historical event. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sociohistorical Methods", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 111": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; laboratory, one hour. Analysis of how social networks create social structure, how social actors utilize them, and their unexpected effects. Topics include job search, firm efficiency, and social movements. Visualization programs, computer simulations, and research project. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Social Networks", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 112": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; laboratory, one hour. Requisites: Mathematics 2, 3A (course whose content includes introductions to probability theory, matrix algebra, and differential and integral calculus), Statistics 10. Mathematical treatment of several sociological phenomena, such as occupational mobility, population growth, organizational structure, and friendship patterns, each covered in some detail, including initial development and subsequent evaluation and modification (emphasizing both deductive and computational aspects of mathematics). Letter grading.", 
        "prerequisiteDescription": "MATH 2, 3A (course whose content includes introductions to probability theory, matrix algebra, and differential and integral calculus), STATS 10", 
        "prerequisites": [], 
        "title": "Introduction to Mathematical Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 113": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; laboratory, one hour. Requisite: Statistics 10. Continuation of Statistics 10, covering more advanced statistical techniques such as multiple regression, analysis of variance, or factor analysis. Content varies. Students learn how to use computer and write papers analyzing prepared data sets. P/NP or letter grading.", 
        "prerequisiteDescription": "STATS 10", 
        "prerequisites": [], 
        "title": "Statistical and Computer Methods for Social Research", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 116": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Studies of past, present, and future trends in population growth. Sociological theories of causes and consequences of population growth and redistribution. Emphasis on correlates of fertility, mortality, and migration. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Social Demography", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 117": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Examination of demographic behaviors, such as marriage, divorce, and childbearing, associated with family and household organization. Sociological approach to understanding causes and consequences of trends and differentials in family formation and dissolution. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Family Demography", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 119": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Limited to juniors/seniors. Selected topics on diverse behaviors and cultural forms of primate cousins, with special focus on baboons, chimpanzees, and gorillas. Examination of primate socioecology, sexual competition, demography and kinship, politics, communication, and interactions within and between groups. Implications for our lives as human primates. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Primate Societies", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 121": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Examination of classic and contemporary work in social scientific study of religion. Analysis of definition of religion, role of religion in modern life, and role of categories like Islam in contemporary U.S. politics. Focus on complicated question of what it means to say someone or something is religious: does that mean they are moral, believe in God, or are part of community of believers? Students gain better sense of how to think and talk about religion. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sociology of Religion", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 122": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Exploration of macro-, meso-, and micro-level theories of violence, why states organize violence, why civilizations participate in violence, and physical, structural, and symbolic violence. Discussion of how various social categories such as race, ethnicity, religion, class, gender, and sex are implicated in violence and examination of cases of interstate war, genocide, civil war, terrorism, and pograms from around world.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sociology of Violence", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 126": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Properties of norms, of normatively governed conduct, of lay and professional methods for describing, producing, using, and validating norms in contrasting settings of socially organized activities; relevance of these properties for programmatic problems of analytic sociology. Fieldwork required. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Study of Norms", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 127": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, two and one half hours; discussion, one hour. Requisite: course 1. Study of social production of modes of thought and forms of knowledge. Study of ways in which bodies of knowledge and cognitive styles are produced, used, and transformed in everyday, organizational, and extraordinary contexts. P/NP or letter grading.", 
        "prerequisiteDescription": "course 1", 
        "prerequisites": [
            [
                "SOCIOL 1"
            ]
        ], 
        "title": "Mind and Society", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 128": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Requisite: course 1. Designed for juniors/seniors. Sociological theories and explanations of social conditions shaping and producing emotional experiences; effects of individual expression of emotions on social conditions; relations between thought, sensations, and emotions; self and emotions; social construction of emotions. P/NP or letter grading.", 
        "prerequisiteDescription": "course 1", 
        "prerequisites": [
            [
                "SOCIOL 1"
            ]
        ], 
        "title": "Sociology of Emotions", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 129": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Conceptualizations of time seen from scientific, philosophical, historical, and sociological perspectives; \"cyclical\" and \"linear\" time in primitive, ancient, and medieval societies; ritual, the sacred, and experience of the eternal; structuring of urban, modern, and postmodern societies by clock, calendar, and schedule; future value orientation and notion of progress; time, labor, and social domination. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sociology of Time", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 130": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Examination of social processes shaping experience, definition, and enactment of self and personal identity. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Self and Society", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 131": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours. Limited to juniors/seniors. Examination of possible career paths for Sociology majors, including such fields as business, nonprofit sector, government, healthcare, entertainment, and other areas. Development of career-relevant materials and skills. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Careers in Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 132": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Survey of contribution of sociologists to theory and research in social psychology, including theories of social control; conformity and deviation; reference groups; and interaction process. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Social Psychology: Sociological Approaches", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 133": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Requisite: course 1. Designed for juniors/seniors. Characteristics of crowds, mobs, publics, social movements, and revolutions; their relation to social unrest and their role in developing and changing social organization. P/NP or letter grading.", 
        "prerequisiteDescription": "course 1", 
        "prerequisites": [
            [
                "SOCIOL 1"
            ]
        ], 
        "title": "Collective Behavior", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 134": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Requisite: course 1. Designed for juniors/seniors. Theories of relation of variations in personality to culture and group life, in primitive and modern societies, and influence of social role on behavior. P/NP or letter grading.", 
        "prerequisiteDescription": "course 1", 
        "prerequisites": [
            [
                "SOCIOL 1"
            ]
        ], 
        "title": "Culture and Personality", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 141A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, 20 hours. Mexico-U.S. migration is largest and oldest continuous international population flow of contemporary world. In recent decades, prompted by swift economic transformations, rural and urban Mexicans from every corner of Mexico have joined this migratory flow, settling well beyond southwestern region and into far-reaching areas of U.S. interior. Migration is binding U.S. and Mexico stronger than ever, putting this complex and multilayered phenomena at top of bilateral agenda. Examination of sociological dynamics of international migration and labor as they apply to Mexico-U.S. context, including demographic, political, and economic dynamics of migration, economic and social infrastructures that support cross-border mobility, and connections of migration with binational, national, regional, and local labor markets. Comparative insights to contrast this flow with other contemporary population streams. Offered in summer only. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Migration and Labor in Mexico-U.S", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 141B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, 10 hours; fieldwork, 10 hours. Development of qualitative micro-study and research paper on migration and labor in Mexico-U.S. context. Research topic of interest to be selected so students become familiar with commonly employed qualitative methods of research. Designed to help students understand basics of methodological reasoning, how to formulate research questions, and how to frame and investigate one particular issue related to migration and labor. How to make ethical decisions about conducting research. Development of student abilities as researchers by conducting secondary and primary research culminating in final research paper to be presented to faculty members and peers. Offered in summer only. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Migration and Labor in Mexico-U.S", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 143": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Requisites: courses 1, 20, 101. Exploration of long-run historical trends in relationship between human health and social organization, drawing on historical, anthropological, demographic, and sociological concepts, theories, and data. P/NP or letter grading.", 
        "prerequisiteDescription": "courses 1, 20, 101", 
        "prerequisites": [], 
        "title": "Human Health and Society", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 145": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Examination of leading sociological approaches to study of deviation and general survey of major types of deviation in American society. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sociology of Deviant Behavior", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 147A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Sociological theories of social origins, organization, and meanings of crime and criminal behaviors. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sociology of Crime", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 147B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Examination of structures and routine decision-making processes of key criminal justice institutions, including police, courts, probation and parole, jails and prisons. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sociology of Criminal Justice", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 149": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Examination of processes through which youth become involved in juvenile justice system. Analysis of this system as people-processing and people-changing institution as context for considering critical issues in juvenile justice. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Youth, Trouble, and Juvenile Justice", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 151": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Survey of immigration of Europeans, Asians, and Hispanics to the U.S. since the mid-19th century. Overview of immigration experience on ethno-racial groups that migrated voluntarily to this country, with emphasis on immediate postimmigration settlement. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Comparative Immigration", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 152": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Requisite: course 151. Comparison of acculturation and assimilation of Europeans, Africans, Mexicans, and Asians in the U.S., with emphasis on long-term cultural consequences of immigration. P/NP or letter grading.", 
        "prerequisiteDescription": "course 151", 
        "prerequisites": [
            [
                "SOCIOL 151"
            ]
        ], 
        "title": "Comparative Acculturation and Assimilation", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 154": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Not open to freshmen. Role of race and ethnicity in political, economic, and social lives of nations other than the U.S. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Race and Ethnicity: International Perspectives", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 156": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Role of race and ethnicity in the U.S., including interplay between racial and ethnic structures and meanings. Special attention to comparison of African American and European American experiences and to transformation of Asian American and Latino communities and the nation generally, wrought by renewal of mass migration in second half of the 20th century. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Race and Ethnicity in American Life", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 157": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Analysis of American social structure in terms of evaluational differentiation. Topics include criteria for differentiation, bases for evaluation, types of stratification, composition of strata and status systems, mobility, consequences of stratification, and problems of methodology. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Social Stratification", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 158": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Description and analysis of urbanization and urbanism in the U.S. and world. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Urban Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 168": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Sociological analysis of organizations and their social environment. Introduction to basic theories, concepts, methods, and research on behavior of organizations in society. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Organizations and Society", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 169": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Specific topics may include law in preindustrial and industrialized societies, legalization of contemporary social relations, participants' experiences of legal processes, lay perceptions of justice, social movements toward equal justice, roles of lawyers and judges, social impact of court decisions. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Law and Society", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 170": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Requisite: course 1. Provides majors in Sociology and other social sciences, as well as students preparing for health sciences careers, with understanding of health-seeking behavior and interpersonal and organizational relations that are involved in receipt and delivery of health services. P/NP or letter grading.", 
        "prerequisiteDescription": "course 1", 
        "prerequisites": [
            [
                "SOCIOL 1"
            ]
        ], 
        "title": "Medical Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 171": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Description and analysis of representative occupations and professions, with emphasis on contemporary U.S. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Occupations and Professions", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 172": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Description and analysis of entrepreneurship, with special reference to historical origins, ideology, international comparisons, women and ethnic minority participation, legal and illegal forms, public and private auspices. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Entrepreneurship", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 173": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Sociology of economic life, with emphasis on principal economic institutions of the U.S. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Economy and Society", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 180A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Limited to juniors/seniors. Study of selected topics of sociological interest. Consult \"Schedule of Classes\" for topics and instructors. May be repeated for credit and may be applied as elective units toward Sociology major. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Topics in Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 180B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Limited to juniors/seniors. Study of selected topics of sociological interest. Consult \"Schedule of Classes\" for topics and instructors. May be repeated for credit and may be applied as elective units toward Sociology major. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Topics in Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 180C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Limited to juniors/seniors. Study of selected topics of sociological interest. Consult \"Schedule of Classes\" for topics and instructors. May be repeated for credit and may be applied as elective units toward Sociology major. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Topics in Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 180D": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Limited to juniors/seniors. Study of selected topics of sociological interest. Consult \"Schedule of Classes\" for topics and instructors. May be repeated for credit and may be applied as elective units toward Sociology major. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Topics in Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 180E": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Limited to juniors/seniors. Study of selected topics of sociological interest. Consult \"Schedule of Classes\" for topics and instructors. May be repeated for credit and may be applied as elective units toward Sociology major. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Topics in Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 180F": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Limited to juniors/seniors. Study of selected topics of sociological interest. Consult \"Schedule of Classes\" for topics and instructors. May be repeated for credit and may be applied as elective units toward Sociology major. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Topics in Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 180G": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Limited to juniors/seniors. Study of selected topics of sociological interest. Consult \"Schedule of Classes\" for topics and instructors. May be repeated for credit and may be applied as elective units toward Sociology major. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Topics in Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 181A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Designed for juniors/seniors. Exploration of 20th-century changes in China, including end of dynasties, Republican era, Communist Revolution, and market reform. Topics include transformation in Chinese social structure and institutions and everyday practices. Survey of changes and analysis of forces shaping contemporary China and global impact and current implications. May be taken independently for credit. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sociology of Contemporary China", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 181B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Designed for juniors/seniors. Survey of changes in Chinese society from beginning of 20th century to present. Topics include social mobility and inequality, family and household, and population. Emphasis on changes post-Reform Era and in present. Focus on interaction of economic and political change plus family organization. Contrasts and similarities between China and West, China's place in social sciences, and challenges due to social organization that originated from studying Western societies. May be taken independently for credit. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sociology of Contemporary China", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 182": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Contributions of sociology to study of politics, including analysis of political aspects of social systems, social context of action, and social bases of power. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Political Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 183": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Requisite: course 1. Survey of central themes of comparative and historical studies in sociology. Various aspects of development of modern society, including development of nation-state, emergence of capitalism, industrialization, and population growth. Variation in contemporary society, viewed from variety of theoretical perspectives. P/NP or letter grading.", 
        "prerequisiteDescription": "course 1", 
        "prerequisites": [
            [
                "SOCIOL 1"
            ]
        ], 
        "title": "Comparative and Historical Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 185": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Analysis of major institutions in the U.S. in historical and international perspective, with emphasis on topics such as industrialization, work, state, politics, community, family, religion, and American culture. Theories of social change, conflict, and order applied to case of the U.S. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "American Society", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 186": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Social structure and social conflict in Latin America, with special attention to racial and class structures and dilemmas of economic and political development. Country and specific focus varies each term. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Latin American Societies", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 188SA": {
        "corequisiteDescription": "HNRS 101E", 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Individual Studies for USIE Facilitators", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 188SB": {
        "corequisiteDescription": "HNRS 101E", 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.", 
        "prerequisiteDescription": "course 188SA", 
        "prerequisites": [
            [
                "SOCIOL 188SA"
            ]
        ], 
        "title": "Individual Studies for USIE Facilitators", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 188SC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.", 
        "prerequisiteDescription": "course 188SB", 
        "prerequisites": [
            [
                "SOCIOL 188SB"
            ]
        ], 
        "title": "Individual Studies for USIE Facilitators", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 189": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 189HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Contracts", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 19": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Fiat Lux Freshman Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 191A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Limited to junior/senior Sociology majors. Examination of cultural, historical, and interactional contexts shaping definition, enactment, and experience of self. Reading, discussion, and development of culminating project. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Undergraduate Seminar: Self and Identity", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 191B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Limited to junior/senior Sociology majors. Selected topics. Reading, discussion, and development of culminating project. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Undergraduate Seminar: Sociology of Humor and Laughter", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 191C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Limited to junior/senior Sociology majors. Selected topics. Reading, discussion, and development of culminating project. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Undergraduate Seminar: Money and Emotions", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 191D": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Limited to juniors/seniors. Taught in Spanish. Selected topics on development in Third World from global perspective. Reading, discussion, and development of culminating project. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Undergraduate Seminar: Sociology of Development", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 191E": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Limited to juniors/seniors. Selected topics. Reading, discussion, and development of culminating project. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Undergraduate Seminar: Population Growth Models", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 191F": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Limited to juniors/seniors. Great extension of social relations across globe has occurred over last 50 years. What are causes and mechanisms of this process, how far has it transformed human societies, and how far will it go in future? Economic, cultural, political, and military aspects of globalization, with focus on extent to which global expansion of capitalism, nation-state system, and American imperialism reinforce or undercut each other, producing new lines of division and conflict across world. Reading, discussion, and development of culminating project. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Undergraduate Seminar: Sociology of Globalization", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 191H": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. In-depth introduction to process of producing scholarly sociological research for students who intend to write undergraduate thesis for departmental honors. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Seminars: Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 191I": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Limited to juniors/seniors. During past century, social inequalities in health and survival were widening in the U.S. as in other developed societies. Broad overview of these trends and their causes. Reading, discussion, and development of culminating project. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Undergraduate Seminar: Health and Inequality", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 191J": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Selected topics on contemporary Mexican society and vital transformations it has undergone in recent years. Reading, discussion, and development of culminating project. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Undergraduate Seminar: Mexican Society", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 191K": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Limited to juniors/seniors. Use of history of tobacco and cigarette smoking to explore important themes in sociology, history, and culture. History of tobacco from its roots in Native American culture, its contribution to foundation of European colonies in New World, its cultural incorporation in western Europe, its role in rise of industrial way of life and health consequences, and its demise as legitimate soft drug for modern urban people. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Undergraduate Seminar: Cigarettes and Western Civilization -- Sociological History of Smoking", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 191L": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Limited to juniors/seniors. Sociological approach to study of environmental issues and problems. Topics include ecopolitics and ecofeminism, environmental racism, global environmental change, sustainable development, and society-environment interface. Reading, discussion, and development of culminating project. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Undergraduate Seminar: Environmental Justice and Sustainability", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 191M": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Limited to juniors/seniors. Fundamentals of sociological approach to social ecology, also known as human ecology. Study of adaptation of population to its environment. Topics include density, maintaining personal space, space and territoriality, and effects of environment on humans. Reading, discussion, and development of culminating project. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Undergraduate Seminar: Social Ecology", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 191NY": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, eight hours. Limited to students in summer UCLA Travel Study Program. Cutting-edge urban issues in country's largest city, including New York's attempt to plan for city of 9.2 million, rebuilding of World Trade Center, Robert Moses (New York's master builder), urban economic development, green New York, transportation systems, urban politics, house and architectural styles, including New York's famous skyscrapers, historic preservation, crime and police departments, ghetto, education, urban poor, public housing, and search for affordable housing. Offered in summer only. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Undergraduate Seminar: Urban and Suburban Sociology in New York City", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 191O": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Limited to juniors/seniors. Exploration of historically specific understandings of love. Reading, discussion, and development of culminating project. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Undergraduate Seminar: Ideals of Love in Historical Perspective", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 191P": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Limited to juniors/seniors. Social and human reproduction is global policy issue. Government efforts to influence reproduction are important feature of modern state: political intervention into private life, intimacy, and sexuality. Exploration of politics of reproduction -- intersection between politics and life cycle or between public sphere and private lives -- and coverage of broad range of issues addressing prevention and promotion of reproduction from historical-comparative approach. Reading, discussion, and development of culminating project. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Undergraduate Seminar: Politics of Reproduction", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 191Q": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Limited to juniors/seniors. Sociology dimensions of patient care in primary care context. Use of microsociological methods to examine main facets of American primary care medical visits, including detailed analysis of interactional conduct of those visits and development of microanalytical constructs into quantitative measures. Emphasis on direct contact with empirical materials and development of observational and analytic skills. Reading, discussion, and development of culminating project. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Undergraduate Seminar: Communication in Medical Care", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 191R": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Limited to juniors/seniors. Introduction to classic theoretical approaches and contemporary developments in study of social worlds dedicated to creating and handling cultural institutions such as literature, journalism, film/television, art, architecture, music, dance, and museums. Discussion of such issues as contemporary validity of distinction between high and popular/low culture, relationship of mainstream and marginal culture, how culture expresses and reinforces social inequality, organizational context of culture, and how people express and decipher meaning in cultural objects. Reading, discussion, and development of culminating project. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Undergraduate Seminar: Cultural Sociology", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 191S": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Limited to juniors/seniors. Sexuality is important site for enactment of gender and gender identity. Sexual preference and sexual behavior can also form basis for social identity, repression, discrimination, and privilege, independent of gender. Social factors such as social class, ethnicity, generation, and networks shape our sexual practices and choice of partners. Reading and writing about variety of original sociological, historical, and anthropological texts and development of culminating project. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Undergraduate Seminar: Sociology of Gender and Sexuality", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 191T": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Limited to juniors/seniors. Study of relationship between society's military and its social organization in general, with particular attention to shock-based civic militarism characteristic of the West. Topics include honor, discipline, bureaucracy, conscription, logistics, total war, guerilla war, terrorism, and counterinsurgency. Reading, discussion, and development of culminating project. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Undergraduate Seminar: War and Society", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 191V": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Limited to juniors/seniors. Study of selected topics of sociological interest. Reading, discussion, and development of culminating project. Consult \"Schedule of Classes\" for topics and instructors. May be repeated for credit and may be applied as elective units toward Sociology major. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Variable Topics Research Seminars: Sociology", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 194": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, two hours. Designed for undergraduate students who are part of research group. Discussion of research methods and current literature in field. May be repeated for credit. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Research Group Seminars: Sociology", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 195": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Tutorial, three hours. Limited to juniors/seniors. Internship in community agency or business to be supervised jointly by Center for Community Learning and faculty adviser. Students meet on regular basis with instructor and provide weekly reports of their experience. Normally only 4 units of internship are allowed. Individual contract with supervising faculty member required. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Community or Corporate Internships in Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 195CE": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Tutorial, to be arranged; fieldwork, eight to 10 hours. Limited to juniors/seniors. Internship in corporate, governmental, or nonprofit setting coordinated through Center for Community Learning. Students complete weekly written assignments, attend biweekly meetings with graduate student coordinator, and write final research paper. Faculty sponsor and graduate student coordinator construct series of reading assignments that examine issues related to internship site. May be repeated for credit with consent of Center for Community Learning. No more than 4 units may be applied toward major; units applied must be taken for letter grade. Individual contract with supervising faculty member required. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Community and Corporate Internships in Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 198A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Tutorial, one hour. Requisite: course 191H. Limited to sociology honors program students. Design of research project to serve as student's honors thesis. Research proposal, detailed bibliography, and regular meetings with sponsoring faculty member required. May be repeated for credit. Individual contract required. Letter grading.", 
        "prerequisiteDescription": "course 191H", 
        "prerequisites": [
            [
                "SOCIOL 191H"
            ]
        ], 
        "title": "Honors Research in Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 198B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Tutorial, one hour. Requisites: courses 191H, 198A. Limited to sociology honors program students. Continuation of work initiated in course 198A. Development of honors thesis in consultation with instructor. May be repeated for credit. Individual contract required. Letter grading.", 
        "prerequisiteDescription": "courses 191H, 198A", 
        "prerequisites": [], 
        "title": "Honors Research in Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 198C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Tutorial, one hour. Requisites: courses 191H, 198B. Limited to sociology honors program students. Completion of honors thesis under direct supervision of honors faculty director. May be repeated for credit. Individual contract required. Letter grading.", 
        "prerequisiteDescription": "courses 191H, 198B", 
        "prerequisites": [], 
        "title": "Honors Research in Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 199": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Tutorial, one hour. Preparation: 3.0 grade-point average in major. Requisites: course 1, and Political Science 6 or Statistics 10 or 13. Limited to junior/senior Sociology majors. Independent intensive study designed for students who want to do research under guidance of faculty mentor. Scheduled meetings to be arranged between faculty member and student. Culminating paper or project required. May be repeated for maximum of 16 units, but only 8 units may be applied toward major. Individual contract required; see undergraduate counselor. P/NP or letter grading.", 
        "prerequisiteDescription": "course 1, and Political Science 6 or STATS 10 or 13", 
        "prerequisites": [], 
        "title": "Directed Research in Sociology", 
        "unit": "2 to 4", 
        "unitType": "RANGE"
    }, 
    "SOCIOL 20": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Introduction to methods used in contemporary sociological research, with focus on issues of research design, data collection, and analysis of data. Fieldwork may be required. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Sociological Research Methods", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 201A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, two hours every other week. Required of first-year graduate sociology students. Introduction to range of theoretical and research interests represented by department faculty members. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Proseminar: Sociology", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 201B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, two hours every other week. Required of first-year graduate sociology students. Introduction to range of theoretical and research interests represented by department faculty members. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Proseminar: Sociology", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 201C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, two hours every other week. Required of first-year graduate sociology students. Introduction to range of theoretical and research interests represented by department faculty members. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Proseminar: Sociology", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 202A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, two hours; discussion, two hours. Required of first-year graduate sociology students. Examination of interrelations of theory, method, and substance in exemplary sociological works, with analytical and skills-centered orientation. In Progress grading (credit to be given only on completion of course 202B).", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Theory and Research in Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 202B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, two hours; discussion, two hours. Required of first-year graduate sociology students. Examination of interrelations of theory, method, and substance in exemplary sociological works, with analytical and skills-centered orientation. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Theory and Research in Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 203": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Designed to help graduate students develop regular and productive writing practices. Appropriate for students in their second year or beyond who have one full draft of their M.A. paper written and want to revise and publish it in timely manner. Development of regular writing schedules and protecting them from competing demands. Learning of specific genres of writing for academic journals, books, and op-eds. Editing of students' own work and that of classmates. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "How to Write a Lot", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 204": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, four hours. Examination of selected issues and problems in classical or contemporary sociological theory. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Topics in Sociological Theorizing", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 205": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours. Examination of sources of change in family and household organization, with major focus on relationships among economic institutions, family structure, and content of family life. Consideration of concepts, theories, and data about kinship. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Family and Social Change", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 208A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; laboratory, one hour. Requisites: courses 210A, 210B. Techniques for measuring characteristics of networks and positions in networks. Centrality of positions, centralization and density of networks, structural equivalence, cliques. Readings of exemplars of network research. Computer programs. S/U or letter grading.", 
        "prerequisiteDescription": "courses 210A, 210B", 
        "prerequisites": [], 
        "title": "Social Network Methods", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 208B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; laboratory, one hour. Requisites: courses 210A, 210B. Techniques for measuring characteristics of networks and positions in networks. Centrality of positions, centralization and density of networks, structural equivalence, cliques. Readings of exemplars of network research. Computer programs. S/U or letter grading.", 
        "prerequisiteDescription": "courses 210A, 210B", 
        "prerequisites": [], 
        "title": "Social Network Methods", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 210A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, two hours. Intermediate statistical methods using computers: probability theory, sampling distributions, hypothesis testing, interval estimation, multiple regression and correlation, experimental design, analysis of variance and covariance, contingency tables, sampling theory. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Intermediate Statistical Methods I", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 210B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, two hours. Intermediate statistical methods using computers: probability theory, sampling distributions, hypothesis testing, interval estimation, multiple regression and correlation, experimental design, analysis of variance and covariance, contingency tables, sampling theory. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Intermediate Statistical Methods II", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 210C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Requisite: course 210B. Survey of advanced statistical methods used in social research, with focus on problems for which classical linear regression model is inappropriate, including categorical data, structural equations, longitudinal data, incomplete and erroneous data, and complex samples. S/U or letter grading.", 
        "prerequisiteDescription": "course 210B", 
        "prerequisites": [
            [
                "SOCIOL 210B"
            ]
        ], 
        "title": "Intermediate Statistical Methods III", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 211A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours. Topics include relationship of theory and fact to social sciences, logic of comparative and historical analysis, and substantive paradigms of comparative and historical analysis. Reading involves methodological examination of basic works in representative problem areas. In Progress grading (credit to be given only on completion of course 211B).", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Comparative and Historical Methods: Strategies of Research and Conceptualization", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 211B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours. Requisite: course 211A. Topics include problem of evidence, quantitative and qualitative data. Techniques of data analysis, including use of manuscript census, content analysis, collective biography, and secondary analysis. S/U or letter grading.", 
        "prerequisiteDescription": "course 211A", 
        "prerequisites": [
            [
                "SOCIOL 211A"
            ]
        ], 
        "title": "Comparative and Historical Methods: Research Techniques", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 212A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Enforced requisites: courses 210A, 210B. Course 212A is enforced requisite to 212B. Analysis and interpretation of primarily nonexperimental quantitative data, with focus on sample survey and census data. Extensive practice at utilizing statistical methods encountered in previous courses, culminating in term paper proposal in style of \"American Sociological Review\" or similar journal article. Topics include simple tabular analysis, correlation, log-linear analysis, ordinary least squares regression, regression with interactions, robust regression, diagnostic procedures, and methods for handling complex sample survey designs. In Progress grading (credit to be given only on completion of course 212B).", 
        "prerequisiteDescription": "courses 210A, 210B", 
        "prerequisites": [], 
        "title": "Quantitative Data Analysis", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 212B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 212A. Analysis and interpretation of primarily nonexperimental quantitative data, with focus on sample survey and census data. Extensive practice at utilizing statistical methods encountered in previous courses, culminating in term paper in style of American Sociological Review or similar journal article. Topics include missing data; binomial, multinomial, and ordinal logistic regression; factor analysis and scale construction; methods for causal inference, including fixed effects and propensity score matching; and primer on advanced topics, including structural equations and multilevel models. S/U or letter grading.", 
        "prerequisiteDescription": "course 212A", 
        "prerequisites": [
            [
                "SOCIOL 212A"
            ]
        ], 
        "title": "Quantitative Data Analysis", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 212C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours. Designed for graduate and undergraduate students who have had some exposure to statistics and quantitative methods. Introduction to study design, including experimental, longitudinal, cohort, time-series designs, contextual, and other designs. Discussion of suitability of various design classes for specific analytic goals, as well as their comparative strengths and weaknesses. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Study Design and Other Issues in Quantitative Data Analysis", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 213B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours. Preparation: exposure to binary response models. Requisites: courses 210A, 210B. Introduction to regression-like analyses in which outcome is time to event. Topics include logit models for discrete-time event history models; piecewise exponential hazards models; proportional hazards; nonproportional hazards; parametric survival models; heterogeneity; multilevel survival models. S/U or letter grading.", 
        "prerequisiteDescription": "courses 210A, 210B", 
        "prerequisites": [], 
        "title": "Applied Event History Analysis", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 213C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours. Enforced requisite: course M213A. Population models and their dynamics in population processes. How demographic models are used in estimation of population size, age structure, and associated dynamics. Computer simulations of demographic processes to gauge conclusions from demographic models. Estimation of demographic models in human population and broader relevance of demographic analysis to study of any population or system, including health and social systems. S/U or letter grading.", 
        "prerequisiteDescription": "course M213A", 
        "prerequisites": [
            [
                "SOCIOL M213A"
            ]
        ], 
        "title": "Population Models and Dynamics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 216A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, 90 minutes; discussion, 90 minutes. Requisite: course 210A. History of survey method; facet metatheory and concept formation; questionnaire and item design; scales, indices typologies; data collection -- planning and management; network, snowball, and experience sampling; multistage probability sampling, stratification and clustering. Students participate in survey research project. Letter grading.", 
        "prerequisiteDescription": "course 210A", 
        "prerequisites": [
            [
                "SOCIOL 210A"
            ]
        ], 
        "title": "Survey Research Design", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 216B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, 90 minutes; discussion, 90 minutes. Requisite: course 210A. History of survey method; facet metatheory and concept formation; questionnaire and item design; scales, indices typologies; data collection -- planning and management; network, snowball, and experience sampling; multistage probability sampling, stratification and clustering. Students participate in survey research project. Letter grading.", 
        "prerequisiteDescription": "course 210A", 
        "prerequisites": [
            [
                "SOCIOL 210A"
            ]
        ], 
        "title": "Survey Research Design", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 217A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Analysis of ethnographic monographs. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Analyzing Ethnographies", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 217B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Recommended requisite: course 217A. Theories and techniques of ethnographic fieldwork. Kinds of problems amenable to ethnographic approaches, methods, and techniques for doing fieldwork, and ethnical problems involved in such research. In Progress grading (credit to be given only on completion of course 217C).", 
        "prerequisiteDescription": "course 217A", 
        "prerequisites": [
            [
                "SOCIOL 217A"
            ]
        ], 
        "title": "Ethnographic Fieldwork", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 217C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Recommended requisite: course 217A. Theories and techniques of ethnographic fieldwork. Kinds of problems amenable to ethnographic approaches, methods, and techniques for doing fieldwork, and ethnical problems involved in such research. Letter grading.", 
        "prerequisiteDescription": "course 217A", 
        "prerequisites": [
            [
                "SOCIOL 217A"
            ]
        ], 
        "title": "Ethnographic Fieldwork", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 220": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours. Examination of social and cultural processes shaping definition and experience of the self, embodied interactional practices through which the self is constructed in everyday and institutional contexts, formation and transformation of self during life course, and construction of collective identity. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Self and Society", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 222": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours. Designed for graduate students. Basic issues, methods, and topics of ethnomethodological, phenomenological, conversation-analytic, and related varieties of inquiry. themes such as world of everyday life, problem of rationality, rules/norms and tacit knowledge, problem of social order, speaking and discourse, constitutive practices, and production of ordinary interaction in first part; guest presentations by affiliated faculty in second part. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Foundations of Ethnomethodological, Phenomenological, and Analytical Sociologies", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 223": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours. Comparison of phenomenological and symbolic interactionist perspectives by examining particular body of live or currently unresolved substantive issues. Topics vary; attention on development of phenomenological and interactionist thought on topic of concern, with special concern for ambiguities and divergences both within and between two approaches. When relevant, attention to logical and historical relations of phenomenology and interactionism of pragmatist, existentialist, and ordinary language philosophies. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Phenomenological and Interactionist Perspectives on Selected Topics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 226A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, two hours; discussion, one hour. Requisite: course 210A. Survey and critical examination of population theories and related major empirical research. Emphasis on interrelation of cultural, socioeconomic, and demographic factors. Introduction to elementary demographic methods utilizing microcomputers. S/U or letter grading.", 
        "prerequisiteDescription": "course 210A", 
        "prerequisites": [
            [
                "SOCIOL 210A"
            ]
        ], 
        "title": "Introduction to Theory and Major Empirical Research in Social Demography", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 226B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, two hours; discussion, one hour. Requisite: course 210A. Survey and critical examination of population theories and related major empirical research. Emphasis on interrelation of cultural, socioeconomic, and demographic factors. Introduction to elementary demographic methods utilizing microcomputers. S/U or letter grading.", 
        "prerequisiteDescription": "course 210A", 
        "prerequisites": [
            [
                "SOCIOL 210A"
            ]
        ], 
        "title": "Introduction to Theory and Major Empirical Research in Social Demography", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 227": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours. Designed for graduate students. Survey of theories and research concerning social determinants of systems of knowledge and role of intellectual and artistic elites in Western societies. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sociology of Knowledge", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 228": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours. Conceptual introduction to area of macrosociology in which exemplary works are read, studied for substance and methods, and critiqued in seminar and in written papers. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Critical Issues in Macrosociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 229B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, two hours. Course C229A is not requisite to 229B. Theory and research analyzing operation and decision-making processes of variety of people-processing institutions, including police, courts, schools, psychiatry, human service agencies, and medicine. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "People-Processing Institutions", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 230A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Preparation for independent research in area of comparative ethnicity, race, and nationalism through close reading of key theoretical and empirical works. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Comparative Ethnicity, Race, and Nationalism", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 230B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Preparation for independent research in area of comparative ethnicity, race, and nationalism through close reading of key theoretical and empirical works. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Comparative Ethnicity, Race, and Nationalism", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 230C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Introduction to comparative and historical sociology of race and ethnicity to demonstrate merits of double comparative approach to race, one that strives to be as comparative at level of theory (attending to relationship between race and other forms of social classification, including ethnicity and nationality) as it does at level of research. Exploration of cases from wide variety of countries, including Australia, Brazil, Colombia, Dominican Republic, Haiti, Mexico, modern China, modern Japan, Nazi Germany, Nicaragua, Rwanda, South Africa, Sudan, and U.S. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Comparative Ethnicity, Race, and Nationalism", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 232": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, four hours. Nature of class structure and how it affects relation of class structure to politics and political power. Issue of salience of class versus other identities such as gender, age, race, and nationalism. Examination of contemporary \"globalization\" tendencies of capitalism. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Class, Politics, and Society", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 233": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours. Designed for graduate students. Survey of field of political sociology, oriented around critical themes in major theoretical traditions and contemporary exemplars. Special attention to competing perspectives on power, theory of state, and relationship of class structure to politics. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Foundations of Political Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 234": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours; discussion, one hour. Readings and discussion of theoretical, historical, and specific issues in sociology of development (e.g., world system theory, developmental state, import substitution industrialization, export promotion industrialization, neoliberalism in Latin America, new approaches). S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sociology of Development", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 235A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Formerly numbered 235.) Lecture, three hours. Survey of theoretical and empirical literature on race, ethnicity, and immigrant groups in U.S. to provide comparative analysis of racial/ethnic groups as well as provide detailed knowledge of particular racial/ethnic groups, to situate contemporary experiences within historical contexts, to understand structural integration into U.S. society (i.e., structural assimilation or socioeconomic mobility), and to examine theoretical approaches to understanding race and ethnicity in contemporary society. Preparation for field examination in race and ethnicity. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Race/Ethnicity in U.S.", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 235B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Formerly numbered 261.) Lecture, three hours. Survey of theoretical and empirical literature on race, ethnicity, and immigrant groups in U.S. to provide comparative analysis of racial/ethnic groups as well as provide detailed knowledge of particular racial/ethnic groups, to situate contemporary experiences within historical contexts, to understand structural integration into U.S. society (i.e., structural assimilation or socioeconomic mobility), and to examine theoretical approaches to understanding race and ethnicity in contemporary society. Preparation for field examination in race and ethnicity. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Race/Ethnicity in U.S.", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 236A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours. Comprehensive overview of key current theoretical debates in study of international migration, with focus on exploration of possibilities of comparative (historical and cross-national) research program in field, linking North American, European, and other global experiences of immigration. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "International Migration", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 236C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours. Designed for students beginning or undertaking original research in field of international migration. Outside lectures, oral presentations of student projects, circulation of completed or draft student papers. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "International Migration", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 237": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, two hours. Designed for graduate students. Emphasis on one issue of particular importance for comparative analysis of capitalism and socialism, North America and Western Europe, developed capitalist and socialist countries and Third World, and implications for theory construction and social research. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Seminar: Theory and Research in Comparative Social Analysis", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 239A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours. Enforced requisites: courses 210A, 210B. Course 239A is enforced requisite to 239B. Introduction to literature on social stratification, mobility, and inequality in U.S. and abroad, with focus on concepts, data, methods, and facts about occupational and class structure; intergenerational transmission of socioeconomic status; effects of family, school, and labor market on socioeconomic achievement, careers, and inequality; earnings, income, and wealth distribution; poverty; social mobility; socioeconomic factors and marriage; gender and ethnic stratification; and health disparities. In Progress grading (credit to be given only on completion of course 239B).", 
        "prerequisiteDescription": "courses 210A, 210B", 
        "prerequisites": [], 
        "title": "Social Stratification, Mobility, and Inequality", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 239B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours. Enforced requisites: courses 210A, 210B, 239A. Introduction to literature on social stratification, mobility, and inequality in U.S. and abroad, with focus on concepts, data, methods, and facts about occupational and class structure; intergenerational transmission of socioeconomic status; effects of family, school, and labor market on socioeconomic achievement, careers, and inequality; earnings, income, and wealth distribution; poverty; social mobility; socioeconomic factors and marriage; gender and ethnic stratification; and health disparities. Letter grading.", 
        "prerequisiteDescription": "courses 210A, 210B, 239A", 
        "prerequisites": [], 
        "title": "Social Stratification, Mobility, and Inequality", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 241": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, one hour; discussion, two hours. Gender stratification in society and sociology; extent of gender diversity in human societies past and present; why gender is absent in classical macrosociology; can masculinist paradigms make space for gender or does feminist-informed sociology necessitate fresh approach? S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Theories of Gender in Society", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 244A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, two hours. Introduction to some structures basic to organization of conversational interaction: turn-taking organization and sequence organization. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Conversation Analysis I", 
        "unit": 6, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 244B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, two hours. Requisite: course 244A. Continuation of introduction to some structures basic to organization of conversational interaction: organization of repair, and practices of word selection and reference to persons, places, time, and action. S/U or letter grading.", 
        "prerequisiteDescription": "course 244A", 
        "prerequisites": [
            [
                "SOCIOL 244A"
            ]
        ], 
        "title": "Conversation Analysis II", 
        "unit": 6, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 244C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, two hours. Requisites: courses 244A, 244B. Continuation of introduction to some structures basic to organization of conversational interaction: practices of action formation, storytelling organization, and overall structural organization of single conversations. S/U or letter grading.", 
        "prerequisiteDescription": "courses 244A, 244B", 
        "prerequisites": [], 
        "title": "Conversation Analysis III", 
        "unit": 6, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 245": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, one hour; discussion, two hours. Exploration of classical approaches to cultural dimension of social life -- Weberian, Durkheimian, Parsonian, and critical -- and living traditions they have spawned. Examination of contemporary efforts at constructing new cultural sociology. Theoretical focus, with consideration of case studies. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Cultural Sociology: Classical and Contemporary Approaches", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 246": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Theoretical and methodological issues in structural approaches to culture. Perspectives include cultural economics, political economy, and production of culture. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sociology of Culture", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 247": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, two hours; discussion, one hour. Designed for graduate students. Sociological theories of emotional expression; experiential approaches to emotions: motivational, cognitive, psychophysiological, and behavioral; repression, social oppression, and emotions; creativity and expressed affect; thought, sensations, and emotions; specific emotions; cultural differences in emotional expression; measurement of emotions. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sociology of Emotions", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 248": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Designed for graduate students. Seminar on selected topics on culture and society. Consult \"Schedule of Classes\" for topics and instructors. May be repeated for credit. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Selected Topics in Culture and Society", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 250": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Exploration of literature of human health as product of society. Macro focus and micro focus used to examine relevance of macro organizational features of national society (culture, economy, politics) while maintaining awareness of micro pathways that link these wider influences to personal experience (mind, body, emotion). Main focus on modern industrial societies and organized around many leading issues in sociology of health. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sociology of Health", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 251": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. In-depth exploration of current theoretical debates and empirical research on social movements, collective action, and contentious politics, examining case studies, comparative analyses, and large-N investigations, with focus on developing student expertise in understanding social movement research and conceptualizing research projects. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Social Movements", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 253": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Human reproduction and its regulation have long been focus of contentious politics around world and remain topical today. Reproduction refers both to biological and social reproduction; their interdependence shapes policies and practices pertaining to them. Government efforts to influence fertility behavior call attention to one important feature of modern states: political intervention into private life, intimacy, and sexuality. Politics of reproduction refers to intersection between politics and life cycle, or between public sphere and private lives. Expansion of state into bodies and lives of citizens has blurred lines between public and private interests. Exploration of diverse aspects of politics of reproduction, their gendering, and their impact on changing family forms to encourage students to think comparatively and historically about these issues in different contexts and cultures. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Politics of Reproduction, Gender, and Family", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 254": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours. Designed for graduate students. Intellectual history of these concepts, points of difference and similarity among these concepts, current exemplars of research that utilize these concepts, and critical reflection on research traditions. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Human Capital, Social Capital, and Cultural Capital", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 256": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, four hours. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Demography", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 257": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Discussion, three hours. Requisite: course 210A. Extensive and intensive critical examination of major approaches to analysis of marriage formation and dissolution, with focus primarily on demographic literature. S/U or letter grading.", 
        "prerequisiteDescription": "course 210A", 
        "prerequisites": [
            [
                "SOCIOL 210A"
            ]
        ], 
        "title": "Demography of Marriage Formation and Dissolution", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 260": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Discussion, two hours. Designed for graduate students. Review and critique of major analytical traditions in economy and society. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Economy and Society", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 265": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, four hours. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Problems in Organization Theory", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 266": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours. Requisites: courses 244A, 244B. Variable topics/formats course. Consult instructor for topics and formats to be offered in specific term. May be repeated for credit with topic change. S/U or letter grading.", 
        "prerequisiteDescription": "courses 244A, 244B", 
        "prerequisites": [], 
        "title": "Selected Problems in Analysis of Conversation", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 268": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Discussion, three hours. Recommended preparation: at least one year of methods courses. Selected problems in interpretation of sociology and psychoanalysis, which may be substantive (group development, socialization, culture, deviance, collective behavior) or methodological; latter focuses on clinical fieldwork and experimental use of psychoanalytic and sociological techniques. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Selected Problems in Psychoanalytic Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 272": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, four hours. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Topics in Political Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 278": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, one hour; discussion, two hours. Designed for graduate students. Selected topics in sociological study of Latin America. Possible topics include social movements, race and ethnicity, stratification, and social development. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sociology of Latin America", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 281": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours. Exploration of some mathematical models of sociological processes. Possible topics include models of small groups, social mobility, kinship relations, organizations, social interaction. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Selected Problems in Mathematical Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 282": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Review of major concepts and issues in sociology of medicine. Topics include medicine, culture, and capitalism, professions and power, challenge of managed care, sick role and social control, interactionism and negotiation of sickness, sickness and self, debates over medicalization and demedicalization. Designed as preparation for field examination in sociology of health and medicine and specifically for themes traditionally included under medical sociology/sociology of medicine. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sociology of Medicine", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 283": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Review and development of empirical knowledge about doctor-patient relationship. Analysis of nature and dynamics of routine office visits, with focus on nature and role of norms in regulating doctor-patient conduct, role of expertise and power in doctor-patient relationship, and methodological questions concerning how doctor-patient relationship can be analyzed. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Communication in Medical Care", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 284": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, two to three hours. Requisite: course M148. Designed for graduate students. S/U or letter grading.", 
        "prerequisiteDescription": "course M148", 
        "prerequisites": [
            [
                "SOCIOL M148"
            ]
        ], 
        "title": "Topics in Mental Health and Illness", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 285A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Designed for graduate students. Seminars on selected current topics of sociological interest. Consult \"Schedule of Classes\" for topics and instructors. May be repeated for credit. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Topics in Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 285B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Designed for graduate students. Seminars on selected current topics of sociological interest. Consult \"Schedule of Classes\" for topics and instructors. May be repeated for credit. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Topics in Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 285C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Designed for graduate students. Seminars on selected current topics of sociological interest. Consult \"Schedule of Classes\" for topics and instructors. May be repeated for credit. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Topics in Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 285D": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Designed for graduate students. Seminars on selected current topics of sociological interest. Consult \"Schedule of Classes\" for topics and instructors. May be repeated for credit. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Topics in Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 285E": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Designed for graduate students. Seminars on selected current topics of sociological interest. Consult \"Schedule of Classes\" for topics and instructors. May be repeated for credit. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Topics in Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 285F": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Designed for graduate students. Seminars on selected current topics of sociological interest. Consult \"Schedule of Classes\" for topics and instructors. May be repeated for credit. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Topics in Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 285G": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Designed for graduate students. Seminars on selected current topics of sociological interest. Consult \"Schedule of Classes\" for topics and instructors. May be repeated for credit. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Topics in Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 285H": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Designed for graduate students. Seminars on selected current topics of sociological interest. Consult \"Schedule of Classes\" for topics and instructors. May be repeated for credit. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Topics in Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 285I": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Designed for graduate students. Seminars on selected current topics of sociological interest. Consult \"Schedule of Classes\" for topics and instructors. May be repeated for credit. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Topics in Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 285J": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Designed for graduate students. Seminars on selected current topics of sociological interest. Consult \"Schedule of Classes\" for topics and instructors. May be repeated for credit. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Topics in Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 285K": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Designed for graduate students. Seminars on selected current topics of sociological interest. Consult \"Schedule of Classes\" for topics and instructors. May be repeated for credit. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Topics in Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 285L": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Designed for graduate students. Seminars on selected current topics of sociological interest. Consult \"Schedule of Classes\" for topics and instructors. May be repeated for credit. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Topics in Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 285M": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Designed for graduate students. Seminars on selected current topics of sociological interest. Consult \"Schedule of Classes\" for topics and instructors. May be repeated for credit. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Topics in Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 285N": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Designed for graduate students. Seminars on selected current topics of sociological interest. Consult \"Schedule of Classes\" for topics and instructors. May be repeated for credit. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Special Topics in Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 287": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Preparation: at least two upper division courses on China in any social sciences discipline. Introduction to current research questions in Chinese sociology, as well as major themes in study of Chinese society, both historical and contemporary, including demographic, economic, political, and social change before and after 1949. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Topics in Chinese Society", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 289A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Laboratory, two hours. Requisites: courses 244A, 244B. Practice in analysis of conversational data. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": "courses 244A, 244B", 
        "prerequisites": [], 
        "title": "Practicum in Conversation Analysis: Data Analysis", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 289B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Requisites: courses 244A, 244B. Opportunity to advance research projects in progress and to develop skills of constructive criticism in discussing work of others. S/U grading.", 
        "prerequisiteDescription": "courses 244A, 244B", 
        "prerequisites": [], 
        "title": "Practicum in Conversation Analysis: Developing Work in Progress", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 295": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Discussion, two hours. Variable topics, including sociology of gender; ethnography; social networks; race, ethnicity, immigration; and social demography and stratification. Advanced study and analysis of current topics in specialized areas of sociology. Discussion of current research and literature in research specialty of faculty member teaching course. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Working Group in Sociology", 
        "unit": "1 to 4", 
        "unitType": "RANGE"
    }, 
    "SOCIOL 298": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, two hours every other week. Interdisciplinary workshop for graduate students and faculty pursuing theory and research in topics related to interplay of culture and society, whether social, literary, or philosophical in nature. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Workshop in Culture and Society", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 375": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, to be arranged. Preparation: apprentice personnel employment as teaching assistant, associate, or fellow. Teaching apprenticeship under active guidance and supervision of regular faculty member responsible for curriculum and instruction at UCLA. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Teaching Apprentice Practicum", 
        "unit": "1 to 4", 
        "unitType": "RANGE"
    }, 
    "SOCIOL 40": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, four hours; discussion, one hour. Examination of long-standing history of American racism, beginning with institution of slavery, Jim Crow legislation, separate but equal doctrine, Brown versus Board of Education, Civil Rights legislation of 1960s, and Obama presidency. Focus on persistence over time of racist beliefs and mechanisms through which racism becomes passed on from one generation to next. Racism toward African Americans and harms it has inflicted on African American community, as well as on nation as whole. Examination of psychology and sociology of racism through video clips, social scientific texts, essays by prominent American humanists, and American literature that deals centrally with racism. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "American Racism: Psychosocial Analysis", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 495": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, two hours. Preparation: appointment as teaching assistant in Sociology Department. Special course for teaching assistants designed to deal with problems and techniques of teaching introductory sociology. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Supervised Teaching of Sociology", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 501": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Tutorial, to be arranged. Preparation: consent of UCLA graduate adviser and graduate dean, and host campus instructor, department chair, and graduate dean. Used to record enrollment of UCLA students in courses taken under cooperative arrangements with USC. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Cooperative Program", 
        "unit": "2 to 8", 
        "unitType": "RANGE"
    }, 
    "SOCIOL 51": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, three hours; discussion, one hour. Introduction to fundamental theories, themes, and research methods used in sociological research through comparative study of international migration. Examination of theoretical debates and empirical analysis of causes and consequences of transnational migration in countries of origin and destination, with focus on issues of race, ethnicity, social networks, development, citizenship, and state in comparative context. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sociology of Migration", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 595": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Tutorial, to be arranged. Directed research for and writing of M.A. degree paper under guidance of student's M.A. committee chair. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Directed Research for Master's Paper", 
        "unit": "4 to 12", 
        "unitType": "RANGE"
    }, 
    "SOCIOL 596": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Tutorial, to be arranged. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Directed Individual Study and Research in Sociology", 
        "unit": "2 to 12", 
        "unitType": "RANGE"
    }, 
    "SOCIOL 597": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Tutorial, to be arranged. Preparation for qualifying examinations. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Individual Study for Examinations", 
        "unit": "4 to 12", 
        "unitType": "RANGE"
    }, 
    "SOCIOL 599": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Tutorial, to be arranged. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Research in Sociology for Ph.D", 
        "unit": "4 to 12", 
        "unitType": "RANGE"
    }, 
    "SOCIOL 88S": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, one hour. Examination of how religion in modern-day America conveys homophobic and transphobic discourse, with special attention to Christianity. Why does this occur? How do people who exist as both lesbian, gay, bisexual, transgender, and queer (LGBTQ) and Christian navigate this cultural chasm? Study of past century of queer rights and liberation of LGBTQ Christians. Survey of various forms of modern American queer Christianity. Students gain ability to critique LGBTQ rights movement as scholars of morality, to trace genealogies of scriptural interpretation as historians of religion, and to analyze internal worlds of religious sexual minorities as sociologists. P/NP grading. Facilitated by Tucker Moses-Hanson, with Jeffrey J. Guhin as faculty mentor.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Queer Christianity in America", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 89": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 89HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Contracts", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 97": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Requisite: course 1. Designed for freshman/sophomores. Study of selected topics in sociology at introductory level. May be repeated for credit. Letter grading.", 
        "prerequisiteDescription": "course 1", 
        "prerequisites": [
            [
                "SOCIOL 1"
            ]
        ], 
        "title": "Variable Topics Research Seminars: Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 98T": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Requisite: satisfaction of Entry-Level Writing requirement. Freshmen/sophomores preferred. Identification of gatekeepers and brokers in our lives to understand how they are affecting our daily behavior. Investigation of role of brokers in variety of social contexts, including education, news, Hollywood, and online. Letter grading.", 
        "prerequisiteDescription": "satisfaction of Entry-Level Writing requirement", 
        "prerequisites": [], 
        "title": "Masters of Our Universe: Gatekeepers and Brokers in Our Everday Lives", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL 99": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Student Research Program", 
        "unit": "1 to 2", 
        "unitType": "RANGE"
    }, 
    "SOCIOL C191N": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. Limited to juniors/seniors. History and present condition of cities and suburbs in America, with stress on global cities such as New York and Los Angeles, and comparisons to London and Shanghai. Process of suburbanization as it began in early 19th century and still continues. Analysis of city politics, house and architectural styles, crime, urban terror, public housing and ghettos, segregation and integration of neighborhoods, question of gentrification, immigration, urban culture (especially art, museums, and movie and music industries), and environmentalism. Concurrently scheduled with course C297. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Undergraduate Seminar: Urban and Suburban Sociology", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL C258": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Lecture, four hours; discussion, one hour. Practices of communication and social interaction in number of major institutional sites in contemporary society. Setting varies but may include emergency services, police and courts, medicine, news interviews, and political oratory. Concurrently scheduled with course CM125. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Talk and Social Institutions", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL C297": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "Seminar, three hours. History and present condition of cities and suburbs in America, with stress on global cities such as New York and Los Angeles, and comparisons to London and Shanghai. Process of suburbanization as it began in early 19th century and still continues. Analysis of city politics, house and architectural styles, crime, urban terror, public housing and ghettos, segregation and integration of neighborhoods, question of gentrification, immigration, urban culture (especially art, museums, and movie and music industries), and environmentalism. Concurrently scheduled with course C191N. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Urban and Suburban Sociology", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL CM125": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Communication M125.) Lecture, four hours; discussion, one hour. Designed for juniors/seniors. Practices of communication and social interaction in number of major institutional sites in contemporary society. Setting varies but may include emergency services, police and courts, medicine, news interviews, and political oratory. Concurrently scheduled with course C258. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Talk and Social Institutions", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M115": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Environment M133 and Society and Genetics M133.) Lecture, three hours; discussion, one hour. Relationship between society and environment. Analysis in detail of interrelations between social factors (such as class, race, gender, and religion) and environmental factors (such as pollution, waste disposal, sustainability, and global warming). P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Environmental Sociology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M118": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Honors Collegium M148.) Seminar, three hours; computer laboratory, one hour. Examination of social behavior through computer simulations of behavior in artificial communities. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Simulating Society: Exploring Artificial Communities", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M120": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Disability Studies M149.) Lecture, four hours. Examination of disability-related issues impacting people of all ages across wide spectrum of settings in both public and private sectors -- from preschool to higher education, from military to workplace, and from intensely urban environments to online and virtual worlds. Topics range from persistent and recurring disputes to novel controversies fueled by new technologies and changing times. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Disability Rights Law", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M124A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Communication M144A.) Lecture, three hours; discussion, one hour. Introduction to some structures that are employed in organization of conversational interaction, such as turn-taking organization, organization of repair, and some basic sequence structures with limited expansions. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Conversational Structures I", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M124B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Communication M144B.) Lecture, three hours; discussion, one hour. Requisite: course M124A. Consideration of some more expanded sequence structures, story structures, topical sequences, and overall structural organization of single conversations. P/NP or letter grading.", 
        "prerequisiteDescription": "course M124A", 
        "prerequisites": [
            [
                "SOCIOL M124A"
            ]
        ], 
        "title": "Conversational Structures II", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M138": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Psychology M163.) Lecture, three hours; discussion, one hour. Sociological analysis of incidence of violent death. Suicide is eighth leading cause of death in U.S. and third leading cause for young people aged 15 to 24. Both kinds of violent deaths are often dismissed as extreme psychopathology, reflecting individual mental health issues. Sociologists argue that suicide and homicide are social facts. Suicide and homicide do not occur randomly in society but are stratified according to social factors such as age, gender, race, sexual orientation, and class. Analysis of strength of this sociological argument and evaluation of explanatory potential of different theories to make sense of violent death, paying particular attention to forensic and medicolegal system to determine suicide and solve homicides. Review of historic and contemporary studies to examine how research and conceptualizations of suicide and homicide have changed, as well as social responses to these phenomena. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Death, Suicide, and Trauma", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M142": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Public Health M151.) Lecture, three hours; discussion, one hour. Analysis of social, cultural, economic, and political processes affecting organization and accessibility of healthcare in transitional and disadvantaged communities. Fieldwork required. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Healthcare in Transitional Communities", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M144": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Society and Genetics M144.) Lecture, three hours; discussion, one hour. Integrative view of health disparities, one of most pressing problems of society, through investigation of effects of socioeconomic status (SES) on health and disease, using specific lens of stress biology. Topics include introduction to fundamentals of physiology of stress, integration of literature on poverty and SES with studies on physiological consequences of poverty, and introduction of concepts of life course by following stress biology through childhood development and into adulthood. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Stress and Society: Biology and Inequality", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M148": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Disability Studies M148.) Lecture, three hours; discussion, one hour. Analysis of major sociological and social psychological models of madness. Study of social processes involved in production, recognition, labeling, and treatment of mental illness. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sociology of Mental Illness", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M150": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Gerontology M150.) Lecture, three hours; discussion, one hour. Study of sociological processes shaping definition, experience, and response to aging in contemporary society. Topics include race, class, and gender in aging over life course; interpersonal relations and social worlds of aged; caregiving relations and institutions; professions concerned with aged and aging. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sociology of Aging", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M153": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Asian American Studies M130C.) Lecture, three hours; discussion, one hour. Survey of sociological studies of Chinese immigration, with focus on international context, organization, and institutions of Chinese America and its interactions with social environment. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Chinese Immigration", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M155": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Chicana and Chicano Studies M155A.) Lecture, three hours; discussion, one hour. Designed for juniors/seniors. Exploration of history and social conditions of Latinos in Los Angeles as well as nationally, with particular emphasis on their location in larger social structure and on comparisons with other minority groups. Topics include migration, family, education, and work issues. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Latinos in U.S.", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M161": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as American Indian Studies M161.) Lecture, three hours. Requisite: course 1 or American Indian Studies M10. Comparative and historical study of political, economic, and cultural change in indigenous North American societies. Several theories of social change, applied to selected case studies. Letter grading.", 
        "prerequisiteDescription": "course 1 or AM IND M10", 
        "prerequisites": [], 
        "title": "Comparative American Indian Societies", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M162": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Gender Studies M162.) Lecture, three hours; discussion, one hour. Enforced requisite: course 1 or Gender Studies 10. Examination of processes by which gender is socially constructed. Topics include distinction between biological sex and sociological gender, causes and consequences of gender inequality, and recent changes in gender relations in modern industrial societies. P/NP or letter grading.", 
        "prerequisiteDescription": "course 1 or Gender Studies 10", 
        "prerequisites": [], 
        "title": "Sociology of Gender", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M163": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Gender Studies M163.) Lecture, three hours. Requisite: course 1 or Gender Studies 10. Exploration of relationship of gender to work, concentrating on the U.S. experience but also including some comparative material. Particular emphasis on analysis of causes and consequences of job segregation by gender and of wage inequality. P/NP or letter grading.", 
        "prerequisiteDescription": "course 1 or Gender Studies 10", 
        "prerequisites": [], 
        "title": "Gender and Work", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M164": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Gender Studies M164.) Lecture, three hours; discussion, one hour. Title refers to intersection between politics and life cycle. Topics include social construction of gender and population, reproductive issues, politicization of mothers, motherhood, and mothering, surrogacy, and new reproductive technologies. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Politics of Reproduction", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M165": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as African American Studies M165 and Labor and Workplace Studies M165.) Lecture, three hours; discussion, one hour. Limited to juniors/seniors. Exploration of relationship between race/ethnicity, employment, and U.S. labor movement. Analysis of underlying racial divisions in workforce and how they evolved historically. Consideration of circumstances under which workers and unions have excluded people of color from jobs and unions, as well as circumstances under which workers and unions have organized people of color into unions in efforts to improve their wages and working conditions. Impact of globalization on these dynamics. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sociology of Race and Labor", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M174": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Gender Studies M174.) Lecture, three hours; discussion, one hour. Theory and research dealing with modern family, its structure, and functions, including historical changes, variant family patterns, family as institution, and influence of contemporary society on family. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sociology of Family", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M175": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Education M108.) Lecture, four hours; discussion, one hour. Study of how U.S. educational system both promotes socioeconomic opportunities and maintains socioeconomic inequalities: historical and theoretical perspectives on role of education in U.S. society; trends in educational attainment; ways in which family background, class, race, and gender affect educational achievement and attainment; stratification between and within schools; effects of education on socioeconomic attainment, family, health, attitudes, and social participation; educational policies to improve school quality and address socioeconomic inequalities. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sociology of Education", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M176": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Communication M147.) Lecture, four hours; discussion, one hour (when scheduled). Studies in relationship between mass communication and social organization. Topics include history and organization of major media institutions, social forces that shape production of mass media news and entertainment, selected studies in media content, and effects of media on society. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sociology of Mass Communication", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M178": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as African American Studies M178.) Lecture, three hours; discussion, one hour. Limited to juniors/seniors. Historical sociology of Caribbean, with emphasis on colonialism and decolonization, development and underdevelopment, race-making institutions and evolution of race relations, nationalism and migration. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sociology of Caribbean", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M191DC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Communication M191DC, History M191DC, and Political Science M191DC.) Seminar, three hours; laboratory, 24 hours. Limited to CAPPP Program students. Seminars for undergraduate students in Center for American Politics and Public Policy's program in Washington, DC. Focus on development and execution of original empirical research based on experiences from Washington, DC-based field placements. Study of variety of qualitative methods (observation, interviewing, etc.), with comparison to quantitative analysis. Examination of features of solid and significant research; intensive writing. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "CAPPP Washington, DC, Research Seminars", 
        "unit": 8, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M194DC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as History M194DC and Political Science M194DC.) Seminar, three hours. Limited to CAPPP Quarter in Washington students and other students enrolled in UC Washington Center programs. Seminars for undergraduate students in Center for American Politics and Public Policy's program in Washington, DC. Focus on development and execution of original empirical research based on experiences from Washington, DC-based field placements. Study of variety of qualitative methods (observation, interviewing, etc.), with comparison to quantitative analysis. Examination of features of solid and significant research; intensive writing. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "CAPPP Washington, DC, Research Seminars", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M195DC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as History M195DC and Political Science M195DC.) Tutorial, four hours. Limited to junior/senior CAPPP Program students. Internships in Washington, DC, through Center for American Politics and Public Policy. Students meet on regular basis with instructor and provide periodic reports of their experience. Individual contract with supervising faculty member required. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "CAPPP Washington, DC, Internships", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M206": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Community Health Sciences M222.) Lecture, three hours. Preparation: one formal or social demography course. Requisite: Biostatistics 100A. Application of demographic theories and methods to describe fertility trends and differentials and social and proximate determinants of fertility, with emphasis on understanding key proximate determinants. For advanced students interested in population, demography of health, and social demography. Letter grading.", 
        "prerequisiteDescription": "BIOSTAT 100A", 
        "prerequisites": [], 
        "title": "Understanding Fertility: Theories and Methods", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M213A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Biostatistics M208, Community Health Sciences M208, and Economics M208.) Lecture, four hours. Preparation: one introductory statistics course. Introduction to methods of demographic analysis. Topics include demographic rates, standardization, decomposition of differences, life tables, survival analysis, cohort analysis, birth interval analysis, models of population growth, stable populations, population projection, and demographic data sources. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Demographic Methods", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M225A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Economics M204A.) Seminar, three hours. Examination of issues such as demography, health, aging, labor, and broad array of topics concerned with effects of economic, social, and political transformations on human behavior both in U.S. and abroad. May be taken independently for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "California Population Research Topical Seminar Series", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M231": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as African American Studies M200G.) Seminar, four hours. Race, class, gender, and sexual identity are axes of stratification, identity, and experience. They are not merely identities but structural locations that are often taken for granted and rarely confronted, challenged, or contested. Many times one or more of these go unrecognized. Exploration of multiple and intersecting ways these concepts shape society, individual life chances, and daily social interactions for African Americans. Examination of race, class, and gender inequalities as individual aspects of social life. How race, class, gender, and sexual identity shape societies and individual experiences in interaction with each other. How these inequalities shape and are shaped by social institutions, including cultural institutions, economy, and family, within context of experiences of black women and black men in contemporary U.S. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Race, Class, and Gender: Constructing Black Womanhood and Black Manhood in America", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M236B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Geography M224.) Lecture, three hours. Further exploration of key current theoretical debates in study of international migration, with emphasis on exploring both theoretical debates of field and empirical data and case studies on which those debates hinge, to encourage students to undertake research in field. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "International Migration", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M238": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Gender Studies M238.) Seminar, three hours. Designed for graduate students. Analysis of current American feminist theory relevant to sociologists. Exploration of critiques of second wave feminism by working class feminists and/or feminists of color, feminist scholars from other countries, and recent \"antifeminist\" feminists. Discussion of directions for future feminist sociology. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Feminist Theory", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M252": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Gender Studies M252.) Lecture, two hours; discussion, two hours. Designed for graduate students. Seminar on selected topics in sociology of gender. May be repeated for credit. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Selected Topics in Sociology of Gender", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M255": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Gender Studies M255.) Seminar, three hours. How does gender manifest itself in lives of different groups of women in U.S. and abroad? Are universal analytical categories or united feminist movements possible or is gender too different cross-culturally? S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Cross-Cultural Perspectives on Gender", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M262": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as African American Studies M200C.) Seminar, three hours. Evaluation of social, cultural, and historical forces that affect socialization, stability, and interaction in black intimate relationships, beginning with theoretical framework from black feminism to analysis of economic and other expectations for partners in cohabiting and other types of unions. Examination of family life for both middle-class and low-income populations. Exploration of notions of black sexuality, including images of hyper-masculinity and femininity within black body and critical interrogation of notions of blackness and authenticity in racial identification. Contribution to greater understanding of black intimate relationships in different contexts, including lesbian and gay identities, Caribbean and other ethnic identities, and interracial intimacies. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Black Families and Relationships", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M263": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Community Health Sciences M263.) Lecture, three hours. Designed for graduate students. Use of city of Los Angeles to examine major social and demographic factors that characterize cities in the U.S. Examination of role of these factors in affecting health outcomes. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Social Demography of Los Angeles", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M275": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as American Indian Studies M200C and Anthropology M244P.) Seminar, three hours. Introduction to most important issues facing American Indians as individuals, communities, tribes, and organizations in contemporary world, building on historical background presented in American Indian Studies M200A and cultural and expressive experience of American Indians presented in American Indian Studies M200B. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Contemporary Issues of American Indians", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M280": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Law M577.) Seminar, four hours. Review and critical assessment of diverse literature on international traffic of persons, with emphasis on significance of sociological, legal, and gender aspects of trafficking. Primary focus on trafficking for sex work and blurred lines between discourse on commercial sex trade and trafficking. Additional issues include role of political and economic transition, militarization, health implications of trafficking, trafficking for nonsexual labor, and role of advocacy. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Trafficking, Gender, Health, and Human Rights", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M290A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Education M289A, Political Science M287A, and Public Policy M289A.) Seminar, four hours. Examination of metropolitan American society and institutions at beginning of 21st century. Consideration of best available information on patterns of settlement, changing functions of urban space and institutions, and issues of opportunity linked to urban structure in society facing unprecedented demographic change that will end primarily European domination of our society by mid-century, creating democracy with no racial or ethnic majority. How this demographic transition and postindustrial transformation of urban functions and space interact to shape opportunity and inequality. Vast economic transformations, brought about by globalization of workplace and dramatic decline of industrial employment in advanced nations, not only greatly raise stakes on creating equal opportunity but also cut off what were previously extremely important parts of intergenerational mobility. In Progress grading (credit to be given only on completion of course M290B).", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Immigration, Racial Change, and Education in 21st-Century Metropolis", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M290B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Education M289B, Political Science M287B, and Public Policy M289B.) Seminar, four hours. Examination of metropolitan American society and institutions at beginning of 21st century. Consideration of best available information on patterns of settlement, changing functions of urban space and institutions, and issues of opportunity linked to urban structure in society facing unprecedented demographic change that will end primarily European domination of our society by mid-century, creating democracy with no racial or ethnic majority. How this demographic transition and postindustrial transformation of urban functions and space interact to shape opportunity and inequality. Vast economic transformations, brought about by globalization of workplace and dramatic decline of industrial employment in advanced nations, not only greatly raise stakes on creating equal opportunity but also cut off what were previously extremely important parts of intergenerational mobility. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Immigration, Racial Change, and Education in 21st-Century Metropolis", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M402": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Health Policy M422.) Lecture, four hours. Requisites: Health Policy 200A, 200B. Introduction to evaluation of health services programs and policies. Exposure to basic theoretical concepts and specific evaluation methodologies and designs. Letter grading.", 
        "prerequisiteDescription": "Health Policy 200A, 200B", 
        "prerequisites": [], 
        "title": "Practices of Evaluation in Health Services: Theory and Methodology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M5": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as African American Studies M5.) Lecture, four hours; discussion, one hour; field trips. Analysis and interpretation of social organization of black communities, with focus on origins and development of black communities, competing theories and research findings, defining characteristics and contemporary issues. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Social Organization of Black Communities", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M72A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Communication M72A, Clusters M72A, and Society and Genetics M72A.) Lecture, three hours; discussion, two hours. Course M72A is enforced requisite to M72B, which is enforced requisite to M72CW. Limited to first-year freshmen. Examination of many ways in which sex and sexual identity shape and are shaped by biological and social forces, approached from complementary perspectives of anthropology, biology, medicine, and sociology. Specific topics include biological origins of sex differences, intersex, gender identity, gender inequality, homosexuality, sex differences, sex/gender and law, and politics of sex research. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Sex from Biology to Gendered Society", 
        "unit": 6, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M72B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Communication M72B, Clusters M72B, and Society and Genetics M72B.) Lecture, three hours; discussion, two hours. Enforced requisite: course M72A. Limited to first-year freshmen. Examination of many ways in which sex and sexual identity shape and are shaped by biological and social forces, approached from complementary perspectives of anthropology, biology, medicine, and sociology. Specific topics include biological origins of sex differences, intersex, gender identity, gender inequality, homosexuality, sex differences, sex/gender and law, and politics of sex research. Letter grading.", 
        "prerequisiteDescription": "course M72A", 
        "prerequisites": [
            [
                "SOCIOL M72A"
            ]
        ], 
        "title": "Sex from Biology to Gendered Society", 
        "unit": 6, 
        "unitType": "ABSOLUTE"
    }, 
    "SOCIOL M72CW": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOCIOL", 
        "departmentFullName": "Sociology", 
        "description": "(Same as Communication M72CW, Clusters M72CW, and Society and Genetics M72CW.) Seminar, three hours. Enforced requisite: course M72B. Limited to first-year freshmen. Topics may include politics of reproduction, sexuality, sexual identity, social construction of gender, and reproductive technologies. Satisfies Writing II requirement. Letter grading.", 
        "prerequisiteDescription": "course M72B", 
        "prerequisites": [
            [
                "SOCIOL M72B"
            ]
        ], 
        "title": "Sex from Biology to Gendered Society: Special Topics", 
        "unit": 6, 
        "unitType": "ABSOLUTE"
    }
}