{
    "SOC SC 188": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC SC", 
        "departmentFullName": "Social Science", 
        "description": "Lecture, one hour (six weeks). Exploration of how to apply disciplinary knowledge to industry problems and technology trends. Students build skills to enable them to create novel ways of meeting challenges, build network intelligence, and communication their ideas and expertise. Students also learn problem-solving techniques like lean startup approach. Uses case study approach to show how social scientists have connected with recent technology trends to produce impactful innovation. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Academic Innovation in Industry", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC SC 19": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC SC", 
        "departmentFullName": "Social Science", 
        "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Fiat Lux Freshman Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC SC 375": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC SC", 
        "departmentFullName": "Social Science", 
        "description": "Seminar, to be arranged. Preparation: apprentice personnel employment as teaching assistant, associate, or fellow. Teaching apprenticeship under active guidance and supervision of regular faculty member responsible for curriculum and instruction at UCLA. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Teaching Apprentice Practicum", 
        "unit": "1 to 4", 
        "unitType": "RANGE"
    }, 
    "SOC SC 400A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC SC", 
        "departmentFullName": "Social Science", 
        "description": "Seminar, three hours. Exploration of contribution of social science research to addressing complex social problems. Students engage wide array of disciplinary perspectives, research methods, and analytical approaches. Emphasis placed on development of multidisciplinary, integrative approaches to social science research. Students learn how to identify and frame social problem; how to identify, interpret, and evaluate relevant research; and how to synthesize research findings generated from different theoretical, methodological, and disciplinary approaches. Development of essential research, writing, and analytic skills. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Social Science Research and Perspectives", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC SC 400B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC SC", 
        "departmentFullName": "Social Science", 
        "description": "Seminar, three hours. Exploration of contribution of social science research to addressing complex social problems. Students engage wide array of disciplinary perspectives, research methods, and analytical approaches. Emphasis placed on development of multidisciplinary, integrative approaches to social science research. Students learn how to identify and frame social problem; how to identify, interpret, and evaluate relevant research; and how to synthesize research findings generated from different theoretical, methodological, and disciplinary approaches. Development of essential research, writing, and analytic skills. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Social Science Research and Perspectives", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC SC 401": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC SC", 
        "departmentFullName": "Social Science", 
        "description": "Seminar, three hours. Introduction to range of qualitative approaches used in social science research and analysis through combination of theoretical discussions and practical experience. Examination of practical and epistemological issues in qualitative research in workshop format. Covers practical workings of qualitative research: gathering data through interviews, focus groups, observation, questionnaires, and archival research; strategies for recording, coding, and analyzing qualitative data; and evaluating and presenting qualitative research. Prepares students to undertake research using qualitative methods through collaborative class research project. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Qualitative Social Science Research Methods", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC SC 402": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC SC", 
        "departmentFullName": "Social Science", 
        "description": "Lecture, two and one half hours; discussion, one hour. Introduction to fundamentals of data analysis and statistics, focusing on application of statistical methods in social problems research. Students develop skills and strategies for evaluating research evidence, and for comparing and synthesizing results of studies that adopt different research methodologies. Descriptive statistics, inferential statistics, probability, statistical tests, correlation, and causation, and regression analysis. Other topics include organizing quantitative data (e.g., tables, graphs), methods for describing data with respect to central tendency, dispersion, and association. At course end students should be able to perform data analysis using appropriate software, to interpret results, and to make critical evaluations of quantitative social science research. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Quantitative Data Analysis in Social Science", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC SC 403": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC SC", 
        "departmentFullName": "Social Science", 
        "description": "Seminar, three hours. Advanced training in data analysis and statistics, and training in strategies for evaluating research evidence and comparing results of studies that adopt varying research methodologies. Students gain experience working with large datasets, and with designing, testing, and validating statistical modeling techniques. Students are familiarized with datasets most relevant to their individual research interests. Students receive general training and individualized mentoring in selecting appropriate dataset for their major research paper (MRP). Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Quantitative Evidence and Analysis in Social Sciences", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC SC 410": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC SC", 
        "departmentFullName": "Social Science", 
        "description": "Seminar, three hours. Exploration of theory and practice of engaged social science, tracing its historical development from policy studies and related fields to more activist modalities of critique and intervention. Drawing on classic and contemporary studies in sociology, anthropology, political science, environmental studies, and social justice, to engage students in larger debates about politics of knowledge in relation to issues, such as poverty, racism, public health, refugees, gang culture, gender hierarchies, public education, and citizenship. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Engaged Social Science", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC SC 420": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC SC", 
        "departmentFullName": "Social Science", 
        "description": "Seminar, three hours. Guided completion of major research paper (MRP). Students receive detailed feedback from instructor, revise literature review, finalize analysis, tighten rhetoric, and improve organization of manuscript to transform it into final research paper. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Research Design and Analysis", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "SOC SC 99": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "SOC SC", 
        "departmentFullName": "Social Science", 
        "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Student Research Program", 
        "unit": "1 to 2", 
        "unitType": "RANGE"
    }
}