{
    "STATS 10": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour; computer laboratory, two hours. Preparation: three years of high school mathematics. Not open for credit to students with credit for course 11, 12, 13, 14, or former course 10H. Introduction to statistical thinking and understanding, including strengths and limitations of basic experimental designs, graphical and numerical summaries of data, inference, regression as descriptive tool. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Statistical Reasoning", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 100A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Requisites: Mathematics 32B, 33A. Not open to students with credit for Electrical Engineering 131A or Mathematics 170A; open to graduate students. Students may receive credit for only two of following: course 100A, former course 110A, Biostatistics 100A. Probability distributions, random variables, vectors, and expectation. P/NP or letter grading.", 
        "prerequisiteDescription": "MATH 32B, 33A", 
        "prerequisites": [], 
        "title": "Introduction to Probability", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 100B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Requisite: course 100A or Mathematics 170A. Survey sampling, estimation, testing, data summary, one- and two-sample problems. P/NP or letter grading.", 
        "prerequisiteDescription": "course 100A or MATH 170A", 
        "prerequisites": [], 
        "title": "Introduction to Mathematical Statistics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 100C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Requisite: course 100B. Theory of linear models, with emphasis on matrix approach to linear regression. Topics include model fitting, extra sums of squares principle, testing general linear hypothesis in regression, inference procedures, Gauss/Markov theorem, examination of residuals, principle component regression, stepwise procedures. P/NP or letter grading.", 
        "prerequisiteDescription": "course 100B", 
        "prerequisites": [
            [
                "STATS 100B"
            ]
        ], 
        "title": "Linear Models", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 101A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Requisites: courses 10 or 12 or 13, and 20. Recommended: course 102A. Applied regression analysis, with emphasis on general linear model (e.g., multiple regression) and generalized linear model (e.g., logistic regression). Special attention to modern extensions of regression, including regression diagnostics, graphical procedures, and bootstrapping for statistical influence. P/NP or letter grading.", 
        "prerequisiteDescription": "courses 10 or 12 or 13, and 20", 
        "prerequisites": [], 
        "title": "Introduction to Data Analysis and Regression", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 101B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 101A. Fundamentals of collecting data, including components of experiments, randomization and blocking, completely randomized design and ANOVA, multiple comparisons, power and sample size, and block designs. P/NP or letter grading.", 
        "prerequisiteDescription": "course 101A", 
        "prerequisites": [
            [
                "STATS 101A"
            ]
        ], 
        "title": "Introduction to Design and Analysis of Experiment", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 101C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 101B. Designed for juniors/seniors. Applied regression analysis, with emphasis on general linear model (e.g., multiple regression) and generalized linear model (e.g., logistic regression). Special attention to modern extensions of regression, including regression diagnostics, graphical procedures, and bootstrapping for statistical influence. P/NP or letter grading.", 
        "prerequisiteDescription": "course 101B", 
        "prerequisites": [
            [
                "STATS 101B"
            ]
        ], 
        "title": "Introduction to Statistical Models and Data Mining", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 102A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Requisites: courses 10, 20, Mathematics 33A. Introduction to computational statistics through numerical methods and computationally intensive methods for statistical problems. Topics include statistical graphics, root finding, simulation, randomization testing, and bootstrapping. Covers intermediate to advanced programming with R. P/NP or letter grading.", 
        "prerequisiteDescription": "courses 10, 20, MATH 33A", 
        "prerequisites": [], 
        "title": "Introduction to Computational Statistics with R", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 102B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Requisites: courses 20, 100B, Mathematics 33A. Introduction to computational methods and optimization useful for statisticians. Use of computer programming to solve statistical problems. Topics include vector/matrix computation, multivariate normal distribution, principal component analysis, clustering analysis, gradient-based optimization, EM algorithm for missing data, and dynamic programming. P/NP or letter grading.", 
        "prerequisiteDescription": "courses 20, 100B, MATH 33A", 
        "prerequisites": [], 
        "title": "Introduction to Computation and Optimization for Statistics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 102C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Requisite: course 100B. Introduction to Markov chain Monte Carlo (MCMC) algorithms for scientific computing. Generation of random numbers from specific distribution. Rejection and importance sampling and its role in MCMC. Markov chain theory and convergence properties. Metropolois and Gibbs sampling algorithms. Extensions as simulated tempering. Theoretical understanding of methods and their implementation in concrete computational problems. P/NP or letter grading.", 
        "prerequisiteDescription": "course 100B", 
        "prerequisites": [
            [
                "STATS 100B"
            ]
        ], 
        "title": "Introduction to Monte Carlo Methods", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 105": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Requisite: course 100A or Electrical Engineering 131A or Mathematics 170A. Foundation of basic concepts and techniques of statistics. Topics include sampling distributions, statistical estimation (including maximum likelihood estimation), statistical intervals, and hypothesis testing, with emphasis on application of these concepts. Discussion of methods for checking whether assumptions required for mathematical foundations are appropriate for given set of data. P/NP or letter grading.", 
        "prerequisiteDescription": "course 100A or EL ENGR 131A or MATH 170A", 
        "prerequisites": [], 
        "title": "Statistics for Engineers", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 112": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour; laboratory, one hour. Requisite: course 10. Limited to juniors/seniors. Statistical methods in social sciences, including regression, multivariate techniques, logistic regression, and data-handling and analysis. Applications to social sciences, using professional statistical analysis software package for data analysis. Letter grading.", 
        "prerequisiteDescription": "course 10", 
        "prerequisites": [
            [
                "STATS 10"
            ]
        ], 
        "title": "Statistics: Window to Understanding Diversity", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 12": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, four hours; discussion, one hour; laboratory, one hour. Not open for credit to students with credit for course 10, 11, or 13. Introduction to statistical thinking and understanding, with emphasis on techniques used in geography and environmental science. Underlying logic behind statistical procedures, role of variation in statistical thinking, strengths and limitations of statistical summaries, and fundamental inferential tools. Emphasis on applications in geography and environmental science in laboratory work using professional statistical analysis package, including spatial statistics. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Statistical Methods for Geography and Environmental Studies", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 13": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour; laboratory, one hour. Not open for credit to students with credit for course 10, 10H, 11, 12, or 14. Presentation and interpretation of data, descriptive statistics, introduction to correlation and regression and to basic statistical inference (estimation, testing of means and proportions, ANOVA) using both bootstrap methods and parametric models. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Statistical Methods for Life and Health Sciences", 
        "unit": 5, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 130": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Preparation: basic statistics, basic computer literacy. Study of four commonly employed solutions -- SPSS (Statistical Package for Social Sciences), Stata, SAS (Statistical Analysis System), and R -- for data analytic and statistical issues in health sciences, engineering, economics, and government. Emphasis on applied problem solving, measurement issues in data analysis, use of computer for analysis of large-scale data. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Getting Up to Speed with SPSS, Stata, SAS, and R", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 131": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Requisite: course 102A. Limited to junior/senior statistics majors and minors. Use of Python and other technologies for data analysis and data science. Focus on programming with Python and selection of its libraries--NumPy, pandas, Matplotlib, and scikit-learn--for purpose of data processing, data cleaning, data analysis, and machine learning. Other technologies covered include Jupyter notebook, Structured Query Language (SQL), and git. P/NP or letter grading.", 
        "prerequisiteDescription": "course 102A", 
        "prerequisites": [
            [
                "STATS 102A"
            ]
        ], 
        "title": "Python and Other Technologies for Data Analysis", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 140SL": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, one hour; discussion, two hours. Enforced requisites: courses 100B, 101B, 130. Limited to seniors. Opportunity to solve real data analysis problems for real community-based or campus-based clients. Students work in small groups with faculty member and client to frame client's question in statistical terms, create statistical model, analyze data, and report results. Weekly meetings in classroom setting to study basic consulting skills, share experiences, exchange ideas, and make reports. On-site visits as necessary. Courses 140SL and 141SL must be taken in consecutive terms. In Progress grading (credit to be given only on completion of course 141SL).", 
        "prerequisiteDescription": "courses 100B, 101B, 130", 
        "prerequisites": [], 
        "title": "Practice of Statistical Consulting", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 141SL": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Seminar, one hour; discussion, one hour; research group meeting, two hours. Requisite: course 140SL. Limited to seniors. Opportunity to solve real data analysis problems for real community-based or campus-based clients. Students work in small groups with faculty member and client to frame client's question in statistical terms, create statistical model, analyze data, and report results. Weekly meetings in classroom setting to study basic consulting skills, share experiences, exchange ideas, and make reports. On-site visits as necessary. Courses 140SL and 141SL must be taken in consecutive terms. Letter grading.", 
        "prerequisiteDescription": "course 140SL", 
        "prerequisites": [
            [
                "STATS 140SL"
            ]
        ], 
        "title": "Practice of Statistical Consulting", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 143": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Seminar, three hours. Requisites: courses 100B, 101B. Designed for Statistics majors/minors who are interested in research. Research topics in statistics that cover material not covered in regular statistics upper division curriculum. Reading, discussion, and presenting influential papers in statistics. P/NP or letter grading.", 
        "prerequisiteDescription": "courses 100B, 101B", 
        "prerequisites": [], 
        "title": "Introduction to Research in Statistics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 157": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Preparation: one engineering, mathematics, physics, or statistics course. Recommended requisite: Program in Computing 20A. Probability and statistics topics in data-driven and interactive manner using open Internet resources. Varieties of data, study-designs, and applications arising from biomedical, research, and simulated data to prepare students for innovative multidisciplinary research. Use of Statistics Online Computational Resource (SOCR). P/NP or letter grading.", 
        "prerequisiteDescription": "PIC 20A", 
        "prerequisites": [], 
        "title": "Probability and Statistics Data Modeling and Analysis using Statistics Online Computational Resource", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 170": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Requisite: course 100C or 101B. Exploration of standard methods in temporal and frequency analysis used in analysis of numerical time-series data. Examples provided throughout, and students implement techniques discussed. P/NP or letter grading.", 
        "prerequisiteDescription": "course 100C or 101B", 
        "prerequisites": [], 
        "title": "Introduction to Time-Series Analysis", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 175": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Statistical theories used in analyzing spatial data. Study of three types of spatial data: geostatistical data, lattice data, and point patterns, with emphasis on applications and analysis of spatial data using open-source statistical software R. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Statistics for Spatial Data", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 182": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Seminar, one hour. Development and perfection of student written communication skills through variety of scientific writing and reading assignments. Objectives and techniques of scientific writing and practice with different forms of professional writing. Analysis of quality of writing, including control, clarity, grammar, and mechanics. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Fundamentals of Scientific Writing", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 186": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Seminar, one hour. Discussion of applications of statistics by weekly guest speakers. How statistics is applied to legal questions, economic decisions, arts, environment, and other fields, with some emphasis on career paths in statistics. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Careers in Statistics", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 188SA": {
        "corequisiteDescription": "HNRS 101E", 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Individual Studies for USIE Facilitators", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 188SB": {
        "corequisiteDescription": "HNRS 101E", 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.", 
        "prerequisiteDescription": "course 188SA", 
        "prerequisites": [
            [
                "STATS 188SA"
            ]
        ], 
        "title": "Individual Studies for USIE Facilitators", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 188SC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.", 
        "prerequisiteDescription": "course 188SB", 
        "prerequisites": [
            [
                "STATS 188SB"
            ]
        ], 
        "title": "Individual Studies for USIE Facilitators", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 189": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 189HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Contracts", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 19": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Fiat Lux Freshman Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 195": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Tutorial, four hours. Limited to juniors/seniors. Internship in supervised setting in community agency or business. Students meet on regular basis with instructor and provide periodic reports of their experience. May be repeated for credit. Individual contract with supervising faculty member required. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Community or Corporate Internships in Statistics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 199": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Tutorial, one hour. Limited to juniors/seniors. Supervised individual research or investigation under guidance of faculty mentor. Culminating paper or project required. May be repeated for credit. Individual contract required. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Directed Research in Statistics", 
        "unit": "1 to 4", 
        "unitType": "RANGE"
    }, 
    "STATS 20": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 10, 12, or 13. Designed to prepare students for upper division work in statistics. Introduction to use of R, including data management, simple programming, and statistical graphics in R. P/NP or letter grading.", 
        "prerequisiteDescription": "course 10, 12, or 13", 
        "prerequisites": [], 
        "title": "Introduction to Statistical Programming with R", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 200A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Requisite: course 100A or Mathematics 170A. Limited to graduate statistics students. Simulation, renewal theory, martingale, and selected topics from queuing, reliability, speech recognition, computational biology, mathematical finance, epidemiology. S/U or letter grading.", 
        "prerequisiteDescription": "course 100A or MATH 170A", 
        "prerequisites": [], 
        "title": "Applied Probability", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 200B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Sufficiency, exponential families, least squares, maximum likelihood estimation, Bayesian estimation, Fisher information, Cramér/Rao inequality, Stein's estimate, empirical Bayes, shrinkage and penalty, confidence intervals. Likelihood ratio test, p-value, false discovery, nonparametrics, semi-parametrics, model selection, dimension reduction. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Theoretical Statistics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 200C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Survey of modern techniques in analyzing high-dimensional and nonparametic estimation problems. Emphasis on non-asymptotic bounds via concentration inequalities. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "High Dimensional Statistics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 201A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Designed for graduate students. Basic principles, ANOVA block designs, factorial designs, unequal probability sampling, regression estimation, stratified sampling, and cluster sampling. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Research Design, Sampling, and Analysis", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 201B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Requisites: courses 200A, 201A. Methods of model fitting and parameter estimation, with emphasis on regression and classification techniques, including those from machine learning. Interest in either obtaining suitable conditional expectation function or estimating meaningful parameters of underlying probabilistic model to make inferences or predictions from data. Focus on what is to be done when linear models are not appropriate and may produce misleading estimates. Coverage of classical must know model fitting and parameter estimation techniques such as maximum likelihood fitting of generalized linear models. Exploration of broader regression/classification techniques that have been ubiquitous in machine learning literature, with special attention to regularization and kernelized methods. S/U or letter grading.", 
        "prerequisiteDescription": "courses 200A, 201A", 
        "prerequisites": [], 
        "title": "Statistical Modeling and Learning", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 201C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Strongly recommended requisites: courses 200B, 201B. Designed for graduate students. Introduction to advanced topics in statistical modeling and inference, including Bayesian hierarchical models, missing data problems, mixture modeling, additive modeling, hidden Markov models, and Bayesian networks. Coverage of computational methods used and developed for these models and problems, such as EM algorithm, data augmentation, dynamic programming, and belief propagation. S/U or letter grading.", 
        "prerequisiteDescription": "courses 200B, 201B", 
        "prerequisites": [], 
        "title": "Advanced Modeling and Inference", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 202A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Topics include programming environments/languages such as UNIX, UNIX shell, Python, R, and Processing and data technologies/formats such as relational databases/SQL and XML, with emphasis on complex data types, including large collections of textual data, GPS traces, network logs, and various online sources. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Statistics Programming", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 202B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Recommended requisite: course 202A. Survey of computational methods that are especially useful for statistical analysis, with implementations in statistical package R. Topics include matrix analysis, multivariate regression, principal component analysis, multivariate analysis, and deterministic optimization methods. S/U or letter grading.", 
        "prerequisiteDescription": "course 202A", 
        "prerequisites": [
            [
                "STATS 202A"
            ]
        ], 
        "title": "Matrix Algebra and Optimization", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 202C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Requisite: course 202B. Monte Carlo methods and numerical integration. Importance and rejection sampling. Sequential importance sampling. Markov chain Monte Carlo (MCMC) sampling techniques, with emphasis on Gibbs samplers and Metropolis/Hastings. Simulated annealing. Exact sampling with coupling from past. Permutation testing and bootstrap confidence intervals. S/U or letter grading.", 
        "prerequisiteDescription": "course 202B", 
        "prerequisites": [
            [
                "STATS 202B"
            ]
        ], 
        "title": "Monte Carlo Methods for Optimization", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 203": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "(Formerly numbered 200C.) Lecture, three hours. Requisite: course 200B. Asymptotic properties of tests and estimates, consistency and efficiency, likelihood ratio tests, chi-squared tests. S/U or letter grading.", 
        "prerequisiteDescription": "course 200B", 
        "prerequisites": [
            [
                "STATS 200B"
            ]
        ], 
        "title": "Large Sample Theory, Including Resampling", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 204": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours. Requisite: course 200A. Introduction to many useful nonparametric techniques such as nonparametric density estimation, nonparametric regression, and high-dimensional statistical modeling. Some semiparametric techniques and functional data analysis. Letter grading.", 
        "prerequisiteDescription": "course 200A", 
        "prerequisites": [
            [
                "STATS 200A"
            ]
        ], 
        "title": "Nonparametric Function Estimation and Modeling", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 205": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours. Designed for students in statistics and other disciplines who want to perform data analysis using linear and nonlinear regression and multilevel models. Introduction to and demonstration of wide variety of models to instruct students in how to fit these models using freely available software packages. Topics include regression, poststratification, matching, regression discontinuity, and instrumental variables, as well as multilevel logistic regression and missing-data imputation. Practical tips regarding building, fitting, and understanding models provided. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Hierarchical Linear Models", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 206": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours. Requisites: courses 201A, 201B or equivalent. Advancements in modern survey methodology. Examination of traditional approaches and consideration of cutting-edge solutions in fields of research in survey methodology. Development of students' own research. S/U or letter grading.", 
        "prerequisiteDescription": "courses 201A, 201B or equivalent", 
        "prerequisites": [], 
        "title": "Modern Survey Methods", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 207": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours. Study of methods that exploit sparsity to help recover underlying signal in data. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Statistical Learning with Sparsity", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 208": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours. Introduction to theoretical analysis of machine learning methods, with emphasis on prediction problems. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Statistical Learning Theory", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 210": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours. Recommended requisite: course 200B. Recommended preparation: programming skills in R, C/C++, MATLAB. Overview of theory and practice of computer-based methods for statistical inference and uncertainty quantification, including bootstrap, resampling, computer simulation, and Monte Carlo sampling. Coverage of nonparametric and parametric bootstrap, bootstrap inference, permutation test, cross-validation, likelihood approximation, importance sampling, and Markov chain Monte Carlo with brief introduction to Bayesian inference and missing data problems. S/U or letter grading.", 
        "prerequisiteDescription": "course 200B", 
        "prerequisites": [
            [
                "STATS 200B"
            ]
        ], 
        "title": "Computer Intensive Methods", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 218": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours. Limited to graduate students. Introduction to analysis of social structure, conceived in terms of social relationships. Major concepts of social network theory and mathematical representation of social concepts such as role and position. Use of graphical representations of network information. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Statistical Analysis of Networks", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 221": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, four hours. Recommended: some experience in statistical computing. Exploration of methods used in analysis of numerical time-series data. Topics include temporal and frequency analysis, wavelets, and chaos. Implementation of discussed techniques using real data sets. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Time-Series Analysis", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 232C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours. Recommended requisites: courses M232A, M232B. Demonstration of how to build artificial intelligence by following principles of human intelligence revealed by cognitive science, including learning from small data, expressing causality of physical world, and inferring mental states of others for intuitive social interactions. Draws from statistical modeling, cognitive science, artificial intelligence, computer vision, and robotics. S/U or letter grading.", 
        "prerequisiteDescription": "courses M232A, M232B", 
        "prerequisites": [], 
        "title": "Cognitive Artificial Intelligence", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 238": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours. Requisite: course 100A or 200A. Formulation of vision as Bayesian inference using models developed for designing artificial vision systems. Applied to statistics, they define ideal observer models that can be used to model human performance and serve a benchmark. S/U or letter grading.", 
        "prerequisiteDescription": "course 100A or 200A", 
        "prerequisites": [], 
        "title": "Vision as Bayesian Inference", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 240": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours. Requisite: course 200B. Distributions in several dimensions, partial and multiple correlation. Normal distribution theory, Wishart distribution, Hotelling T2. Principal components, canonical correlation, discriminant analysis. Introduction to linear structural relations and factor analysis. Letter grading.", 
        "prerequisiteDescription": "course 200B", 
        "prerequisites": [
            [
                "STATS 200B"
            ]
        ], 
        "title": "Multivariate Analysis", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 246": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours. Preparation: basic knowledge of calculus, linear algebra, and computer programming. Modern methods for constructing and evaluating statistical models, including non-Bayesian and Bayesian statistical modeling approaches. Discussion of theoretical parts and data analysis. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Statistical Model Selection", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 270": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Recommended requisites: courses 208, M231. Introduction of mathematical tools for analysis of learning with neural networks and graphical models with latent variables. S/U or letter grading.", 
        "prerequisiteDescription": "courses 208, M231", 
        "prerequisites": [], 
        "title": "Mathematical Machine Learning", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 271": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Seminar, three hours. Requisite: course 100B or Mathematics 33A. Recommended: Computer Science 180. Introduction to state-of-art computational models of mammalian visual cortex, with topics in low-, mid-, and high-level vision. Discussion of relevant evidence from anatomy, electrophysiology, imaging (e.g., fMRI), and psychophysics. Concentration on mathematical modeling of these phenomena, taking into account recent progress in probabilistic models of computer vision and developments in machine learning. S/U or letter grading.", 
        "prerequisiteDescription": "course 100B or MATH 33A", 
        "prerequisites": [], 
        "title": "Probabilistic Models of Visual Cortex", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 285": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Seminar, one to three hours. Topics in various statistical areas by means of lectures and informal conferences with staff members. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Seminar: Computing for Statistics", 
        "unit": "2 to 4", 
        "unitType": "RANGE"
    }, 
    "STATS 287": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Seminar, two hours. Designed for graduate students (open to undergraduate students with consent of instructor). With high-throughput technologies such as genomic sequencing, microarray gene expressions, Chromatin-ImmunoPrecipitation DNA chip (ChIP-chip), and mass spectrometry (MS/MS) proteomics, scientists are collecting genetic, genomic, and pathway data at rates far beyond imagination one decade ago. Such gigantic volumes of data produced cannot be analyzed and understood without highly sophisticated computational methods guided by mathematical and statistical principles. Cutting-edge genomics research from statistical data analytic point of view. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Seminar: Gene Expression and Systems Biology", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 290": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Seminar, one hour. Topics in various statistical areas by means of lectures and informal conferences with staff members. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Current Literature in Statistics", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 291SL": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Research group meeting, two hours; fieldwork, two hours. Exposure to realistic statistical and scientific problems that appear in typical interactions between statisticians and researchers, with lectures centered on case studies presented by faculty members and invited speakers from business and academic fields. Applied regression analysis and design of experiments, together with basic statistical programs. Presentations and written reports required. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Service Learning for Graduate Statistical Consulting", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 292": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Seminar, two hours. Introduction to various statistical packages. How to handle data in different packages (input, output, data management, treatment of missing data), general syntax of different programming languages, and good practice for writing own statistical functions. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Graduate Student Statistical Packages Seminar", 
        "unit": "1 to 2", 
        "unitType": "RANGE"
    }, 
    "STATS 294": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Seminar, two hours. Development of oral and written presentations of statistical data. Objectives and techniques of scientific writing and practice with different forms of professional writing. Participation in oral presentations of student work. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Scientific Writing", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 296": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Seminar and discussion by staff and students. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Participating Seminar: Statistics", 
        "unit": "1 to 2", 
        "unitType": "RANGE"
    }, 
    "STATS 297SL": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Seminar, three hours; fieldwork, 10 hours. To further knowledge by applying what students have learned in class to an actual service work setting under guidance of faculty mentor. Interaction with nonprofit organizations can be either on location or over the Internet. May be used for M.S. thesis; research paper/project required. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Service Learning and Community Learning for Statistics", 
        "unit": "2 to 4", 
        "unitType": "RANGE"
    }, 
    "STATS 35": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Exploration of some main topics in introductory probability theory, especially discrete probability problems, that are useful in wide variety of scientific applications. Topics include conditional probability and conditional expectation, combinatorics, laws of large numbers, central limit theorem, Bayes theorem, univariate distributions, Markov processes, and Brownian motion. Examination of computer simulation in depth and discussion of computational approximations of solutions to complex problems using R, with examples of situations and concepts that arise naturally when playing Texas Hold'em and other games. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Probability with Applications to Poker", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 375": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Seminar, to be arranged. Preparation: apprentice personnel employment as teaching assistant, associate, or fellow. Teaching apprenticeship under active guidance and supervision of regular faculty member responsible for curriculum and instruction at UCLA. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Teaching Apprentice Practicum", 
        "unit": "1 to 4", 
        "unitType": "RANGE"
    }, 
    "STATS 400": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Preparation: calculus and linear algebra. Limited to Master of Applied Statistics students. Introduction to probability theory, probability models, and stochastic processes, with emphasis on concepts, intuitions, calculations, and real applications. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Probability Modeling", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 401": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Limited to Master of Applied Statistics students. Overview of fundamental concepts of data analysis and statistical inference and how these are applied in wide variety of settings. Arc of statistical investigation, including data collection, data exploration, formal inference, and model checking. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Survey of Methods in Modern Statistics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 402": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Limited to Master of Applied Statistics students. Introduction to state-of-art applications of linear model for understanding systems and predicting outcomes. Topics include review of statistical inference, properties of least-squares estimates, interpreting linear model, prediction and confidence intervals, model building, diagnostics, and bootstrapping. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Applied Regression", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 403": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Limited to Master of Applied Statistics students. Basic concepts of mathematical statistics and their applications. Mathematics used to prove various statistical theories, with emphasis on real-world applications. Estimation and statistical inference. Random variables and their distributions; random vectors, their means, variances, variance covariance matrix; and important limit theorems such as central limit theorem. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Mathematical Statistics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 404": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Limited to Master of Applied Statistics students. Fundamentals of statistical programming using R, C, and C++. R is currently state-of-art for statistical computing, simulation, statistical graphics, and analysis of data. C and C++ perform computations much faster, and added speed is necessary for analysis of large datasets and for high-level computations, particularly those involving loops and object-oriented programming. Performance of simulations and analysis of real datasets using C, C++, and R. Fundamental principles and techniques for programming in these languages. How to use and interpret results of important functions in R packages. Statistical applications involve linear and nonlinear regression, shrinkage methods, density estimation, numerical optimization, maximum likelihood estimation, classification, and resampling. Graphics and real examples used to illustrate techniques. Analyses of both real and simulated data. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Statistical Computing and Programming", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 405": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Limited to Master of Applied Statistics students. Basic principles of data management, including reading and writing various forms of data, working with databases, data cleaning, validation, transformation, exploratory data analysis, and introductory data visualization and data mining techniques. Exploration of related issues of data security, ethics, and scalability. Introduction to and use of variety of software and languages, such as Python, SQL, Stata, SAS, R. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Data Management", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 411": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Requisites: courses 10, 20, and 101A, or equivalent level of discipline. Limited to Master of Applied Statistics students. Offers students working knowledge of basic concepts underlying most important multivariate techniques, with overview of actual applications in various fields, and with experience in using such techniques on problem of their own choosing. Addresses underlying mathematics and problems of applications. Reasonable level of competence in both statistics and mathematics is required. Letter grading.", 
        "prerequisiteDescription": "courses 10, 20, and 101A, or equivalent level of discipline", 
        "prerequisites": [], 
        "title": "Multivariate Statistical Analysis", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 412": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Limited to Master of Applied Statistics students. Often we are interested in making inferences and predictions from data, either by (1) estimating particular meaningful parameters of models or (2) finding best fitting model that we can then manipulate to produce useful outputs such as predictions or counterfactual estimates. Focus on what is done when linear models are not appropriate and may produce misleading estimates. Generalized linear model and maximum likelihood methods as essential tools all statistics students should understand. Examination of shift gears to explore regression and classification techniques that have been ubiquitous in machine learning literature in recent years, with special attention to regularization and kernelized methods. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Advanced Regression and Predictive Modeling", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 413": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Limited to Master of Applied Statistics students. Recommended preparation: linear algebra, calculus, basic computer programming knowledge. Introduction to machine learning and data mining methods. To gain in-depth understanding of these methods, implementation of them in R, Python, and C++. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Machine Learning", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 414": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Limited to Master of Applied Statistics students. Overview of theory and practice of expectation maximization (EM) optimization methods, bootstrap, Monte Carlo simulation, and Markov chain Monte Carlo. Coverage of missing data, EM algorithm and its variants, nonparametric and parametric bootstrap, bootstrap inference, permutation tests, rejection sampling, importance sampling, Metropolis/Hastings algorithm, and Gibbs sampling, with brief introduction to Bayesian computing. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Computer Intensive Methods", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 415": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Limited to Master of Applied Statistics students. Designed for physical and social sciences students who are interested in using statistics and its applications for forecasting and data-driven decisions and for life sciences and medical school students who are interested in modeling of historical data to predict outcomes. Introduction to state-of-art statistical methods that rely on historical data collected in past to forecast future outcomes. Coverage of models used for forecasting only one measurement type and models used to forecast several types of measurements simultaneously. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Introduction to Forecasting", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 416": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Requisites: courses 401, 402, 403. Limited to Master of Applied Statistics students. Introduction to fundamentals of analysis of types of spatial and spatial-temporal datasets frequently arising in geostatistical problems. Geostatistical data arise commonly in nearly every science, wherever spatial and spatial-temporal data are obtained. Examples include geology, hydrology, traffic, air and water pollution, epidemiology, economics, geography, waste management, forestry, oceanography, meteorology, and agriculture. Theory and modern methods for analyzing both lattice and point process data using R, and student performances of their own analysis of geostatistical datasets involving variogram modeling, kriging, model fitting, and estimation using maximum likelihood and nonparametric methods. S/U or letter grading.", 
        "prerequisiteDescription": "courses 401, 402, 403", 
        "prerequisites": [], 
        "title": "Applied Geostatistics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 417": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Limited to Master of Applied Statistics students. Exposure to several statistical techniques used in investment theory, and hands-on experience by applying various models on real stock market data using package stockPortfolio of open source statistical software R. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Models in Finance", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 418": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Requisites: courses 404, 405. Limited to Master of Applied Statistics students. Tools for data acquisition, transformation and analysis, data visualization, and machine learning and tools for reproducible data analysis, collaboration, and model deployment used by data scientists in practice. Advanced R packages, analytical databases, high-performance machine learning libraries, big data tools. S/U or letter grading.", 
        "prerequisiteDescription": "courses 404, 405", 
        "prerequisites": [], 
        "title": "Tools in Data Science", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 419": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Requisites: courses 402, 403. Limited to Master of Applied Statistics students. Fundamentals of designing experiments to gain maximal information while minimizing costs. Topics include role of randomization and blocking, comparing two or more treatments, randomized blocks, factorial design, Latin square designs, fractional factorial designs, response surface designs. S/U or letter grading.", 
        "prerequisiteDescription": "courses 402, 403", 
        "prerequisites": [], 
        "title": "Experimental Design", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 420": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Requisite: course 400. Recommended requisites: courses 401, 402, 403, 404, 405. Limited to Master of Applied Statistics students. Variety of designs and methods, including experiments, matching, regression, panel methods, difference-in-differences, synthetic control methods, instrumental variable estimation, regression discontinuity designs, and sensitivity analysis. Basic skills from probability and statistics. Applications drawn from various fields including political science, public policy, economics, and sociology. Skills developed apply to any discipline in which investigators seeks to make causal statements but cannot fully randomize treatment. Letter grading.", 
        "prerequisiteDescription": "courses 401, 402, 403, 404, 405", 
        "prerequisites": [], 
        "title": "Causal Inference in Social Science Practice", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 485": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Seminar, one hour. Teaching of researchers and data analysts in use of R, software environment for statistical computing and graphics, in applied settings and taught in three tracks -- data to graphics in R, basic statistical analysis in R, and advanced topics in R. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Statistics Programming and Analysis with R", 
        "unit": "1 to 4", 
        "unitType": "RANGE"
    }, 
    "STATS 495A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Seminar, two hours; intensive training at beginning of Fall Quarter. Required of all potential departmental teaching assistants and new Ph.D. students. Practical and theoretical issues in teaching of statistics. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Teaching College Statistics", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 495B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Seminar, two hours. Weekly discussion and intensive training for all first-year teaching assistants that addresses practical and theoretical issues in using technology to teach statistics, including use of statistical software as education tool. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Teaching College Statistics", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 496": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Tutorial, four hours; field work, two hours. Under faculty supervision, production of substantial paper relating to or arising from internship. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Statistics Internship", 
        "unit": "2 to 4", 
        "unitType": "RANGE"
    }, 
    "STATS 497": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Tutorial, to be arranged. Supervised individual reading and study on project approved by a faculty member. May be repeated for credit. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Directed Individual Study or Research", 
        "unit": "2 to 8", 
        "unitType": "RANGE"
    }, 
    "STATS 498": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Tutorial, four hours. Research on thesis project for MAS students. Project should be original analysis of data that solves pressing problem and is done typically in conjunction with an industry partner. May be repeated for credit with permission from program chair or instructor. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "MAS Thesis Research", 
        "unit": "2 to 8", 
        "unitType": "RANGE"
    }, 
    "STATS 596": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Tutorial, to be arranged. Supervised individual reading and study on project approved by a faculty member. May be repeated for credit. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Directed Individual Study or Research", 
        "unit": "2 to 8", 
        "unitType": "RANGE"
    }, 
    "STATS 598": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Tutorial, to be arranged. Designed for second-year statistics M.S. students. Study and research for M.S. thesis. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "M.S", 
        "unit": "2 to 12", 
        "unitType": "RANGE"
    }, 
    "STATS 599": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Tutorial, to be arranged. Preparation: advancement to Ph.D. candidacy. Study and research for Ph.D. dissertation. May be repeated for credit. S/U grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Ph.D", 
        "unit": "2 to 12", 
        "unitType": "RANGE"
    }, 
    "STATS 88": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Seminar, two hours. Requisite: one course from 10, 11, 12, 13, or 14. Limited to 20 lower division students. Readings and discussions designed to introduce students to current statistical consulting research and fieldwork disciplines. Culminating project may be required. P/NP or letter grading.", 
        "prerequisiteDescription": "one course from 10, 11, 12, 13, or 14", 
        "prerequisites": [], 
        "title": "Sophomore Seminars: Statistics", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 89": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Seminars", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 89HC": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Honors Contracts", 
        "unit": 1, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS 99": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Student Research Program", 
        "unit": "1 to 2", 
        "unitType": "RANGE"
    }, 
    "STATS C116": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours. Preparation: some knowledge of basic calculus and linear algebra. Requisites: courses 100A and 100B, or 101B and 101C, or one course from 10, 11, 12, 13 and one upper division statistics course using regression. Designed for social sciences graduate students and advanced undergraduate students seeking training in data issues and methods employed in social sciences. Concurrently scheduled with course C216. P/NP or letter grading.", 
        "prerequisiteDescription": "courses 100A and 100B, or 101B and 101C, or one course from 10, 11, 12, 13 and one upper division statistics course using regression", 
        "prerequisites": [], 
        "title": "Social Statistics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS C145": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours. Enforced requisite: course 100B. History of statistical methodology and its role within scientific community. Philosophical tenets of statistics; use of concept of probability as transparent and relatively objective means of evaluating empirical observations. Theory of statistical hypothesis generation and hypothesis testing. Designed to provide understanding and perspectives on role of statistics in modern science, theory of statistics, and its strengths and weaknesses. Concurrently scheduled with course C245. P/NP or letter grading.", 
        "prerequisiteDescription": "course 100B", 
        "prerequisites": [
            [
                "STATS 100B"
            ]
        ], 
        "title": "History and Theory of Statistics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS C151": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours. Requisites: courses 100C, 101A. Basic principles, analysis of variance, randomized block designs, Latin squares, balanced incomplete block designs, factorial designs, fractional factorial designs, minimum aberration designs, robust parameter designs. Concurrently scheduled with course C225. P/NP or letter grading.", 
        "prerequisiteDescription": "courses 100C, 101A", 
        "prerequisites": [], 
        "title": "Experimental Design", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS C155": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Designed for upper division and graduate students in social or life sciences and those who plan to major in Statistics. Topics include methods of sampling from finite populations, sources of sampling and estimation bias, and methods of generating efficient and precise estimates of population characteristics. Practical applications of sampling methods via lectures and hands-on laboratory exercises. Concurrently scheduled with course CM248. P/NP or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Applied Sampling", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS C161": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours. Requisites: course 100B, Mathematics 33A. Introduction to pattern analysis and machine intelligence designed for advanced undergraduate and graduate students. Concurrently scheduled with course C261. P/NP or letter grading.", 
        "prerequisiteDescription": "course 100B, MATH 33A", 
        "prerequisites": [], 
        "title": "Introduction to Pattern Recognition and Machine Learning", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS C173": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Requisite: course 100C (may be taken concurrently) or 101B. Geostatistics can be applied to many problems in other disciplines such as hydrology, traffic, air and water pollution, epidemiology, economics, geography, waste management, forestry, oceanography, meteorology, and agriculture and, in general, to every problem where data are observed at geographic locations. Acquisition of knowledge from different areas that can be used to analyze real spatial data problems and to connect geostatistics with geographic information systems (GIS). Concurrently scheduled with course C273. P/NP or letter grading.", 
        "prerequisiteDescription": "course 100C (may be taken concurrently) or 101B", 
        "prerequisites": [], 
        "title": "Applied Geostatistics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS C180": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Enforced requisites: course 100B, Mathematics 32B. Designed for juniors/seniors. Introduction to statistical inference based on use of Bayes theorem, covering foundational aspects, current applications, and computational issues. Topics include Stein paradox, nonparametric Bayes, and statistical learning. Examples of applications vary according to interests of students. Concurrently scheduled with course C236. P/NP or letter grading.", 
        "prerequisiteDescription": "course 100B, MATH 32B", 
        "prerequisites": [], 
        "title": "Introduction to Bayesian Statistics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS C183": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours. Requisite: course 100B. Designed for juniors/seniors and graduate students. Statistical techniques in investment theory using real market data. Portfolio management, risk diversification, efficient frontier, single index model, capital asset pricing model (CAPM), beta of a stock, European and American options (Black/Scholes model, binomial model). Concurrently scheduled with course C283. P/NP or letter grading.", 
        "prerequisiteDescription": "course 100B", 
        "prerequisites": [
            [
                "STATS 100B"
            ]
        ], 
        "title": "Statistical Models in Finance", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS C216": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours. Preparation: some knowledge of basic calculus and linear algebra. Requisites: courses 100A and 100B, or 101B and 101C, or one course from 10, 11, 12, 13 and one upper division statistics course using regression. Designed for social sciences graduate students and advanced undergraduate students seeking training in data issues and methods employed in social sciences. Concurrently scheduled with course C116. S/U or letter grading.", 
        "prerequisiteDescription": "courses 100A and 100B, or 101B and 101C, or one course from 10, 11, 12, 13 and one upper division statistics course using regression", 
        "prerequisites": [], 
        "title": "Social Statistics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS C225": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours. Basic principles, analysis of variance, randomized block designs, Latin squares, balanced incomplete block designs, factorial designs, fractional factorial designs, minimum aberration designs, robust parameter designs. Concurrently scheduled with course C151. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Experimental Design", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS C236": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Recommended requisite: course 200A or 200B. Designed for graduate students. Introduction to statistical inference based on use of Bayes theorem, covering foundational aspects, current applications, and computational issues. Topics include Stein paradox, nonparametric Bayes, and statistical learning. Examples of applications vary according to interests of students. Concurrently scheduled with course C180. S/U or letter grading.", 
        "prerequisiteDescription": "course 200A or 200B", 
        "prerequisites": [], 
        "title": "Introduction to Bayesian Statistics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS C245": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours. History of statistical methodology and its role within scientific community. Philosophical tenets of statistics; use of concept of probability as transparent and relatively objective means of evaluating empirical observations. Theory of statistical hypothesis generation and hypothesis testing. Designed to provide understanding and perspectives on role of statistics in modern science, theory of statistics, and its strengths and weaknesses. Concurrently scheduled with course C145. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "History and Theory of Statistics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS C261": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours. Requisites: course 100B, Mathematics 33A. Introduction to pattern analysis and machine intelligence designed for advanced undergraduate and graduate students. Concurrently scheduled with course C161. S/U or letter grading.", 
        "prerequisiteDescription": "course 100B, MATH 33A", 
        "prerequisites": [], 
        "title": "Introduction to Pattern Recognition and Machine Learning", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS C273": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours; discussion, one hour. Geostatistics can be applied to many problems in other disciplines such as hydrology, traffic, air and water pollution, epidemiology, economics, geography, waste management, forestry, oceanography, meteorology, and agriculture and, in general, to every problem where data are observed at geographic locations. Acquisition of knowledge from different areas that can be used to analyze real spatial data problems and to connect geostatistics with geographic information systems (GIS). Concurrently scheduled with course C173. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Applied Geostatistics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS C283": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "Lecture, three hours. Recommended requisite: course 100B. Designed for graduate students. Statistical techniques in investment theory using real market data. Portfolio management, risk diversification, efficient frontier, single index model, capital asset pricing model (CAPM), beta of a stock, European and American options (Black/Scholes model, binomial model). Concurrently scheduled with course C183. S/U or letter grading.", 
        "prerequisiteDescription": "course 100B", 
        "prerequisites": [
            [
                "STATS 100B"
            ]
        ], 
        "title": "Statistical Models in Finance", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS CM248": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "(Same as Epidemiology M216.) Lecture, three hours; discussion, one hour. Designed for upper division and graduate students in social or life sciences and those who plan to major in Statistics. Topics include methods of sampling from finite populations, sources of sampling and estimation bias, and methods of generating efficient and precise estimates of population characteristics. Practical applications of sampling methods via lectures and hands-on laboratory exercises. Concurrently scheduled with course C155. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Applied Sampling", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS M154": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "(Same as Psychology M144.) Lecture, three hours. Requisite: one course from 10, 12, 13, or Psychology 100A. Selected theories for quantification of psychological, educational, social, and behavioral science data. Classical test, factor analysis, generalizability, item response, optimal scaling, ordinal measurement, computer-adaptive, and related theories. Construction of tests and measures and their reliability, validity, and bias. P/NP or letter grading.", 
        "prerequisiteDescription": "one course from 10, 12, 13, or Psychology 100A", 
        "prerequisites": [], 
        "title": "Measurement and Its Applications (Effective Fall 2018 )", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS M171": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "(Same as Geography M171.) Lecture, three hours; laboratory, one hour. Requisite: one course from 10, 11, 12, 13, or 14. Introduction to methods of measurement and interpretation of geographic distributions and associations. P/NP or letter grading.", 
        "prerequisiteDescription": "one course from 10, 11, 12, 13, or 14", 
        "prerequisites": [], 
        "title": "Introduction to Spatial Statistics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS M222": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "(Same as Geography M205 and Urban Planning M215.) Lecture, three hours. Designed for graduate students. Survey of modern methods used in analysis of spatial data. Implementation of various techniques using real data sets from diverse fields, including neuroimaging, geography, seismology, demography, and environmental sciences. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Spatial Statistics", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS M230": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "(Same as Biomathematics M280 and Biostatistics M280.) Lecture, three hours. Requisites: course 100C, Mathematics 115A. Introduction to theory and design of statistical programs: computing methods for linear and nonlinear regression, dealing with constraints, robust estimation, and general maximum likelihood methods. Letter grading.", 
        "prerequisiteDescription": "course 100C, MATH 115A", 
        "prerequisites": [], 
        "title": "Statistical Computing", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS M231": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "(Same as Computer Science M276A.) Lecture, three hours; discussion, one hour. Designed for graduate students. Fundamental concepts, theories, and algorithms for pattern recognition and machine learning that are used in computer vision, image processing, speech recognition, data mining, statistics, and computational biology. Topics include Bayesian decision theory, parametric and nonparametric learning, clustering, complexity (VC-dimension, MDL, AIC), PCA/ICA/TCA, MDS, SVM, boosting. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Pattern Recognition and Machine Learning", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS M232A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "(Same as Computer Science M266A.) Lecture, three hours. Preparation: basic statistics, linear algebra (matrix analysis), computer vision. Computer vision and pattern recognition. Study of four types of statistical models for modeling visual patterns: descriptive, causal Markov, generative (hidden Markov), and discriminative. Comparison of principles and algorithms for these models; presentation of unifying picture. Introduction of minimax entropy and EM-type and stochastic algorithms for learning. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Statistical Modeling and Learning in Vision and Cognition", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS M232B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "(Same as Computer Science M266B.) Lecture, three hours. Preparation: basic statistics, linear algebra (matrix analysis), computer vision. Introduction to broad range of algorithms for statistical inference and learning that could be used in vision, pattern recognition, speech, bioinformatics, data mining. Topics include Markov chain Monte Carlo computing, sequential Monte Carlo methods, belief propagation, partial differential equations. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Statistical Computing and Inference in Vision and Cognition", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS M241": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "(Same as Computer Science M262C.) Lecture, four hours. Requisite: one graduate probability or statistics course such as course 200B, 202B, or Computer Science 262A. Review of Bayesian networks, causal Bayesian networks, and structural equations. Learning causal structures from data. Identifying causal effects. Covariate selection and instrumental variables in linear and nonparametric models. Simpson paradox and confounding control. Logic and algorithmization of counterfactuals. Probabilities of counterfactuals. Direct and indirect effects. Probabilities of causation. Identifying causes of events. Letter grading.", 
        "prerequisiteDescription": "one graduate probability or statistics course such as course 200B, 202B, or COM SCI 262A", 
        "prerequisites": [], 
        "title": "Current Topics in Causal Modeling, Inference, and Reasoning", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS M242": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "(Same as Political Science M208D and Psychology M257.) Lecture, three hours. Introduction to models and methods for analysis of data hypothesized to be generated by unmeasured latent variables, including latent variable analogues of traditional methods in multivariate analysis. Causal modeling: theory testing via analysis of moment structures. Measurement models such as confirmatory, higher-order, and structured-means factory analytic models. Structural equation models, including path and simultaneous equation models. Parameter estimation, hypothesis testing, and other statistical issues. Computer implementation. Applications. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Multivariate Analysis with Latent Variables", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS M243": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "(Same as Epidemiology M204.) Lecture, four hours. Preparation: two terms of statistics or probability and statistics. Recommended requisite: Epidemiology 200C. Principles of deductive logic and causal logic using counterfactuals. Principles of probability logic and probabilistic induction. Causal probability logic using directed acyclic graphs. S/U or letter grading.", 
        "prerequisiteDescription": "Epidemiology 200C", 
        "prerequisites": [], 
        "title": "Logic, Causation, and Probability", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS M244": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "(Same as Education M231E.) Lecture, three hours. Requisites: Education 231A, M231B. Extends path analysis (causal modeling) by considering models with measurement errors and multiple indicators of latent variables. Confirmatory factor analysis, covariance structure modeling, and multiple-group analysis. Identification, estimation, testing, and model building considerations. Letter grading.", 
        "prerequisiteDescription": "Education 231A, M231B", 
        "prerequisites": [], 
        "title": "Statistical Analysis with Latent Variables", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS M250": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "(Same as Epidemiology M211.) Lecture, four hours. Preparation: two terms of statistics (such as Biostatistics 100A, 100B). Enforced requisites: Epidemiology 200B, 200C. Concepts and methods tailored for analysis of epidemiologic data, with emphasis on tabular and graphical techniques. Expansion of topics introduced in Epidemiology 200B and 200C and introduction of new topics, including principles of epidemiologic analysis, trend analysis, smoothing and sensitivity analysis. S/U or letter grading.", 
        "prerequisiteDescription": "Epidemiology 200B, 200C", 
        "prerequisites": [], 
        "title": "Statistical Methods for Epidemiology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS M254": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "(Same as Bioinformatics M223 and Biomathematics M271.) Lecture, three hours; discussion, one hour. Preparation: elementary probability concepts. Requisite: course 100A or 200A or Bioinformatics M221. Introduction to statistical methods developed and widely applied in several branches of computational biology, such as gene expression, sequence alignment, motif discovery, comparative genomics, and biological networks, with emphasis on understanding of basic statistical concepts and use of statistical inference to solve biological problems. Letter grading.", 
        "prerequisiteDescription": "course 100A or 200A or Bioinformatics M221", 
        "prerequisites": [], 
        "title": "Statistical Methods in Computational Biology", 
        "unit": 4, 
        "unitType": "ABSOLUTE"
    }, 
    "STATS M286": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "STATS", 
        "departmentFullName": "Statistics", 
        "description": "(Same as Ecology and Evolutionary Biology M286.) Seminar, two hours. Designed for graduate students. Statistical solutions to complex data analysis and/or experimental design problems encountered by biology graduate students in their own research. S/U or letter grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "Seminar: Statistical Problem Solving for Population Biology", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }
}