{
    "UNIV ST 10A": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "UNIV ST", 
        "departmentFullName": "University Studies", 
        "description": "Seminar, two hours. Not open to students who have completed University Studies 10B, 10C, 10D, or former course 10. Designed to assist first-year students in making successful transition to UCLA by focusing on academic, social, and emotional aspects of transition. Study of research university's history, mission, rigors, expectations of students, and pedagogical implications. Cultivation of formal space on campus where UCLA students learn to engage both diplomatically and collaboratively with diverse community of scholars; to comprehend and apply theoretical foundations of college student development; to navigate complex structure of UCLA; and to be fully aware of their value to intellectual fabric of institution as contributors to innovative research and scholarship. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "ACE UCLA | Critical Strategies to Achieve Undergraduate Excellence for Incoming Freshmen", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "UNIV ST 10B": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "UNIV ST", 
        "departmentFullName": "University Studies", 
        "description": "Seminar, two hours. Not open to students who have completed University Studies 10A, 10C, 10D, or former course 10. Designed to assist first-year international students in making successful transition to UCLA and to U.S. by focusing on academic, social, and emotional aspects of transition. Study of research university's history, mission, rigors, expectations of students, and pedagogical implications. Cultivation of formal space on campus where UCLA students learn to engage both diplomatically and collaboratively with diverse community of scholars; to comprehend and apply theoretical foundations of college student development; to navigate complex structure of UCLA; and to be fully aware of their value to intellectual fabric of institution as contributors to innovative research and scholarship. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "ACE UCLA | Critical Strategies to Achieve Undergraduate Excellence for International Students", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "UNIV ST 10C": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "UNIV ST", 
        "departmentFullName": "University Studies", 
        "description": "Seminar, two hours. Not open to students who have completed University Studies 10A, 10B, 10D, or former course 10. Designed to assist life sciences majors in making successful transition to UCLA by focusing on academic, social, and emotional aspects of transition. Study of research university's history, mission, rigors, expectations of students, and pedagogical implications. Cultivation of formal space on campus where UCLA students learn to engage both diplomatically and collaboratively with diverse community of scholars; to comprehend and apply theoretical foundations of college student development; to navigate complex structure of UCLA; and to be fully aware of their value to intellectual fabric of institution as contributors to innovative research and scholarship. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "ACE UCLA | Critical Strategies to Achieve Undergraduate Excellence for Life Science Students", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "UNIV ST 10D": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "UNIV ST", 
        "departmentFullName": "University Studies", 
        "description": "Seminar, two hours. Not open to students who have completed University Studies 10A, 10B, 10C, or former course 10. Designed to assist first-year transfer students in making successful transition to UCLA by focusing on academic, social, and emotional aspects of transition. Study of research university's history, mission, rigors, expectations of students, and pedagogical implications. Cultivation of formal space on campus where UCLA students learn to engage both diplomatically and collaboratively with diverse community of scholars; to comprehend and apply theoretical foundations of college student development; to navigate complex structure of UCLA; and to be fully aware of their value to intellectual fabric of institution as contributors to innovative research and scholarship. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "ACE UCLA | Critical Strategies to Achieve Undergraduate Excellence for Incoming Transfers", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "UNIV ST 10E": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "UNIV ST", 
        "departmentFullName": "University Studies", 
        "description": "Seminar, two hours. Not open to students who have completed University Studies 10A, 10B, 10C, 10D, or former course 10. Designed to assist first-generation students in making successful transition to UCLA by focusing on academic, social, and emotional aspects of transition. Study of research university's history, mission, rigors, expectations of students, and pedagogical implications. Cultivation of formal space on campus where UCLA students learn to engage collaboratively with diverse community of scholars; to comprehend and apply theoretical foundations of college student development; to navigate complex structure of UCLA; and to be fully aware of their value to intellectual fabric of institution as contributors to innovative research and scholarship. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "ACE UCLA | Critical Strategies to Achieve Undergraduate Excellence for First-Generation Students", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "UNIV ST 20": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "UNIV ST", 
        "departmentFullName": "University Studies", 
        "description": "Seminar, two hours. Designed to help first-year international students make successful transition to UCLA and to life as college students in U.S. Examination of research on transition of international students to college in U.S., adjustment to life in U.S., policies and procedures, and campus resources. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "ACE UCLA | Critical Strategies to Achieve Undergraduate Excellence for International Students", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }, 
    "UNIV ST 30": {
        "corequisiteDescription": null, 
        "corequisites": [], 
        "departmentAbbreviation": "UNIV ST", 
        "departmentFullName": "University Studies", 
        "description": "Seminar, two hours. Limited to students in Bruin Readmission Program. Designed to provide students who are working toward readmission critical understanding of how they and others arrive at their dismissal status and steps they can take that lead to academic success in future. Examination of research on retention and departure in high education and both individual and collective strategies for academic success. P/NP grading.", 
        "prerequisiteDescription": null, 
        "prerequisites": [], 
        "title": "How to Succeed at UCLA: Retention", 
        "unit": 2, 
        "unitType": "ABSOLUTE"
    }
}